[
  {
    "id": "section_hamd",
    "heading": "حمد",
    "items": [
      {
        "id": "hamd_1",
        "title": "(حمد باری تعالیٰ) وہ یکتا ہے یگانہ ہے وہ ہر عالم کا بانی ہے",
        "content": "وہ یکتا ہے یگانہ ہے وہ ہر عالم کا بانی ہے\n نہ کوئی اسکا ہمسر ہے نہ کوئی اسکا ثانی ہے  \n\nبنا اس کی اجازت کے کوئی پتہ نہیں ہلتا \nوہ تنہا ہے مگر ہر شے پہ اسکی حکمرانی ہے\n \nجب امبر دیکھتا ہوں غور سے حیران ہوتا ہوں \nخلا میں چاند ٹھہرا ہے گھٹا میں چھپ کے پانی ہے \n\nکہیں شاداب ہے دنیا کہیں صحرا ہی صحرا ہے\n کہیں بے رنگ نظارہ ہے کہیں دلکش روانی ہے \n\nوہ خالق ہے جہاں بھر کا وہ مالک ہے جہاں بھر کا\nوہی داتا ہے ہم سب کا اسی کی پاسبانی ہے\n"
      },
      {
        "id": "hamd_2",
        "title": "تیری قدرت ڈالی ڈالی (حمدیہ نظم)",
        "content": "تیری قدرت ڈالی ڈالی\nپتہ پتہ بالی بالی\n\nتیرے دم سے روشن دنیا\nتیرے دم سے گلشن دنیا\n\nموج میں تیرے دم سے روانی\nتیرے دم سے بہتا پانی\n\nتیرا نہیں ہے ثانی کوئی\nتیرا نہیں ہے بانی کوئی\n\nتو ہے تنہا یکتا یگانہ\nتیرے کن سے سارا زمانہ\n\nتیرا جلوہ ذرہ ذرہ\nدریا دریا صحرا صحرا\n\nسنگ تلے بھی کیڑے پالے\nاندھے سانپ کو روزی ڈالے\n\nتو ہی اوّل تو ہی آخر\nتو ہی باطن تو ہی ظاہر\n\nتیری ثناء سے سب ہیں قاصر\nادنیٰ اعلیٰ ماہر شاعر\n\nدھڑکن کی رفتار میں تو ہے\nآدم کی گفتار میں تو ہے\n\nسو بات کی اک بات ہے ثانیؔ\nاللہ باقی سب ہے فانی"
      }
    ]
  },
  {
    "id": "section_naat",
    "heading": "نعت",
    "items": [
      {
        "id": "naat_1",
        "title": "(نعتِ پاکﷺ)محبوب جس کو ہوگئی سنت رسولؐ کی",
        "content": "محبوب جس کو ہوگئی سنت رسولؐ کی\nاس کو ملے گی خلد میں قربت رسولؐ کی\n\nپڑھتے درود پاک ہیں حور و ملک سبھی\nاعلی ہے سب سے اعلی ہے عظمت رسولؐ کی\n\nقرآں میں ایسا کوئی بھی پارہ نہیں ملا\nخود ہی جو کر رہا ہو نہ مِدحت رسولؐ کی\n\nحضرت بلال نازاں ہیں اپنے نصیب پر\nکرنے لگے ہیں جب سے وہ خدمت رسولؐ کی\n\nانگلی کے اک اشارے پر ٹکڑے ہوا قمر\nمنکر یہ دیکھ کتنی ہے عظمت رسولؐ کی\n\nبس وہ ہی مسکرائے گا محشر میں دیکھنا\nعادت ہے جس کو کرنی اطاعت رسولؐ کی\n\nثانیؔ کے پاس کچھ نہیں نیکی کے نام پر\nکچھ ہے اگر تو وہ ہے محبت رسولؐ کی"
      },
      {
        "id": "naat_2",
        "title": "(نعتِ پاکﷺ)جس کا بھی محمد سے واسطہ نہیں ہوگا",
        "content": "جس کا بھی محمد سے واسطہ نہیں ہوگا \n یہ سمجھ لو اس کا توکچھ بھلا نہیں ہوگا\n\nوہ کھڑا منافق کی صف میں ہوگا محشر میں \n عشق جس کے سینے میں  آپ  کا  نہیں  ہو گا \n\nخلد تک نہ پہنچے گا، چاہے وہ کوئی بھی ہو\nراہ  کملی   والے  کی.  گر  چلا  نہیں  ہو گا \n\nہو گا نا محمد کا.نام لیوا گر کوئی \nیہ زمیں فلک کچھ بھی باخدا نہیں ہوگا \n\nپتھریں بھی کھا کر کے جو دعائیں دیتا ہو \nاک   سوائے   احمد  کے.  دوسرا   نہیں  ہو گا \n\nرب کے  آگے محشر میں آپ کے سوا  بولے \nایسا اور کسی کو بھی حوصلہ نہیں ہوا \n\nنعتِ پاک پڑھتے تم ہر گھڑی رہو ثانیؔ \nدیکھنا تمہارے ساتھ کچھ برا نہیں ہوگا "
      }
    ]
  },
  {
    "id": "section_manajat",
    "heading": "مناجات",
    "items": [
      {
        "id": "manajat_1",
        "title": "اک بار مجھے بھی تو طیبہ کو دکھا دے رب",
        "content": "اک بار مجھے بھی تو طیبہ کو دکھا دے رب \nسوئی ہے میری قسمت قسمت کو جگا دے رب\n\nدنیا  میں  جہالت کی  چھائی ہے گھٹا ہر سو \nاک نور کی بدلی کو عالم میں چلا دے رب\n\nعاصی ہوں بہت لیکن امید ہے وابستہ \nاحمد مرسل کے صدقے اپنی تُو رضا دے رب\n\nجب تُو نے مجھے آقا کی اُمّت میں کیا پیدا\nلہجہ بھی مرا آقا  کے لہجے سے  ملا  دے  رب\n\nجس راہ پہ چلنے سے ملتی ہو رضا تیری \nثانیؔ کو مسافر تُو اس رہ کا بنا دے رب"
      }
    ]
  },
  {
    "id": "section_man_ki_yad",
    "heading": "ماں کی یاد میں",
    "items": [
      {
        "id": "man_ki_yad_1",
        "title": "اس دنیا میں تُو نہیں زندہ، اب تنہا گھبراؤں  ماں",
        "content": "اس دنیا میں تُو نہیں زندہ، اب تنہا گھبراؤں  ماں \nتیری جدائی کے غم سے میں، کیسے دل بہلاؤں ماں \n\nمیں نہ تجھ سے دور ہوا جب، تُو کیوں مجھ سے دور ہوئی \nچھوڑ کے مجھ کو جانے پر تُو، کیوں کر کے مجبور ہوئی \nیاد میں تیری کتنا روؤں، کیسے تجھے بتاؤں ماں \nتیری جدائی …………………………………………\n\nتجھ سے بچھڑ کے کیا کیا دکھڑا، اے ماں میں نے اٹھایا ہے \nٹھوکر ماری اُس نے مجھ کو، جس کے جی میں آیا ہے\nآجا  آجا لوٹ کے آجا، ہردم تجھ کو پکاروں ماں \nتیری جدائی …………………………………………\n\nخوابوں میں ہی آجا میرے، جی بھر کر دیکھوں تجھ کو \nرہتا ہوں بے چین بہت ہی، کچھ تو ملے راحت مجھ کو \nاِس کے اُس کے جیسے میں بھی، نغمہ خوشی کا گاؤں ماں \nتیری جدائی …………………………………………\n\nپیار سے تیرا پاس بلانا، اور گلے سے لگا لینا \nپھر چہرے کے ہر حصے کو، خوش ہو کر بوسہ دینا، \nدن وہ بھلانا چاہوں پر اک، پل بھی بھلانا پاؤں ماں \nتیری جدائی …………………………………………\n\nدیکھ کے میرے ماتھے پہ بل، ہائی وہ تیرا تڑپ جانا\nمجھ کو ہر پل یاد آتا ہے، الفت کا وہ زمانہ \nکوئی نہیں تیرا ثانی، تجھ کو کہاں سے لاؤں ماں \nتیری جدائی …………………………………………\n"
      }
    ]
  },
  {
    "id": "section_ghazals",
    "heading": "غزلیں",
    "items": [
      {
        "id": "ghazal_1",
        "title": "رہزنی آ نے لگی جب رہبروں کے درمیاں",
        "content": "رہزنی آ نے لگی جب رہبروں کے درمیاں \nایک وحشت سی ہے طاری قافلوں کے درمیاں \n\nریزہ ریزہ اس کو میرے حوصلوں نے کر دیا\nآگیا پتھر کوئی گر راستوں کے درمیاں \n\nدل دعائیں دیتا رہتا ہر گھڑی اس شخص کو \nجو لٹاتا  رہتا خوشیاں غمزدوں کے درمیاں \n\nیہ سمجھ لو وہ ولی ہے آج کے اس دور میں \nحق بیانی جو ہے کرتا باطلوں کے درمیاں \n\nزلفِ دونتا کو جھٹک کر جب وہ محفل سے گئے \nاک قیامت سی ہے برپا عاشقوں کے درمیاں \n\nکس کو فرصت ہے یہاں اب کون حالِ دل سنے \n ہر کوئی الجھا ہوا ہے مسئلوں کے درمیاں "
      },
      {
        "id": "ghazal_2",
        "title": "اگرچہ آرزو ہو یہ کہ خود کو جاوداں کر لیں",
        "content": " اگرچہ آرزو ہو یہ کہ خود کو جاوداں کر لیں \nرقم تاریخ کے پنّوں پہ اپنی داستاں کر لیں \n\nاجل  کے  اے فرشتے آ گیا  اچھا کیا لیکن \n  ”اجازت دے کہ اپنی داستانِ غم بیاں کر لیں“\n\nتمنّا اب  اجالے کی کہیں سے اور کیا  کرنا \nچلو روشن چراغِ دِل جلا کے خود جہاں کر لیں \n\nکوئی مدِّ مقابل پھر نہ ٹھہرے بات پکی ہے \nاگرچہ حوصلے کو خود ہی اپنے کارواں کر لیں \n\n ترنّم  سے شہد  ٹپکے  تحت  سے یہ  فضا  مہکے \nسمجھ میں سب کو آجائے گی گر اردو زباں کر لیں \n\nنہ ہو شرمندگی اس دن ملے جس روز خود سے ہم \nبھلائی کا کوئی بھی کام اے ثانیؔ یہاں کر لیں"
      },
      {
        "id": "ghazal_3",
        "title": "جن کا پرنور عبادت سے جگر ہوتا ہے",
        "content": "جن کا پرنور عبادت سے جگر ہوتا ہے \nایسے لوگوں کی دعاؤں میں اثر ہوتا ہے  \n\nاس زمانے میں بہت کم ہی مگر ہوتا ہے \nجان دینے کا بھی عاشق میں ہنر ہوتا ہے\n\nلے کے تلوار نکل پڑتا  ہے غازیئ   وقت \nجب کسی پہ بھی کہیں ظلم اگر ہوتا ہے \n\n تم کبھی آ کے گلے سے بھی لگا لو دلبر \nاب نہیں خوابوں خیالوں سے گزر ہوتا ہے \n\nفن جسے آتا ہے اوروں کو دغا دینے کا \nآج کل چین سے اس کا ہی بسر ہوتا ہے \n\nاینٹ پتھر سے فقط گھر نہیں بنتا ثانیؔ\nمل کے رہتے ہیں جہاں سب وہی گھر ہوتا ہے "
      },
      {
        "id": "ghazal_4",
        "title": "اسی کے عشق کے سانچے میں ڈھل رہا ہوں میں",
        "content": "اسی کے عشق کے سانچے میں ڈھل رہا ہوں میں \nاسی  کے  واسطے  اتنا  بدل رہا  ہوں میں \n\nگنوا کے عمر کسی بے وفا کی خاطر آج  \nنہ جانے کیوں کفِ افسوس مل رہا ہوں میں \n\nقفس  میں  جیسے  پرندا  تڑپتا رہتا  ہے \n کسی کی یاد میں ایسے  مچل رہا ہوں  میں \n\nمجھے سنبھال سکو تو سنبھال لو آ کر  \nخود ہی میں برف کی طرح پگھل رہا ہوں میں \n\nابھی تجھے کہاں احساس ہے مرے بچے \nبلا کی دھوپ میں کیوں کر کے جل رہا ہوں میں "
      },
      {
        "id": "ghazal_5",
        "title": "روز ہی حادثہ بن بن کے ملا کرتی ہے",
        "content": "روز ہی حادثہ بن بن کے ملا کرتی  ہے\nزندگی کس سے یہاں سچ میں وفا کرتی ہے \n\nراہِ سنسان سے آتی ہیں صدائیں مجھ کو \nاس لئے روح بھی بے چین رہا کرتی ہے\n\nتیرے آمد کے  تصور سے مچل  جاتا ہوں \n”دل کے دروازے پہ دستک سی ہوا کرتی ہے“\n\nوہ مری شان مرا ناز مری جان بھی ہے \n اسکی صورت ہے جو آنکھوں میں بسا کرتی ہے \n\nیہ محبت کی علامت نہیں تو پھر کیا ہے\nرات بھر ساتھ مرے وہ بھی جگا کرتی ہے \n\nموت کا خوف کسی اور کو ہوگا ثانیؔ\nعاشقی موت سے کب یار ڈرا کرتی ہے"
      },
      {
        "id": "ghazal_6",
        "title": "آنکھوں سے بدگمانی کا چشمہ اتار دیکھ",
        "content": "آنکھوں سے بدگمانی کا چشمہ اتار دیکھ \nکتنا  ہے تیری  یاد کا دل پر غبار دیکھ\n\nتیری  تو کوششیں رہیں ہر دم رہے خزاں \nآ ہی گئی چمن میں یہ آخر بہار دیکھ\n\nرنگین یہ جہان تجھے آئے گا نظر \nہو کر کسی پہ تو بھی تو دل سے نثار دیکھ\n\nدل کو لگایا میں نے تو اس میں عجب ہے کیا\nہر ایک کوکسی نہ کسی سے ہے پیار دیکھ \n\nاچھا نہیں ہوں تجھ سے بچھڑ کر میں آج کل \nحالت کبھی  تو آ کے مرے غمگسار دیکھ "
      },
      {
        "id": "ghazal_7",
        "title": "غم کے ساگر سے تو نکال مجھے",
        "content": "غم کے ساگر سے تو نکال مجھے\n”آئینہ پھینک کر سنبھال مجھے“\n\nاس کو دیکھا تو یہ کہا دل نے \nاب رہا کچھ نہیں ملال مجھے\n\nاب تو آٹھوں پہر ستاتا ہے\n لمحہ لمحہ ترا خیال مجھے \n\nپہلے سپنے حسیں دکھائے پھر \nدل کو توڑا کیا نڈھال مجھے  \n\nمیں تو مٹی ہوں چاک کی ثانیؔ \nجیسا چاہے تو ویسا ڈھال مجھے"
      },
      {
        "id": "ghazal_8",
        "title": "درندوں کی حمایت ہو رہی ہے",
        "content": "درندوں کی حمایت ہو رہی ہے\nیہ کیسی اب سیاست ہو رہی ہے\n\nجسے سولی  چڑھانا  چاہیے تھا\nاسی  کی  اب حفاظت  ہو رہی ہے\n\nجہاں بیٹی ہے مریم  اور  سیتا  \nوہیں پامال عصمت  ہو رہی ہے\n\nبھلا انصاف اب  کیسے  ملے گا \nبکاؤ جب عدالت ہو رہی ہے \n\nکسی کو آئینہ جب  سے  دکھایا \nمصیبت  پر مصیبت ہو رہی ہے\n\nیہ کیسی اب ترقی ہم نے کر لی \nبہت  بیمار عادت  ہو رہی ہے \n\nحفاظت گھر کی، ثانیؔ خود ہی کرنا \nلٹیروں کی حکومت ہو رہی ہے \n"
      },
      {
        "id": "ghazal_9",
        "title": "جب سے مجھکو تجھ سے الفت ہو گئی",
        "content": "جب سے مجھکو تجھ سے الفت ہو گئی \nتو ہی میری ہر ضرورت ہو گئی \n\nآپ جب سے دور مجھ سے ہو گئے \nہر مصیبت اپنی قسمت ہو گئی  \n\nایک وحشی ہو گیا ہے پارسا\nاسکو بھی شاید محبت ہوگئی\n\nخون روتی ہے رعایا ان دنوں \nظالموں کی اب حکومت ہوگئی\n\nچھائی رہتی ہے اداسی گھر مرے \nجب سے بیٹی گھر سے رخصت ہو گئی\n\nایک  پاگل کی طرح  دیکھا  مجھے \n”یہ نہ پوچھا کیوں یہ حالت ہو گئی“ \n\nثانیؔ سولی پہ چڑھے گا ایک دن \nحق بیانی کی جو عادت ہو گئی"
      },
      {
        "id": "ghazal_10",
        "title": "عشق میں جاں نثار کون کرے",
        "content": "عشق میں جاں نثار کون کرے \nاب یہاں سچا پیار کون کرے \n\nجو دیا وہ ہے تحفہ موسم کا\nاب خزاں کو بہار کون کرے \n\nسب کو پیسے کی پڑ گئی چاہت \nپھول کا کاروبار کون کرے \n\nآج نقدی کا جب زمانہ ہے\nچاہتیں پھر ادھار کون کرے \n\nجل رہی آگ راہِ الفت میں \nدیکھنا ہے کہ پار کون کرے \n\nبس ترا ہی ترا دیوانہ ہوں \nمجھ کو اپنا شمار کون کرے \n\nتھک تھکا کر کہا مرے دل نے \nعمر  بھر  انتظار  کون کرے \n\nعشق سونا ہے آپ کہتے ہو \n”آپ کا اعتبار کون کرے“"
      },
      {
        "id": "ghazal_11",
        "title": "مجھ کو حسرت ہے اسے دل کے مکاں تک دیکھوں",
        "content": "مجھ کو حسرت ہے اسے دل کے مکاں تک دیکھوں \nبند آنکھوں سے پرے وہم و گماں تک  دیکھوں \n\nتیری چاہت نے یوں نظروں کے ہیں منظر بدلے\nتیری صورت ہی نظر آئے جہاں تک دیکھوں \n\nاسکی نظریں تو نئے روز نظارے دیکھیں \n”میں فقط ایک ہی تصویر کہاں تک دیکھوں“ \n\nمیرے آگے ہی وہ گلشن کو جلائے میرے \nاور مجبور کرے ہے کہ دھواں تک دیکھوں \n\nمجھ کو بخشی ہے محبت  نے کرامت  ایسی \nکوئی دیکھے نہ جہاں تک میں وہاں تک دیکھوں \n\nوقت دکھلاتا ہے سب کو ہی تماشا ثانیؔ \nورنہ یہ کس کی تمنا ہے خِزاں تک دیکھوں "
      },
      {
        "id": "ghazal_12",
        "title": "کتنا کرتے ہو پیار آج کہو",
        "content": "کتنا کرتے ہو پیار آج کہو\nکب سے تھا انتظار آج کہو \n\n غیر کے کہنے سے بغاوت کی\nکون ہے غمگسار آج کہو \n\nملک کو لگ گئی نظر کس کی \nکیوں ہے یہ انتشار آج کہو \n\nقرض پہلا نہ جب چکا پائے \nکیسے لوگے ادھار آج کہو \n\nپیٹھ پیچھے بہت پھدکتے تھے \nروبرو  ہوں میں یار آج کہو \n\nعقل والوں نے دل گنوا ڈالا \nکون ہے ہوشیار آج کہو\n\nبھائی بھائی کے درمیاں ثانیؔ \nپڑ گئی کیوں درار آج کہو"
      },
      {
        "id": "ghazal_13",
        "title": "جو چھوڑا تھا اسی پر آگیا نا",
        "content": "جو چھوڑا تھا اسی پر آگیا نا\nترے ہاتھوں میں خنجر آگیا نا\n\nمیں کہتا تھا کبوتر مت اڑانا \nبچارا زخم کھا کر آگیا نا \n\nبہت آساں سمجھتے تھے وفا کو \nتمہیں بھی یار چکر آگیا نا \n\nنتیجہ یہ تمہاری سوچ کا ہے  \nحکومت میں ستمگر آگیا نا  \n\nہمارے قتل پہ کل تم ہی چپ تھے \nتمہارا بھی تو نمبر آگیا نا \n\nادب کی ساری دیواریں گرا کر \nسرِ محفل وہ جوکر آگیا نا\n\nقسم کھا کر گیا تھا گاؤں سے تو\nمگر ثانیؔ پلٹ کر آگیا نا\n"
      },
      {
        "id": "ghazal_14",
        "title": "زمیں کے ساتھ امبر بولتا ہے",
        "content": "زمیں کے ساتھ امبر بولتا ہے\nخدا اک ہے یہ منظر بولتا ہے \n\nوہی حق ہے جوحق  پر  بولتا ہے \nمجاہد کا کٹا سر بولتا ہے\n\nوہ جب اللہ اکبر بولتا ہے\nعدو کے چہرے پہ ڈر بولتا ہے\n\nاگر حق پہ  ہو انساں تو قسم سے \nمدد میں اسکی پتھر بولتا ہے \n\nخطا کر کے کہاں میں جی سکوں گا \nمرے دل کا قلندر بولتا ہے \n\nکسی ظالم کے آگے سر جھکا دو \nیہ کب کوئی سخنور بولتاہے \n\nبڑوں سے جس کو ملتی ہیں دعائیں \nاسی کا  تو.مقدر  بولتا ہے\n\nدلاور تم اسے سمجھو یہاں جو \nستمگر کو ستمگر بولتا ہے \n\nلہو سے تر فضا ہے آج ساری \nیہ سہما سہما منظر بولتا ہے \n\nصلہ تجھ کو ملا ہے  پرورش کا \nیہ  بیٹا جو  پلٹ کر  بولتا  ہے\n\nہے خطرہ حق بیانی میں اے لوگو \nمگر ثانیؔ برابر بولتا ہے"
      },
      {
        "id": "ghazal_15",
        "title": "اس کے سوا کسی سے محبت نہیں ہوئی",
        "content": "اس کے سوا کسی سے محبت نہیں ہوئی \n لیکن یہ بات کہنے کی ہمت نہیں ہوئی \n\nہم منتظر ہیں آج بھی ان کے لیے مگر \nان کو پلٹ کے آنے کی فرصت نہیں ہوئی \n\nاترا رہے تھے کل میاں عقل و شعور پر\nتم سے بھی اپنے دل کی حفاظت نہیں ہوئی \n\nہر سو ہوا دھواں دھواں لاشوں کا  ڈھیر ہے \nایسی کبھی تو شہر کی حالت نہیں ہوئی \n\nخوش ہو کے اپنی زندگی غربت میں کاٹ لی\nطابع کسی کے میری ضرورت نہیں ہوئی \n\nشیطان کیوں نہ ایسے گھروں میں کریں گے راج\nمدت سے جن گھروں میں تلاوت نہیں ہوئی \n\nثانیؔ ہمارے گھر کا محافظ بنا ہے وہ\nاپنے ہی گھر کی جس سے حفاظت نہیں ہوئی "
      },
      {
        "id": "ghazal_16",
        "title": "عقل حیراں ہے مری آج وہ کیا کہتے ہیں",
        "content": "عقل حیراں  ہے مری آج وہ کیا کہتے ہیں \nآنکھ والے بھی، اندھیرے کو ضیاء کہتے ہیں \n\nآپ بھی جانچ لیں، دنیا کی حقیقت کیا ہے \nہم نے جانچاہے تبھی اس کو بُرا کہتے ہیں \n\nان سے الفت ہے ہمیں بس یہ سبب ہے ورنہ  \nہم کسی کے کہاں نخرے کو ادا کہتے ہیں \n\nکیا بڑی  بات جو  تم پر  بھی  اٹھی ہے  انگلی \n”ہوتی  آئی  ہے کہ اچھوں کو برا کہتے  ہیں“\n\nمعتبر وہ تو کبھی ہو نہیں سکتے ثانی\nاپنے ہونٹوں سے کسی کو جو برا کہتے ہیں"
      },
      {
        "id": "ghazal_17",
        "title": "جو ہوا سو ہوا اماں چھوڑو",
        "content": "جو ہوا سو ہوا اماں چھوڑو \nظلم کا تذکرہ اماں چھوڑو \n\nحادثو، وہ بھی تم مرا رستہ \nروک پاؤ گے کیا اماں چھوڑو \n\nدرد کیسا مجھے دیا اس نے  \nکیا سنو گے بھلا اماں چھوڑو \n\nمجھ کو معلوم ہے کہ کیا ہو تم \nلمبی  یوں پھیکنا اماں چھوڑو \n\nمطلبی دور میں کسی سے بھی\nپیار کا سلسلہ اماں چھوڑو \n\nدل سے کھیلو نہ جب کہا اس سے \nاس نے ہنس کے کہا اماں چھوڑو \n\nجس کا اخلاق ہی نہ بہتر ہو \nوہ بشر ہے بھلا اماں چھوڑو \n\nآپ ثانیؔ رہو ہمیشہ خوش \nآپ قصہ مرا اماں چھوڑو"
      },
      {
        "id": "ghazal_18",
        "title": "رنج و غم اور مصیبت کے سوا",
        "content": "رنج و غم اور مصیبت کے سوا \nزندگی کیا ہے اذیّت کے سوا\n\nاتنے بھی ظلم و ستم ٹھیک نہیں \nکہ بچے کچھ نہ بغاوت کے سوا \n\nتم نہ  چھیڑو کبھی  غیرت کو مری \nپاس کچھ بھی نہیں غیرت کے سوا \n\nہم غریبوں کے گھروں میں صاحب \nاور کیا  رکھا ہے برکت کے سوا \n\nملنے جب بھی کرے دل آ جائیں \nکچھ بچا ہی نہیں فرصت کے سوا \n\nاس کو اپنوں کی محبت نہ ملی\nجسکو کچھ بھاے نہ شہرت کے سوا \n\nایک دن منہ کی کھائے گا وہ\nکچھ نہیں کرتا جو غیبت کے سوا \n\nہم دیوانے ہیں دیوانوں کو کام \nکچھ نہیں آتا ہے الفت کے سوا \n\nدورِ حاضر کے بشر میں ثانیؔ \nآج سب کچھ تو ہے غیرت کے سوا "
      },
      {
        "id": "ghazal_19",
        "title": "پاگل کوئی مجنوں کوئی دیوانہ کہے ہے",
        "content": "پاگل کوئی مجنوں کوئی دیوانہ کہے ہے \nاک تیرے سوا کوئی بھی اچھا نہ کہے ہے \n\nپربت کو  اکھاڑ ے ہے سمندر کو سمیٹے \n”کرکے بھی دکھائے ہے جو دیوانہ کہے ہے“\n \nاے دِل تو اسے بھول جا بہتر یہی ہوگا \nآتش میں یہ جلتے ہوئے پروانہ کہے ہے \n\nمیں نے تو کبھی اس کو پرایا نہیں جانا \nہاں وہ تو مگر مجھ کو ہی بیگانہ کہے ہے \n\nتم لا دو کہیں سے تو مرے یار کو لا دو\nکمبخت یہی  بات مرا شانہ کہے ہے \n\nثانی کی غزل اور نہ محفل میں سنی جائے \nجب جب بھی سنو اپنا ہی افسانہ کہے ہے"
      },
      {
        "id": "ghazal_20",
        "title": "حوصلہ مثلِ پیمبر رکھنا",
        "content": "حوصلہ مثلِ پیمبر رکھنا \nاپنے اندر کئی لشکر رکھنا\n\nمعتبر ہونے کی چاہت ہے گر \nفکر تم اوروں سے بہتر رکھنا \n\nاب تو ممکن ہی نہیں لگتا ہے\nاپنا کردار منور رکھنا  \n\nایک دن مہنگا پڑے گا تجھ کو \nحق غریبوں کا  دبا کر رکھنا \n\nتیرا کردار ہے تیری پہچان \nیاد یہ بات برابر رکھنا \n\nتیرا ایمان گہر ہے ثانیؔ \nاس گہر کو تو بچا کر رکھنا\n "
      },
      {
        "id": "ghazal_21",
        "title": "کرکے اپکار ذرا دیکھ لے دکھیاری پر",
        "content": "کرکے اپکار ذرا دیکھ لے دکھیاری پر\nدل کو تسکین ملا کرتی ہے غم خواری پر\n\n سوچتا ہوں کہ میں بستی سے چلا جاؤں کہیں \nلوگ ہنستے ہیں یہاں دوستو لا چاری  پر\n\nلوٹ کر دنیا کو فنکار سمجھنے والے\nخود ہی کل روئے گا تو دیکھنا ہوشیاری پر\n\nوقت نے آج کہاں لا کے اسے چھوڑاہے \nناز جس کو تھا کبھی دوستو فنکاری پر\n\nمیری حالت پہ ذرا سوچ سمجھ کے ہنسنا\nرشک کرتی ہے یہ غربت مری خودداری پر\n\nکیا ملے گا تجھے اے ثانیؔ وفا پہ چل کر \n”اب تو انعام دیا جاتا ہے غداری پر“"
      },
      {
        "id": "ghazal_22",
        "title": "کیا کہوں اس نے کیا دیا پھر سے",
        "content": "کیا کہوں اس نے کیا دیا پھر سے \nمجھ کو نشتر لگا دیا پھر سے\n\nمدتوں بعد ہوش آیا تھا \nاس نے جلوہ دکھا دیا پھر سے\n\nبند آنکھوں سے میں نے کینوس پر \nاس کا چہرہ بنا دیا پھر سے \n\nجو اجالا ہی اپنا کھو بیٹھا \nکیسے کہہ دوں بھلا دیا پھر سے \n\nذکر غیروں سے ان کا سنتے ہی \nدل نے محشر اٹھا دیا پھر سے \n\nزخم میرا کرید کر ثانیؔ \nدرد  اس نے بڑھا دیا پھر سے "
      },
      {
        "id": "ghazal_23",
        "title": "دم اکھڑ اکھڑ جائے زندگی بکھر جائے",
        "content": "دم اکھڑ اکھڑ جائے زندگی بکھر جائے \nٹوٹ کر جو سینے میں دل کبھی بکھر جائے \n\nہے بہت اندھیرے میں آج کل میری دنیا \nتم جو لوٹ آؤ تو روشنی بکھر جائے\n\nچین سے یہ پاگل بھی تھوڑی دیر سو لے گا \nزلف کالی کالی گر آپ کی بکھر جائے\n\nموت اتنی مہلت دے کام یہ میں کر جاؤں \nغم سمیٹ لوں سارے اور خوشی بکھر جائے \n\nواسطہ ہے الفت کا آپ مسکرا دیں تو \n اس اداس چہرے پہ تازگی بکھر جائے \n\nآپ کو خبر بھی ہے روٹھنے سے کیا ہوگا\nسچ کہوں تو ثانیؔ کی شاعری بکھر جائے"
      },
      {
        "id": "ghazal_24",
        "title": "الفت میں دل فریفتہ بنائے ہوئے تو ہیں",
        "content": "الفت میں دل فریفتہ بنائے ہوئے تو ہیں \nیعنی کہ خود کا ہوش اڑائے ہوئے تو ہیں  \n\nگرچہ ملے نہ خواب کی تعبیر عمر بھر \nپلکوں پہ اپنے خواب سجائے ہوئے تو ہیں \n\nمانا کہ اس کو آنے کی فرصت نہیں مگر \nہم آس اسکی پھر بھی لگائے ہوئے تو ہیں \n\nکچھ اور ہو تو وہ بھی لا کر کے دے دو تم \nرنج و الم کا  بوجھ اٹھائے ہوئے تو ہیں \n\nباقی کوئی بھی اب ہمیں چاہت نہیں رہی \nسانسوں میں اس کی خوشبو بسائے ہوئے تو ہیں \n\nوہ ہے مسیحا میرا دوا دے کہ چھوڑ دے  \nزخموں کو اس کو ثانی ؔدکھائے ہوئے تو ہیں"
      },
      {
        "id": "ghazal_25",
        "title": "پاس آ اے مرے یار تھوڑا سا اور",
        "content": "پاس آ اے مرے یار تھوڑا سا اور \nکر مجھے خودسے بیزار تھوڑا سا اور \n\nمیں تمہاری گلی سے چلا جاؤں گا \nمجھکو کرنے دو دیدار تھوڑا سا اور \n\nزندگی تو پھرے گی کہاں در بدر \nپاس آ دوں تجھے پیار تھوڑا سا اور\n\nکام ہمت سے لے اے مرے دل ذرا \nراستہ ہے یہ پرخار تھوڑا سا اور \n\nتو ہر اک صف سے باہر نکل جائے گا \nگر گرا تیرا کردار تھوڑا سا اور\n\nجلد ہی لوٹ آؤں گا پردیس سے \nصبر کر میرے دلدار تھوڑا سا اور \n\nتجھ کو بھی مل ہی جائے گا کوئی خطاب \nتو بڑھا ثانیؔ معیار تھوڑا سا اور \n"
      },
      {
        "id": "ghazal_26",
        "title": "کتنا بھوکا ہے یہ زمانہ بھی",
        "content": "کتنا بھوکا ہے یہ زمانہ بھی\nکھائے چڑیوں کا آب و دانا بھی \n\nجس کی الفت پہ ناز کرتے ہو \nمشورہ ہے کہ آزمانا بھی \n\nمیں ترے انتظار میں رویا \nجب کہ موسم تو تھا سہانا بھی \n\nدیکھ کے ان کو ہنس دیا ورنہ \nمیرا مشکل تھا مسکرانا بھی \n\nجب مخالف ہوا ہو اے ثانیؔ \nہے کرامت دیا جلانا بھی\n"
      },
      {
        "id": "ghazal_27",
        "title": "ہجر میں تمہارا دل کیسے یار لگتا ہے",
        "content": "ہجر میں تمہارا دل کیسے یار لگتا ہے\nسانسوں کا گزرنا بھی مجھ پہ بار لگتا ہے \n\nکل تلک بچھڑنے کا ڈر جسے ستاتا تھا \nوصل آج کل اس کو ناگوار لگتا ہے\n\nچوٹ کھایا ہوتا ہے جو بھی شخص چاہت میں \n پھولوں کا بچھونا بھی اس کو خار لگتا ہے \n\nتم کو کیا خبر ہے کہ ملتی ہے خوشی کتنی \nجب کسی مسافر کا ناؤ پار لگتا ہے \n\nجب تلک وہ رہتا ہے ساتھ میں میرے یارو \nیہ خزاں کا موسم بھی خوشگوار لگتا ہے \n\nلڑکھڑائے پھرتا ہوں آج کل جو میں ثانی ؔ\nاس کی ہی محبت کا یہ خمار لگتا ہے"
      },
      {
        "id": "ghazal_28",
        "title": "کہوں کیا ایک تیری دوستی کو",
        "content": "کہوں کیا ایک تیری دوستی کو\nمحبت تھی نہیں مجھ سے کسی کو\n\nرفاقت ہو گئی جب تیرگی سے \nدیا ٹھکرا رہا ہے روشنی کو\n\nلہو اُنکی بھی آنکھیں رو رہیں آج \nجو آساں کہہ رہے تھے عاشقی کو \n\nجسے چاہو اسے پاگل بنا دو \nمیسر یہ ادا ہے آپ ہی کو \n\nمرے خوابوں میں آئی تھی کبھی جو \nیہ آنکھیں ڈھونڈتی ہیں بس اُسی کو \n"
      },
      {
        "id": "ghazal_29",
        "title": "اس کو پانا مری حسرت ہی سہی",
        "content": "اس کو پانا مری حسرت ہی سہی \nگر یہ غفلت ہے تو غفلت ہی سہی \n\nمیں تو مستی میں رہوں گا ہر دم \nزندگی میں ہو اذیّت ہی سہی \n\nساتھ تیرا ہے گوارا مجھ کو \nدوستی تیری مصیبت ہی سہی\n\nایک شہزادی سے چاہت کر لی \nیہ حماقت ہے حماقت ہی سہی\n\nمری غُربت ہے عنایت تیری\nتو اگر خوش ہے تو غُربت ہی سہی \n\nکر دے ثانی کو تو ہنس کر رخصت \nچاہے رکھ دل میں کدورت ہی سہی "
      },
      {
        "id": "ghazal_30",
        "title": "یہ کرشمہ ہوا آپ ہی کے سبب",
        "content": "یہ کرشمہ ہوا آپ ہی کے سبب \nہر خوشی مل گئی دوستی کے سبب \n\nعقل جاتی رہی ہوش جاتا رہا \nکیا سے کیا ہو گئے عاشقی کے سبب \n\nبھوک بچوں کی ماں سے نہ دیکھی گئی \nآبرو بیچ دی مفلسی کے سبب \n\nاس نئے دور میں یہ ترقی ہوئی \nآدمی مررہا آدمی کے سبب \n\nلوگ دنیا میں ایسے بھی موجود  ہیں \nسرخرو ہوگئے عاجزی کے سبب \n\nمیری آنکھوں نے دیکھے ایسے بھی گھر \nجن کا رتبہ بڑھا لاڈلی کے سبب \n\nثانیؔ منزل ملے گی بھلا کس طرح \nجو ہیں بھٹکے ہوئے رہبری کے سبب "
      },
      {
        "id": "ghazal_31",
        "title": "مرجانا حق کی خاطر دل سے قبول ہے",
        "content": "مرجانا حق کی خاطر دل سے قبول ہے \nمیرے قبیلے کا یہ پْرانا اصول ہے \n\nان کے جمالِ حسن کو سوچو تو غور سے \nالفت  نہ  ہو گئی  تو  غلامی  قبول ہے\n\nتم سے سوال ہے میرا تم ہی جواب دو\nوہ کیسے مسکرائے جو غم سے ملول ہے\n\nاس بار بھی نہ آئے گا معلوم ہے اے دل \nیوں انتظار کرنا تمہارا فضول ہے \n\nاس دل کا کیا مجال کہ اس کو بھلا دے یہ\nاس دل کے گوشے گوشے میں یادوں کی دھول ہے "
      },
      {
        "id": "ghazal_32",
        "title": "پُر سکوں گاؤں نگر تھے پُر سکوں بازار تھا",
        "content": "پُر سکوں گاؤں نگر تھے پُر سکوں بازار تھا \nجب تلک اللہ والا ملک کا سردار تھا\n\nزندگانی کے سفر میں غم کا اک کوہسار تھا \nجب تلک ہم کو تمہارے پیار سے انکار تھا  \n\nٹھوکروں میں تھے ہمارے دنیا کے سب تخت و تاج\nذکرِ رب سے دل ہمارا جب تلک سرشار تھا \n\nاے امیرِ شہر تجھ کو دینا ہو گا اب حساب \nپھر کیوں وہ مارا گیا جو آدمی خوددار تھا \n\nجنگ کیسے جیتی ہم نے دنیا کو حیرانی ھے\nہاتھ میں خنجر نہ کوئی ساتھ میں سالار تھا\n\nہر گھڑی بھرتا ہوں دم میں اس لئے اسلاف کا \nصاف ستھرے لوگ تھے وہ معتبر کردار تھا \n\nکیسے کرتا ثانیؔ اس کے پیار سے انکار میں \nدل نشیں اس کی ادا تھی آنکھوں میں اصرار تھا "
      },
      {
        "id": "ghazal_33",
        "title": "ان کا ہی اعتبار کرتے رہے",
        "content": "ان کا ہی اعتبار کرتے رہے \n جو ہمیں بے قرار کرتے رہے\n\nاپنی دنیا خراب ہوتی رہی \n”ذکرِ فصلِ بہار کرتے رہے“\n\nایک مدت سے وہ نہیں آئے \nہم مگر انتظار کرتے رہے\n\nاسی خانہ خراب کی خاطر \nروز دریا کو پار کرتے رہے \n\nاس کی گلیوں میں آنے جانے کی\nبھول ہم بار بار کرتے رہے \n\nمحنتی لوگ بن گئے سورج\nہم ستارے شمار کرتے رہے "
      },
      {
        "id": "ghazal_34",
        "title": "مجھے فرق کچھ نہیں پڑتا ہے، چاہیے مجھ سے کوئی خفا رہے",
        "content": "مجھے فرق کچھ نہیں پڑتا ہے، چاہیے مجھ سے کوئی خفا رہے \nمرے ساتھ کوئی رہے نہ رہے، مرے ساتھ میرا خدا رہے \n\nمرے درد کا نہ ملال کر، مرے پاس آ میری بات سن \nمرے سامنے ذرا بیٹھ تو، تاکہ غم سے دل یہ  رہا رہے \n\nمرا آخری توسلام لے مراآخری توکلام سن \n یہ دعا ہے تیرے حبیب کی تیرا غم سے رشتہ کٹا رہے \n\nیہ جہان سارا تماشا گھر یہ تماشا دیکھنا ہے مگر \nتجھے جانا ہے اے بشر کہاں. تجھے یاد یہ بھی سدا رہے \n\nمیں دیوانہ عشق کا ہوں میاں. مجھے ڈر نہیں کسی روگ کا \nہے یہ عشق گر کوئی روگ تو. مجھے روگ پھر یہ لگا رہے "
      },
      {
        "id": "ghazal_35",
        "title": "تیری نفرت کو بھی میں نے کب نفرت سے دیکھا ہے",
        "content": "”تیری نفرت کو بھی میں نے کب نفرت سے دیکھا ہے“\nجب بھی دیکھا تجھ کو دلبر بس چاہت سے دیکھا ہے\n\nہم دونوں کی ایک کہانی. ایک سی اپنی حالت ہے\nاک دوجے کو جب جب دیکھا.  بس حیرت سے دیکھا ہے \n\nیہ تو میرا رب جانے ہے یا پھر جانے دل میرا \nارمانوں کو جلتے میں نے کس شدت سے دیکھا ہے \n\nمیرے شانے پہ اس کا سر گھنٹوں گھنٹوں رہتا تھا\nان آنکھوں نے ایسا منظر بھی قسمت سے دیکھا ہے  \n\nاب تو وہ کترانے لگا ہے ثانیؔ مْکھ دکھلانے سے \nجس نے مجھ کو ایک زمانے تک فرصت سے دیکھا ہے"
      },
      {
        "id": "ghazal_36",
        "title": "تم سے وعدہ ہے اس دیوانے کا",
        "content": "تم سے وعدہ ہے اس دیوانے کا \nسر  جھکا  دے  گا  یہ  زمانے  کا\n\nکوئی رستہ ضرور نکلے گا \nحوصلہ کیجیے تو آنے کا \n\nمانا کہ دوست دوست ہوتاہے \nزخم لیکن نہیں دکھانے کا\n\nحالِ دل بے وفا گھمنڈی کو \nفائدہ کچھ نہیں سنانے کا \n\nتم کو اب کون روک پائے گا \nتم نے طے کر لیا ہے جانے کا\n\nدریائے عشق میں نہ اترے وہ \nجس کو خدشہ ہو ڈوب جانے کا \n\nعشق کیجئے مگر یہ یاد رہے\nفدیہ لگتا ہے مسکرانے کا \n\nتیرے کوچے میں دوستی کر لی\nیہ بہانا ہے آنے جانے کا \n\nآج وہ بھی تو ہے نشانے پر \nشوق جس کو تھا آزمانے کا \n\nتیرے بیمار کی گزارش ہے\nترک کر  دے ارادہ  جانے  کا"
      },
      {
        "id": "ghazal_37",
        "title": "گزرا ہے کیسا سانحہ دل خوب جانے ہے",
        "content": "گزرا ہے کیسا سانحہ دل خوب جانے ہے\nکیاہے ستم کا ماجرا دل خوب جانے ہے\n\nہونے نہ دیں گے آپ کی توہین جیتے جی \nکس کی خطا ہے آپ کا  دل خوب جانے ہے \n\nبس آپ لطف لیجیے بھرپور وصل کا \nدشوار کتنا رستہ تھا دل خوب جانے ہے \n\nمنزل پہ آ کے کیوں نہ میں شکرِ خدا کروں \nتھا کون روڑا رستے کا دل خوب جانے ہے \n\nمحفوظ میرے پاس ہے تحفہ ہر ایک کا\nکس نے ہے مجھ کو کیا دیا دل خوب جانے ہے \n\nثانیؔ کبھی بھی آپ شکایت نہ کیجئے \nکیا ہے وفا کا ضابطہ دل خوب جانے ہے\n"
      },
      {
        "id": "ghazal_38",
        "title": "سہمی ہوئی ہے آج فضا گھٹ رہا ہے دم",
        "content": "سہمی ہوئی ہے آج فضا گھٹ رہا ہے دم \nزہریلی ہو گئی ہے ہوا گھٹ رہا ہے دم\n\nسارے جہاں میں برپا قیامت سی ہو گئی \nآئی ہے کیسی یار وبا گھٹ رہا ہے دم\n\nجو بھی ہے بات آ کے سنا تو وہ روبرو \nخاموشیوں پہ تیری مرا گھٹ رہا ہے دم\n\nدنیا  کے کہنے پہ کبھی ہوتا نہ  تھا ملال \nتم نے کہا ہے جب سے بْرا گھٹ رہا ہے دم \n\nمیرے حبیب تجھ کو محبت کا واسطہ \nمیرے بھی حق میں کر دے دعا گھٹ رہا ہے دم \n"
      },
      {
        "id": "ghazal_39",
        "title": "جفا تو کر یا وفا اب تو تیری مرضی ہے",
        "content": "جفا تو کر یا وفا اب تو تیری مرضی ہے\nبرا سمجھ یا بھلا اب تو تیری مرضی ہے\n\nہوا کے سامنے ہم نے تو رکھ دیا مولا\nدیا جلا یا بجھا اب تو تیری مرضی ہے\n\nاظہارِ عشق مرا تجھ سے کرنا جرم سہی \nرہائی دے یا سزا اب تو تیری مرضی ہے\n\nمیں تیرے واسطے اپنوں کو چھوڑ آیا ہوں \nگلے لگا نہ لگا  اب تو تیری مرضی ہے\n\nتمہارے سامنے سر خم تمہارا مجرم ہے \nمعافی دے یا سزا اب تو تیری مرضی ہے"
      },
      {
        "id": "ghazal_40",
        "title": "راہ پر دشمنوں کی وہ چلنے لگے ",
        "content": "راہ پر دشمنوں کی وہ چلنے لگے\nدوست میرے سبھی اب بدلنے لگے\n\nرہنماؤں نے مجھ کو ہے گمراہ کیا\nپاؤں منزل کی جانب جو چلنے لگے\n\nاب محافظ چمن کا میاں کون ہے\nخود ہی مالی گلوں کو مسلنے لگے\n\nمیرے  ہونٹوں  پہ کلمہئ  توحید ہو\nیا خدا  جب  مرا  دم  نکلنے  لگے \n\nعمر بھر میں جنہیں دوست کہتا رہا\nمیری شہرت سے ثانیؔ وہ جلنے لگے"
      },
      {
        "id": "ghazal_41",
        "title": "تری آنکھوں میں جو کاجل نہیں ہے",
        "content": "تری آنکھوں میں جو کاجل نہیں ہے\nفلک  پہ  دور  تک  بادل  نہیں  ہے\n\nوفا کا ایک حامی میں یہاں ہوں \nمرے جیسا کوئی پاگل نہیں ہے\n\nاگر  پتھر  نہیں تو  پھر وہ کیا ہے\nدَیا کا جس میں گنگا جل نہیں ہے\n\nیہاں  تو  قتل  ہوتا   ہے  برابر\nمگر دیکھو یہاں مقتل نہیں ہے \n\nکسی کے ہجر نے خاموش کیا ہے\nمری دنیا میں اب ہلچل  نہیں ہے \n\nتجھے  کیسے  بتاؤں  کہ  ترے بن \nمجھے  آرام  پل دو پل  نہیں  ہے \n\nوفا   کا   مسئلہ   ایسا    ہے    ثانیؔ \nسہی پوچھو تو کوئی حل نہیں ہے\n"
      },
      {
        "id": "ghazal_42",
        "title": "اب رہائی یا ضمانت ہو نہ ہو",
        "content": "اب  رہائی  یا  ضمانت  ہو  نہ  ہو \nعشق تو ہے ہم کو راحت ہو نہ ہو \n\nجو ابھی ہے ایسی صورت ہو نہ ہو \nکل مجھے بھی تیری چاہت ہو نہ ہو \n\nایک  تیری  بس  عنایت  کافی  ہے\nاب کسی کی بھی عنایت ہو نہ ہو \n\nآپ کی مجھ کو ضرورت ہے بہت \nآپ کو میری ضرورت ہو نہ ہو\n\nآ گیا  ہوں عشق کے  بازار  میں \nفائدے کی یہ تجارت ہو نہ ہو\n\nآنکھ  بھر کر  دیکھ  لینے  دو  اسے \nکیا پتا پھر سے زیارت ہو نہ ہو\n\nآؤ بیٹھیں مل کے ثانیؔ آج ہم\nکل میسّر وقتِ فرصت ہو نہ ہو"
      },
      {
        "id": "ghazal_43",
        "title": "اسکی یادوں کے میں لشکر سے گھرا رہتا ہوں",
        "content": " اسکی یادوں کے میں لشکر سے گھرا رہتا ہوں \n پر کٹا  ایک  پرندہ سا  پڑا  رہتا  ہوں \n\nمدتوں  بعد  بھی  آئی  نہ  انہیں  یاد  مری \nجن کی خاطر میں یہاں بت سا بنا رہتا ہوں \n\nاتنی آسانی سے پہچان نہیں مٹ سکتی \nمیں  جہاں  رہتا  ہوں انسان بنا  رہتا ہوں \n\nکیوں زمانے کی کہی باتوں میں آ جاتے ہو \nمیں کسی سے بھی نہیں یار خفا رہتا ہوں \n\nجس کے دل میں نہ ہو احساسِ محبت ثانیؔ\nایسے  لوگو ں سے  بہت  دور  سدا  رہتا  ہوں"
      },
      {
        "id": "ghazal_44",
        "title": "اک نظر دیکھ لو آ کر تم ہو",
        "content": " اک نظر دیکھ لو آ کر تم ہو\nمیری سانسوں میں برابر تم ہو \n\nجی میں آیا کہ ابھی مر جائیں \nاس نے جب بولا کہ لوفر تم ہو\n\nتم کو احساس نہیں تم کیا ہو \nمیری  ہمت مرا  تیور  تم  ہو\n\nکوئی مانے کہ نہ مانے سچ ہے\nچلتا  پھرتا  ہوا  خنجر  تم  ہو \n\nچاند نکلا ہے یہ سب کہتے ہیں \nمجھ کو معلوم ہے چھت پر تم ہو"
      },
      {
        "id": "ghazal_45",
        "title": "کوئی شکوہ نہیں زمانے سے",
        "content": "کوئی شکوہ نہیں زمانے سے\nدل تو ٹوٹا ہے دل لگانے سے\n\nجب مرا دم نکل ہی جائے گا \nفائدہ  ہوگا  پھر کیا  آنے  سے \n\nتو کہیں خود نہ رسوا ہو جائے \nباز  آ بھی  جا  آزمانے  سے\n\nکیسے  تیرے  بغیر  زندہ  ہوں \nدیکھنے  آ  کسی   بہانے   سے \n\nدور کیسا یہ آگیا ثانیؔ\nلوگ ڈرتے  ہیں مسکرانے  سے "
      },
      {
        "id": "ghazal_46",
        "title": "کام ایسا مہان کر بیٹھا",
        "content": "کام   ایسا   مہان  کر   بیٹھا \nاپنی آنکھیں وہ دان کر بیٹھا \n\nاتنی   اونچی    اڑان  کر  بیٹھا \nخود ہی آفت میں جان کر بیٹھا \n\nبھاؤ گلّے کا اب بڑھایا یارو\nخودکشی جب کسان کر بیٹھا \n\nزخم دیتا رہا وہی مجھ کو \nجس کو اپنا میں جان کر بیٹھا \n\nدورِ حاضر میں حق کا پیکر بھی \nخود  کو  اب  بے  زبان  کر  بیٹھا \n\nاس  دیوانے پہ کچھ نہیں صاحب \nایک  دل  تھا  وہ  دان کر  بیٹھا \n\nوہ   عیادت  کو  آئیں گے   ثانیؔ \nمیں  یہ  کیسا  گمان  کر  بیٹھا\n"
      },
      {
        "id": "ghazal_47",
        "title": "کسی سے دل کو لگانے کی کیا ضرورت تھی",
        "content": " کسی سے دل کو لگانے کی کیا ضرورت تھی\nبے وجہ اشک بہانے کی کیا ضرورت تھی\n\nتمہیں تھی ہم سے محبت  تو صاف کہہ دیتے \nگْھما پھرا کے بتانے کی کیا ضرورت تھی \n\nدیارِ عشق میں جب شوق نا تھا مرنے کا\nدیارِ عشق میں آنے کی کیا ضرورت تھی \n\nخطا  ہماری تھی ہم کو ہی بس سزا دیتے  \nہماری بستی جلانے کی کیا ضرورت تھی \n\nاگر ارادہ تھا ثانیؔ کو چھوڑ جانے کا\nتو اتنے پاس بھی آ نے کی کیا ضرورت تھی \n"
      },
      {
        "id": "ghazal_48",
        "title": "آپ سے کیا جدا ہوا ہے دل",
        "content": "آپ سے کیا جدا ہوا ہے دل\nساری دنیا سے ہی خفا ہے دل\n\nجس کسی نے بھی ان کو دیکھا ہے\nان  پہ  اپنا  لٹا گیا  ہے  دل\n\nعشق میں کیا برا ہے کیا اچھا \nعشق میں کب یہ سوچتا ہے  دل \n\nبھول جا ان کو اور خوش رہ تْو \nتجھ سے میرا یہ مشورہ ہے دل\n\nان  سے  ملنا  گِراں  گزرتاہے  \nان سے میرا بہت دْکھا ہے دل \n\nان کو احساسِ غم نہیں تیرا \nجن کی خاطر تْو جل رہا ہے دل \n\nکیسے توڑے گا اب کوئی ثانیؔ\nمیں نے پتھر سا کر لیا ہے دل \n"
      },
      {
        "id": "ghazal_49",
        "title": "یار ہنسنے ہنسانے کا ماحول ہو",
        "content": "یار ہنسنے ہنسانے کا ماحول ہو\nکچھ تو غم کو بھلانے کا ماحول ہو\n\nدل تڑپتے تھے اوروں کا غم دیکھ کر \nآج  پھر  اس  زمانے کا  ماحول  ہو \n\nہم تو جنت سمجھتے ہیں اکثر اسے \nخوش نما جس گھرانے کا ماحول ہو \n\nایک پل بھی ٹھہرتا نہیں میں وہاں \nجس جگہ دل دکھانے کا ماحول ہو\n\nعشق،  چاہت،  محبت،  وفا،  دوستی \nاِن کو دل سے نبھانے کا ماحول ہو \n\nثانی رو رو کے کرتا ہے دل سے دعا \nخوش نما اس زمانے کا ماحول ہو "
      },
      {
        "id": "ghazal_50",
        "title": "آپ جب توڑو گے اپنی خاموشی کا سلسلہ",
        "content": "آپ جب توڑو گے اپنی خاموشی کا سلسلہ \nمسکرا اُٹّھے گا پھر سے دوستی کا سلسلہ\n\nپوچھ لو چاہے کسی سے سب کو ہے معلوم یہ \nتم سے وابستہ ہے میری ہر خوشی کا سلسلہ\n\nفائدہ تیرا ہوا نا فائدہ میرا ہوا \nآؤ مل کر ختم کر دیں دشمنی کا سلسلہ \n\nاک نظر جو دیکھا اس کو پھر نہ پوچھو کیا ہوا \nجڑ گیا ہے زندگی سے عاشقی کا سلسلہ \n\nدل پھٹا جاتا ہے اب تو ثانیؔ کا شام و سحر\nاب خدارا توڑ دیجئے رخی کا سلسلہ"
      },
      {
        "id": "ghazal_51",
        "title": "میں ہوں میٹھا سا اک سمندر دیکھ",
        "content": "میں ہوں میٹھا سا اک سمندر دیکھ  \nمیرے اندر اتر کے د لبر دیکھ \n\nاس کی آنکھوں نے یہ کہا مجھ سے \nہے اجازت تجھے مکرّر دیکھ \n\nہجر میں تیرے اس دیوانے کا \nحال کتنا برا ہے آکر دیکھ \n\nمانگ  لینا فلک سے تارے بھی \nپہلے اپنی تو یار چادر دیکھ \n\nغم لیے کس طرح سے زندہ  ہوں \nایک دن میرے ساتھ جی کر دیکھ"
      },
      {
        "id": "ghazal_52",
        "title": "وفا و پیار کی باتیں",
        "content": "وفا  و  پیار  کی  باتیں \nہیں اب بے کار کی باتیں \n\nزمانہ   اب  نہیں  سنتا \nمیاں خوددار کی باتیں \n\nترقی چاہیے پھر تو \nسنو دربار کی باتیں \n\nاکیلے روز سنتا ہوں \nدر و دیوار کی باتیں \n\nپرانی ہو گئی ہیں اب\nلب و رخسار کی باتیں \n\nکسی بیوا سے مت کرنا \nکبھی سنگھار کی باتیں \n\nسلیقے سے سناتی ہیں \nپری کوہسار کی باتیں \n\nجو اچھا ہے وہ کیوں سمجھے\nکسی    بیمار  کی   باتیں \n\nڈراتی  ہے  بہت  ثانیؔ \nمجھے ہوشیار کی باتیں "
      },
      {
        "id": "ghazal_53",
        "title": "لے تو ساری کی ساری دنیا رکھ",
        "content": "لے تو ساری کی ساری دنیا رکھ \nمیری آنکھوں میں میرا سپنا رکھ \n\nخود کو اب تْو محو تماشا رکھ \nاپنے  لب   پر  لگا  کے  تالا  رکھ \n\n تو یہاں پر سبھی سے رشتہ رکھ \nاپنے  دل  کو  بنا  کے  دریا    رکھ \n\nجس کے من میں جو آیا لکھ ڈالا \nکس نے بولا تھا دل کو سادہ رکھ\n\nہے  تقاضا  یہی  جدائی  کا \nاپنی یادوں میں اس کو زندہ رکھ\n\nکوئی   سنتا   نہیں  کسی  کی  اب \nپاس   اپنے   تو  اپنا   دکھڑا  رکھ \n\nتیری   دنیا   اجڑ  بھی  سکتی  ہے\nاپنے  قابو   میں   اپنا   غصّہ   رکھ \n\nخود   زمانہ   گلے   لگائے   گا\n دل سے  تو  دور بغض وکینہ  رکھ \n\nکامیابی قدم کو چومے گی \nحوصلہ  بر قرار  اپنا  رکھ \n\nصورت حال کچھ بھی ہو ثانیؔ\nاپنے لب پر سدا  تو کلمہ  رکھ "
      },
      {
        "id": "ghazal_54",
        "title": "تنہاتنہا چلنا ہوگا کب تک آخر ہم کو اور",
        "content": "تنہاتنہا چلنا ہوگا کب تک آخر ہم کو اور\nعشق کی آگ میں جلنا ہوگا کب تک آخر ہم کو اور\n\nتمہیں نکالو رستہ کوئی بات ملن تک آپہنچے \nدور سے ہاتھ کو ملنا ہوگا کب تک آخر ہم کو اور \n\n ہردم ہرپل ہر لمحہ سوچتا رہتا ہے سائل \nغیر کے در سے پلنا ہوگا کب تک آخر ہم کو اور \n\nاب تو کرم کر اپنا بنا لے دے دے پیار کی بھیک ہمیں \nتیرے در سے ٹلنا  ہو گا کب تک آخر ہم کو اور \n\nبھول گئے وہ ہم کو یا پھر دور بسا لی بستی ہے \nاس صدمے میں گھلنا ہوگا کب تک آخر ہم کو اور "
      },
      {
        "id": "ghazal_55",
        "title": "کہیں پہ پھول کہیں دل بچھا دیا میں نے",
        "content": "کہیں  پہ پھول کہیں  دل  بچھا  دیا  میں نے \nوہ  آ  رہے  ہیں  یوں  رستہ  سجا دیا میں نے \n\nبس اب تو دیکھنا یہ ہے کہ فیصلہ کیا ہو\nجو مرے دل میں تھا وہ سب سنا دیا میں نے \n\nمری یہ سادگی دیکھو جو میرا قاتل ہے\nاسے تو اپنے ہی گھر کا پتا دیا میں نے\n\nوہ میری راہ میں کانٹے بچھا رہا ہے اب\nوہ جس کو دوستو چلنا سکھا دیا میں نے \n\nیہ بات اور ہے مجھ کو وہ یاد آتا ہے\nیہ بات سچ ہے کہ دل سے بھلا دیا میں نے"
      },
      {
        "id": "ghazal_56",
        "title": "زندگی تھی مری بس وہی زندگی",
        "content": "زندگی تھی مری بس وہی زندگی\nماں کے سائے تلے جو کٹی زندگی\n\nاے اندھیرے مجھے تو ڈرائے گا کیا\nحادثوں میں مری تو پلی زندگی\n\nیہ محبت عجب شے ہے یارو  یہاں \nجس کو بھی مل گئی ہے ملی زندگی\n\nزندگی بھر انا بیچ سکتا نہیں \nمفلسی چھین چاہے مری زندگی\n\nہم نے سیکھا تھا دل بہل جائے گا\nثانیؔ اب بن گئی شاعری زندگی\n"
      },
      {
        "id": "ghazal_57",
        "title": "سامنے بس میرے آئینہ رہ گیا",
        "content": "سامنے بس میرے آئینہ رہ گیا\nکھو گئیں منزلیں راستہ رہ گیا \n\nاس زمانے میں اب اپنا کس کو کہوں \nمطلبی بس یہاں واسطہ رہ گیا \n\nکس طرف جاؤں میں آج حیران ہوں \nہر طرف حادثہ حادثہ رہ گیا \n\nمیرے جینے کی مانگی ہے کیوں کر دعا \nاب ستم آپ کا کون سا رہ گیا \n\nچھوڑ کر چل دیئے دوست ثانیؔ سبھی \nساتھ میرے مرا حوصلہ رہ گیا"
      },
      {
        "id": "ghazal_58",
        "title": "مجھ کو وہ کیا ملے زندگی مل گئی",
        "content": "مجھ کو وہ کیا ملے زندگی مل گئی\nمیرے ہونٹوں کو یارو ہنسی مل گئی\n\nاب سے پہلے بھٹکتا رہا در بدر\nساتھ جب تم چلے رہبری مل گئی\n\nیہ میری زندگانی اندھیروں میں تھی\nتیرا ساتھ جب ملا روشنی مل گئی\n\nمیں غموں کے جہاں سے نکل آ یا ہوں \nتو نے کی جب وفا ہر خوشی مل گئی\n\nیہ میری سانسیں تھمنے لگیں تھیں مگر \nتم کو دیکھا تو پھر زندگی مل گی"
      },
      {
        "id": "ghazal_59",
        "title": "کر لیا تم نے ارادہ یہ کبھی سوچا بھی ہے",
        "content": "کر لیا تم نے ارادہ یہ کبھی سوچا بھی ہے\nاس محبت کے سفر میں دور تک صحرا بھی ہے\n\nبدتمیزی کر رہے ہو تم ابھی جس شخص سے \nجان لے لیگا تمہاری اس کا اک بیٹا بھی ہے \n\nکیا کہوں میں آج کیا ہے عشق کا رتبہ یہاں \nیہ جہاں ہے عشق سے پر عشق پہ پہرا بھی ہے\n\nہم کریں فریاد کیوں جب ہونے والا کچھ نہیں \nجو ہمارا حکمراں ہے گونگا ہے بہرا بھی ہے\n\nتم بلندی پہ پہنچ کے یوں نہ اترایا کرو \nعرش سے گرتے کو میں نے فرش پر دیکھا بھی ہے\n\nاس سخی سے مل کے میرا دل بہت ہی خوش ہوا \nشکرہے مولا کا کوئی تو ہے جو اچھا بھی ہے "
      },
      {
        "id": "ghazal_60",
        "title": "وہ جس نے دیکھا ہو بس روشنی کو",
        "content": "وہ جس نے دیکھا ہو بس روشنی کو \nوہ کیا جانے کسی کی تیرگی کو \n\nکوئی الزام کیوں دوں میں کسی کو \nاداسی  بھا گئی  ہے  زندگی  کو \n\nرفاقت ہو گئی جب تیرگی سے \nدیا ٹھکرا رہا ہے روشنی کو\n\nلہو اُن کی بھی آنکھیں رو رہی ہیں \nجو آساں کہہ رہے تھے عاشقی کو \n\nجسے چاہو اسے پاگل بنا دو \nمیسر یہ  ادا  ہے آپ  ہی  کو \n\nمرے خوابوں میں آئی تھی کبھی جو \nیہ آنکھیں  ڈھونڈتی ہیں بس اُسی کو \n\nہمارے   واسطے  جگنو   بہت   ہیں \nتم   اپنے   پاس  رکھّو  چاندنی  کو "
      },
      {
        "id": "ghazal_61",
        "title": "صدائے حق دبا دے گا ابے جا",
        "content": "صدائے حق دبا دے گا ابے جا\nمجھے سولی چڑھا دے گا ابے جا\n\nمجھے ان آر سی کا ڈر دکھا کر \nمری  نیندیں اڑا دے گا ابے جا\n\nوطن یہ جاں سے بھی پیارا ہے ہم کو \nیہاں سے تو بھگا دے گا ابے  جا \n\nہمارے دل میں ہے بھارت کا نقشہ \nاِسے کیسے  مٹا  دے گا  ابے  جا \n\nہیں بھائی بھائی  ہم ہندو مسلماں \nتو آپس  میں لڑا دے گا  ابے  جا \n\nترا   سپنا  یہ  سپنا ہی  رہے گا \nہمیں اور  تو  مٹا دے گا ابے جا \n\nہماری  شان  ہے اوّل  ہی  رہنا\nہمیں  ثانیؔ  بنا  دے گا  ابے جا"
      },
      {
        "id": "ghazal_62",
        "title": "جاگنا اور جگاتے رہنا",
        "content": "جاگنا اور جگاتے رہنا \nراہ بھولے کو دِکھاتے رہنا \n\nان کا دروازہ کھلے گا اک دن \nحاضری روز لگاتے رہنا \n\nکام  آسان  نہیں  ہے  لیکن \nرسمِ  الفت  کو  نبھاتے  رہنا \n\nآپ کو مہنگا بھی پڑ سکتا ہے \nدل کسی کا یوں دْکھاتے رہنا \n\nعدل و انصاف کی خاطر ثانیؔ\nآپ   تلوار   اٹھاتے   رہنا\n"
      },
      {
        "id": "ghazal_63",
        "title": "کو بکو یوں جو بھٹکتا ہوں میں ہردم ہرپل",
        "content": "کو بکو یوں جو بھٹکتا ہوں میں ہردم ہرپل \nاس کی خاطر ہی تڑپتا ہوں میں ہردم ہرپل\n\nہجر کے تیر نے ایسا کیا زخمی دل کو \nاپنے اندر ہی سسکتا ہوں میں ہردم ہرپل \n\nکل مری یاد میں آنسو بھی بہائے گا وہ \nآج کل جس کو کھٹکتا ہوں میں ہرپل ہردم \n\nاپنے پیروں پہ کھڑا ہو کے رہوں گا اک دن \nان دنوں گر کے سنبھلتا ہوں میں ہردم ہرپل \n\nجانتا ہوں میں اسے پا نہیں سکتا ثانیؔ \nپھر بھی پانے کو مچلتا ہوں  میں ہردم ہرپل"
      },
      {
        "id": "ghazal_64",
        "title": "تو ہے قریب میرے اور جستجو کریں کیا",
        "content": "تو ہے قریب میرے اور جستجو کریں کیا \nتیرے سوا کسی سے بھی گفتگو کریں کیا \n\nتونے ہمیں تو رسوا محفل میں کر دیا ہے\nتیری  شکایتیں ہم بھی روبرو کریں کیا \n\nفٹ پاتھ پر کوئی کل رو رو کے کہہ رہا تھا \nلوگو بدل گیا ہے اپنا لہو کریں کیا\n\nچارا گروں کی میرے، فطرت عجیب سی ہے \n نشتر لگائیں اور پھر، پوچھیں رفو کریں کیا \n\nگھر سے نکلنا ثانیؔ، دشوار ہو گیا  ہے\nبیٹھا قدم قدم پہ، اپنا عدو کریں کیا"
      },
      {
        "id": "ghazal_65",
        "title": "کیسے بیاں کروں میں کہ کیا کیا نظر میں ہے",
        "content": "کیسے  بیاں کروں میں کہ کیا کیا نظر میں ہے \nاس کا حسین جلوہ مرے چشمِ تر میں ہے  \n\nآثار میرے دوست قیامت کے تو نہیں \nاخلاق کے علاوہ توسب کچھ بشر میں ہے \n\nبرسوں رہا ہوں چاند میں اس کی نظر کا یار \nدو چار دن سے وہ جو تمہاری نظر میں ہے\n\nاس  کا  خیال  دل سے  نکالا  نہ  جائے  گا \nوہ  فکر  و فن  میں اور مری  رہ گزر میں  ہے \n\nاثرات  اس کے رونے کے گرچہ نہیں تو پھر \nثانیؔ نمی سی کس لئے دیوار و در میں ہے"
      },
      {
        "id": "ghazal_66",
        "title": "زندگانی کی ڈگر اچھی نہیں",
        "content": " زندگانی  کی  ڈگر  اچھی   نہیں \nاب یہاں شام و سحر اچھی نہیں \n\nٹوٹ جائے دل کسی کا اے  میاں \n”بدگمانی اس قدر اچھی نہیں“\n\nلٹ گئی عصمت کسی معصوم کی \nیہ  خبر  ہے  پر  خبر  اچھی  نہیں \n\nبن تمہارے سچ کہوں کیسی رہی \nچاندنی شب تھی مگر اچھی نہیں \n\nروٹھ کر جب سے گئے ہیں وہ ادھر \nاب ہوا  چلتی  ادھر  اچھی  نہیں \n\n کہہ رہی تھی اک  پری ماں باپ سے \nکیوں  جہاں کی اب نظر اچھی نہیں \n\nتوڑ   دینا   دوستی   ثانیؔ  مگر \nاک  ذرا  سی  بات  پر  اچھی  نہیں \n"
      },
      {
        "id": "ghazal_67",
        "title": "عدو کی بھیڑ دیکھو نہ عدو کا قافلہ دیکھو",
        "content": "عدو کی بھیڑ دیکھو نہ عدو کا قافلہ دیکھو \nتمہارے حوصلوں پہ منحصر ہے معرکہ دیکھو \n\nکسی کے ساتھ بھی تم سے نا انصافی نہیں ہوگی \nعمر فاروق جیسا تم جو کر کے فیصلہ دیکھو \n\nیہ تم سے کہہ دیا کس نے کہ تم کچھ کر نہیں سکتے\nلگا دو جان کی بازی پھر اپنا مرتبہ دیکھو\n\nنظر آنے لگے گی دشمنوں میں خوبیاں تم کو \n تم اپنی سوچ کا پہلے بدل کر زاویہ دیکھو\n\nبچا لایا ہوں کشتی کو میں طوفاں سے بھی اے ثانیؔ \nمری ہمّت، مری جرّت، مرا تم حوصلہ دیکھو"
      },
      {
        "id": "ghazal_68",
        "title": "جو دانش مند ہوتے ہیں کبھی ایسا نہیں کرتے",
        "content": "جو دانش مند ہوتے ہیں کبھی ایسا نہیں کرتے \n خیالِ دل سبھی کے سامنے رکھا نہیں کرتے\n\nملے جذبے وراثت میں مصائب سے بھی لڑنے کے\nکبھی ہم مشکلوں سے یار گھبرایا نہیں کرتے \n\nمرے بگڑے ہوئے حالات پہ کہنے لگے احباب \nکسی کو اس قدر بھی ٹوٹ کر چاہا نہیں کرتے\n\nہماری شان و شوکت کا سبب ہے یہ زمانے میں \nسوا اللہ کے اوروں سے ہم مانگا نہیں کرتے \n\nہمارے گھر میں فاقہ ہو کہ چاہے تنگدستی ہو\nخدا کا شکر ہے ایماں کو ہم بیچا نہیں کرتے \n\nسلیقہ ہی نہیں آتا ہمیں جینے کا اے ثانیؔ \nاگر ماں باپ بچپن میں ہمیں ڈانٹا نہیں کرتے"
      },
      {
        "id": "ghazal_69",
        "title": "یاد ان کی دلا کے آخر کار",
        "content": "یاد ان کی دلا کے آخر کار \nکیا ملا دل دْکھا کے آخر کار \n\nہم  تو  برباد  ہو  گئے  صاحب \nشہر الفت میں آ کے آخر کار \n\nتم کو جانا ہی تھا چلے جاتے \nکیوں گئے دل جلا کے آخر کار \n\nکر دیا شرمسار دشمن کو \nمجھ کو اپنا بنا کے آخر کار \n\nخود کو بدنام کر ہی ڈالا نا\n راز  اپنا  سنا  کے  آخر  کار \n\nکب تلک دل کو ثانیؔ بہلائے \nاس کی  فوٹو  دکھا  کے  آخر  کار"
      },
      {
        "id": "ghazal_70",
        "title": "وہ جو کہے وہی کریں ایسے نہیں ہیں ہم",
        "content": "وہ جو کہے وہی کریں ایسے نہیں ہیں ہم\nدیوانگی میں اتنے بھی بہکے نہیں ہیں ہم\n\nجی بھر کے آج جشن منالے تْو فتح کا\nمیداں میں تیرے سامنے اترے نہیں ہیں ہم \n\nتاریخ ہے گواہ ہمارے اصول کی \nبستی کبھی بھی کوئی جلائے نہیں ہیں ہم \n\nمحفوظ ہم کو دیکھ کے حیرت زدہ ہے تْو\nحالات کے ستم سے جو ٹوٹے نہیں ہیں ہم\n\nاس نے تو خوب چاہا کہ مٹ جائیں ہم مگر \nرب کا ہے یہ کرشمہ کے مٹتے نہیں ہیں ہم \n\nمالا ہمارے نام کا جپتا تھا جو کبھی \nاُس کی نظر میں اِن دنوں اچھے نہیں ہیں ہم \n\nرہ جائے بس بھرم یہی تیرے گمان کا \nثانیؔ ہے سچ تو یہ کہ فرشتے نہیں ہیں ہم"
      },
      {
        "id": "ghazal_71",
        "title": "بزرگوں کے جو قدموں میں کبھی بیٹھا نہیں ہو گا",
        "content": "بزرگوں کے جو قدموں میں کبھی بیٹھا نہیں ہو گا\nکسی بھی طور سے وہ شخص تو اعلیٰ نہیں ہو گا \n\nتجھے رسوا میں کر دونگا تری چوکھٹ پہ خود مر کے \n مسیحا گر مداوا میرے زخموں کا نہیں ہو گا\n\nکسی بھوکے سوالی کو جو وہ پھٹکار دیتا ہے\nمجھے لگتا ہے شاید اس کا دل زندہ نہیں ہو گا\n\nتلاوت جو کوئی کرتا رہے گا سورۂ بقرہ کی \nیہ دعویٰ ہے کہ اس کے ہاتھ میں کاسہ نہیں ہو گا\n\nجہاں اجداد رہتے تھے جگہ وہ ڈھونڈ سکتا ہوں \nاگر چوپال کا بوڑھا شجر کاٹا نہیں ہو گا \n\nتمہیں احساس کب ہوگا شجر کو کاٹنے والے\nشجر کٹتے رہے یوں ہی تو پھر سایا نہیں ہو گا \n\nسیاسی جو ہے ان سے تم اے ثانیؔ فاصلہ رکھنا \nسگا میرا نہیں ہے یہ سگا تیرا نہیں ہو گا"
      },
      {
        "id": "ghazal_72",
        "title": "دل سے جب اپنے بزرگوں کی دعا پاؤگے",
        "content": "دل سے جب اپنے بزرگوں کی دعا پاؤگے \nاپنی دنیا سے ہر اک غم کو جدا پاؤ گے \n\nدعویٰ کرتے ہو یہ جو مجھ سے محبت کاتم\nکیامری راہوں کے کانٹوں کو ہٹا پاؤگے\n\nہاہمی ربط تمہارا رہا مضبوط اگر \nایک چھوڑو کئی لشکر کو  ہرا  پاؤ  گے \n\nمیری چاہت، مری الفت مری قربانی تم \nبھولنا چاہو گے پھر بھی نہ بھلا پاؤ گے \n\nعزم ہمت ہے، نہ دل میں کوئی جذبہ ثانیؔ\nکیسے صحرا میں کوئی پھول کھلا پاؤ گے\n"
      },
      {
        "id": "ghazal_73",
        "title": "سلامت جب تلک ایمان ہے ایسا نہیں ہو گا",
        "content": "سلامت جب تلک ایمان ہے ایسا نہیں ہو گا \nکسی فرعون کے آگے میرا سجدہ نہیں ہو گا\n\nمری غیرت کی تم قیمت لگانے آ گئے پھر سے \nتمہیں سو بار بولا ہے کہ یہ سودا نہیں ہوگا \n\nنہ چھیڑو ہم شریفوں کو اسی میں خیر ہے ورنہ\nنتیجہ جان لو اس کا کبھی اچھا نہیں ہو گا \n\nچلن اب چھوڑ بھی دو تم مجھے بے جا ستانے کا\nنہیں تو حال وہ کر دوں گاجو سوچا نہیں ہو گا \n\n عبادت جان کے ماں باپ کی خدمت کرو ورنہ \nتمہارے حق میں بھی کل کے لئے اچھا نہیں ہو گا \n\nلہو روتے ہوئے اس باپ کو دیکھا ہے کل میں نے \nجو کہتا تھا کبھی لوفر مرا بیٹا نہیں ہو گا \n\nحقیقت میں وہی حقدار ہے جنت کا اے ثانیؔ\nخدا کا راستہ جس شخص نے چھوڑا نہیں ہو گا "
      },
      {
        "id": "ghazal_74",
        "title": "قلب سے قلب کا جب رابطہ ہو جائے گا",
        "content": "قلب سے قلب کا جب رابطہ ہو جائے گا \nایک دوجے کے لئے آئینہ ہو جائے گا\n\nعزم ہمّت سے اگر لیتا رہا کام تو پھر \nتیرا آسان خود ہی راستہ ہو جائے گا \n\nکون کیا ہے یہاں دنیا کو پتا چل جائے \nآؤ میداں میں کبھی فیصلہ ہو جائے گا \n\nتلخ لہجے سے ہمیشہ ہی بچا کر ورنہ \nتیرے  اپنوں سے ترا فاصلہ ہو جائے گا \n\nنیند آنکھوں سے بہت دور چلی جائے گی \n ہجر سے جس روز میاں واسطہ ہو جائے گا \n\nہجر کے درد سے دم ٹوٹ رہا ثانیؔ کا \nکس کومعلوم تھا یہ حادثہ ہو جائے گا"
      },
      {
        "id": "ghazal_75",
        "title": "زندگانی کے سفر میں حادثہ کچھ کم نہ تھا",
        "content": "زندگانی کے سفر میں حادثہ کچھ کم نہ تھا \nلیکن اپنا حوصلہ بھی با خدا کچھ کم نہ تھا \n\nپھول سب مرجھا گئے شاخوں سے کلیاں گر پڑیں \n”میرا گلشن سے نکلنا حادثہ کچھ کم نہ تھا“\n\nشکر ہے اللہ کا جو میں رہا ثابت قدم \nورنہ تو ظلم و ستم کا سلسلہ کچھ کم نہ تھا \n\nما نا کہ قسمت میں اپنی تھا لکھا رنج و الم \nہاں مگر کردار اس میں آپ کا کچھ کم نہ تھا \n\nمل رہی ہے زندگی اُس روز سے ہنس کر گلے \nاک نظر تیرا مجھے وہ دیکھنا کچھ کم نہ تھا  \n\nکاش ثانیؔ آئینہ دل کی نظر سے دیکھتا \nفکر میں تیرے پریشاں آئینہ کچھ کم نہ تھا"
      },
      {
        "id": "ghazal_76",
        "title": "تمہارا ساتھ جب ہو گا تو پھر ایسا نہیں ہو گا",
        "content": "تمہارا ساتھ جب ہو گا تو پھر ایسا نہیں ہو گا \nیوں بے ترتیب سا  ہرگز مرا کمرہ نہیں ہو گا \n\nتمہارے بعدکیا ہوگا تمہیں کیسے میں سمجھاؤں \nمری آنکھیں تو ہوں گی ہاں مگر سپنا نہیں ہو گا  \n\nترے عاشق نہیں ہوں گے تجھے یہ کب کہا میں نے\nمگر دعویٰ ہے دیوانہ مرے جیسا نہیں ہو گا \n\nجدا ہونا نہیں مجھ سے مرے دلبر کبھی ورنہ \nمرا اس دل کے دھڑکن سے کوئی رشتہ نہیں ہوگا \n\nنئی یاری ہے تجھ سے اس لئے تعریف کرتا ہے\nابھی بیچارا تجھ کو ٹھیک سے سمجھا نہیں ہو گا"
      },
      {
        "id": "ghazal_77",
        "title": "جینے کے لئے ہرگز ایسا نہیں کرتے ہیں",
        "content": "جینے کے لئے ہرگز ایسا نہیں کرتے ہیں \nلقمہ کبھی اوروں کا چھینا نہیں کرتے ہیں \n\nاٹھّے جو قدم پھر تو  منزل پہ ہی جا پہنچے \nتھک ہار کے راہوں سے لوٹا نہیں کرتے ہیں \n\nوعدے پہ اٹل ان کو دیکھا ہے سدا ہم نے \nاسلام کے شیدائی دھوکہ نہیں کرتے ہیں \n\nوہ خود بھی ترستے ہیں اے یار ہنسی خاطر \nمسکان جو غیروں میں بانٹا نہیں کرتے ہیں \n\nرونے کے سوا ان کو کچھ کام نہیں رہتا \nحالات کے رْخ کو جو پرکھا نہیں کرتے ہیں \n\nبیکار ہی کرتے ہیں موتی کی تمنا وہ\nدریا کی سطح تک جو اترا نہیں کرتے ہیں \n\nتاریخ وہی اپنی کرتے ہیں رقم ثانی \nحد سے بھی زیادہ جو سوچا نہیں کرتے ہیں \n"
      },
      {
        "id": "ghazal_78",
        "title": "یارو مجھ کو اکثر ایسا، کیوں لگتا ہے سوچ رہا ہوں",
        "content": "یارو مجھ کو اکثر ایسا، کیوں لگتا ہے سوچ رہا ہوں \nآخر وہ ہی دل کو پیارا، کیوں لگتا ہے سوچ رہا ہوں \n\nاس دنیا میں اور بھی یارو، رہتے میرے ساتھ ہیں لیکن \nسب سے زیادہ وہ ہی اپنا، کیوں لگتا ہے سوچ رہا ہوں  \n\nان کی آنکھیں میری آنکھیں، کل پرسوں ٹکرائی لیکن  \nصدیوں پرانا ان سے رشتہ، کیوں لگتا ہے سوچ رہا ہوں \n\nکیا میں پاگل ہو بیٹھا ہوں یا اب پاگل ہو جاؤں گا \n خود کا سایہ اس کا سایہ، کیوں لگتا ہے سوچ رہا ہوں \n\nمجھ پہ کیا ہے جادو یا پھر، میں ہی عشق میں پاگل ہوں \nاس کے سوا ہر اک بیگانہ، کیوں لگتاہے سوچ رہا ہوں \n\nدلکش دلکش منظر میں بھی، وہ گر میرے ساتھ نہیں تو\nجینا مشکل ہو گا میرا، کیوں لگتا ہے سوچ رہا ہوں \n\nان کا وعدہ بالکل سچا، اور کا وعدہ بالکل جھوٹا\nمجھ کو ثانیؔ جانے ایسا، کیوں لگتا ہے سوچ رہا ہوں \n"
      },
      {
        "id": "ghazal_79",
        "title": "کیا ہے تونے دکھاوا، دکھاوا نکلے گا",
        "content": "کیا ہے تونے دکھاوا، دکھاوا نکلے گا \nخلوص کے بنا بے کار سجدہ نکلے گا \n\nکچھ اور دیر ٹھہر ساتھ تْو ابھی میرے \n یہ دیکھنا اسی صحرا سے دریا نکلے گا\n\nامیرِ شہر لرز جائے گا فلک اس دن \nاگر یتیم کی آنکھوں سے قطرہ نکلے گا\n\nوفا کی آڑ میں نشتر چبھو دیا اس نے \nخبر کہاں تھی مرا یار ایسا نکلے گا \n\nذرا تو صبر سے ہمت سے کام لے اے دوست \nیہیں سے دیکھنا منزل کا رستہ نکلے گا \n\nخود اپنے آپ پہ ثانیؔ یقین ہے مجھ کو\nمری ہتھیلی سے اک دن اجالا نکلے گا"
      },
      {
        "id": "ghazal_80",
        "title": "تمام عمر جو کرتا رہا ہے کام غلط",
        "content": "تمام عمر جو کرتا رہا ہے کام غلط\nبنے گا کیسے نہ اس کا تو پھر مقام غلط\n\nضروری ہے کریں اچھوں کا احترام مگر \nخیال  رکھیے  غلط  کا  ہے  احترام غلط \n\nتمہارے  در پہ اگر حاضری نہ ہو تو پھر \nہماری صبح غلط ہے ہماری شام غلط\n\nغزل کہوں کہ رباعی کہوں کہ نظم کہوں \n اگر نہ ہو تیرا چرچا تو سب کلام غلط \n\nسزا دے یا کے معافی دے تیری مرضی ہے\nاگر کرے کبھی تیرا غلام کام غلط \n\nنماز روزہ ہو یا ہو کوئی عمل ثانیؔ\nاگردکھاوے کے ہوں توہیں سارے کام غلط"
      },
      {
        "id": "ghazal_81",
        "title": "عشق کر کے تونے اے دل خاک اچھا کر لیا",
        "content": "عشق کر کے تونے اے دل خاک اچھا کر  لیا\nغم کیا مدِّ مقابل خاک اچھا کر لیا \n\nجس میں شامل بھوکا کوئی اور نا  پیاسا ہوا \nیہ سجائی تو نے محفل خاک اچھا کر لیا\n\nکیا پڑھا لکھا وطن میں نیتا کوئی تھا نہیں \nچن کے تو لایا ہے جاہل خاک  اچھا کر لیا \n\nجس نے مندر اور مسجد کی نہ رکھی لاج  تک \n تم نے ہو کے  بھیڑ میں شامل خاک اچھا کر لیا \n\nدیکھ لے اے  بیوفا میں جی رہا ہوں آج  بھی \nکر کے میرے دل کو بسمل خاک اچھا کر لیا  \n\nمسندِ  پیرِ مغاں  کے  واسطے تم نے میاں \nنا  اہل کو  سمجھا  قابل خاک  اچھا کر لیا  \n\nدھوپ سے ڈر کر کے ثانی زلفِ سایے دار میں \nبھول بیٹھا  اپنی  منزل  خاک  اچھا  کر  لیا \n"
      },
      {
        "id": "ghazal_82",
        "title": "نہ پوچھو ہم سے تم کیا کیا ہم اپنا چھوڑ دیتے ہیں ",
        "content":"نہ پوچھو ہم سے تم کیا کیا ہم اپنا چھوڑ دیتے ہیں \nکسی کی گر تمنا ہو تو دنیا چھوڑ دیتے ہیں \n\nہنر جس میں  یہاں  ہوتا ہے اکثر رہنمائی کا \n”اسی کو قافلے والے اکیلا چھوڑ دیتے ہیں“\n\nہمارے دور کے حاکم کیا کرتے ہیں ایسا بھی  \nاجالا چھین لیتے ہیں اندھیرا چھوڑ دیتے ہیں \n\nیقیناً سرخ رو ہوتے ہیں دنیا میں وہی اک دن  \nکہ جو بھائی کی خاطر اپنا حصہ چھوڑ دیتے ہیں \n\nسنبھل کر آپ رہیے گایہاں چالاک لوگوں سے \nچُرا لیتے ہیں دل کو اور کلیجہ چھوڑ  دیتے ہیں \n\nحقیقت میں بھروسہ ان پہ یہ دنیا نہیں کرتی\nجو اپنوں پہ یہاں کرنا بھروسہ چھوڑ دیتے ہیں \n\nبہت جلدی اسے دنیا بھلا دیتی ہے اے ثانی ؔ\nوہی جو اپنے پرکھوں کا طریقہ چھوڑ دیتے ہیں"
      },
      {
        "id": "ghazal_83",
        "title": "ہائے کیسی اپنی قسمت ہو گئی",
        "content": "ہائے کیسی اپنی قسمت ہو گئی \nبے وفا سے کیوں محبت ہو گئی \n\nآبرو بھی بک رہی ہے ان دنوں \nکتنی مہنگی اب ضرورت ہوگئی\n\nعشق ٹھہرا جب حماقت آج کل \nآپ سے پھر کیوں حماقت  ہو گئی\n\nاس لئے آنکھیں برستی ہیں مری\nان کو دیکھے ایک مدت ہو گئی\n\nاب نہ، امیدِ وفا کرنا یہاں \nاب یہ دنیا بے مروت ہو گئی \n\nچھن گئیں یک لخت ساری رونقیں \nلاڈلی جب گھر سے رخصت ہو گئی \n\nاب وہ آئے ہیں پلٹ کر کس لئے \n”جب کہ غم کھانے کی عادت ہو گئی“"
      },
      {
        "id": "ghazal_84",
        "title": "اُس کی طرح ہماری تو عادت نہ ہونے کی",
        "content": "اُس کی طرح ہماری تو عادت نہ ہونے کی \nبستی جلا کے دل کو مسرت  نہ ہونے کی \n\nمجھ کو نکالے شہر سے یا جان لے لے وہ \nمغرور حکمراں سے عقیدت نہ  ہونے کی \n\nفاقہ کشی کے ڈر سے میں ایمان  بیچ دوں \n مجھ سے کبھی بھی ایسی  تجارت نہ ہونے کی \n\nاجداد نے سکھایا مروت کا جو سبق\nاس کو بھلا دوں ایسی حماقت نہ ہونے کی \n\nاعلان کر کے شہر میں سب کو بتایا جائے  \nکم ظرف جو ہے اس کی اطاعت نہ ہونے کی\n\nفرما دیا خدا نے تو قرآں میں جا بجا \n لقمہ حرام کھا کے عبادت نہ ہونے کی \n\nمجرم اگرچہ باپ ہو بیٹا ہو بھائی ہو \nمجھ سے کبھی اسکی حمایت نہ ہونے کی"
      },
      {
        "id": "ghazal_85",
        "title": "امن کے قاتل امن کے دشمن، اب تو تیری خیر نہیں",
        "content": "امن کے قاتل امن کے دشمن، اب تو تیری خیر نہیں \nتو نے جلایا ہند کا گلشن، اب تو تیری خیر نہیں \n\nمندر، مسجد کے چکر میں کتنا خون بہائے ہو \nجان چکی سچائی جن جن، اب تو تیری خیر نہیں \n\nاپنی صورت جس میں اکثر مل کے دیکھا کرتے تھے \nتوڑ دیا وہ تونے درپن، اب تو تیری خیر نہیں \n\nطاقت کیا ہے ہم جیسوں کی اب کے پتہ چل جائے گا \nتونے کی جنتا سے ان بن، اب تو تیری خیر نہیں \n\nاچھے دن کے خواب دکھا کر، پھر سے لوٹ نہ پائے گا \nسن لے میرے دیش کے رہزن، اب تو تیری خیر نہیں "
      },
      {
        "id": "ghazal_86",
        "title": "آج تک ان کی محبت سے یوں بیزار ہیں ہم",
        "content": "آج تک ان کی محبت سے یوں بیزار ہیں ہم \nعمر بھر وہ یہ سمجھتے رہے اغیار ہیں ہم \n\nحسنِ کردار کبھی ہم نے نہ چھوڑا لوگو \nیہ الگ بات ہے کہ خیر سے زردار ہیں ہم \n\nٹیس زخموں سے جو اٹھتی ہے مزا آتا ہے  \nاس لئے تیری جفاؤں کے طلب گار ہیں ہم\n\nتیری مرضی ہے ہنسا دے یا رلا دے ہم کو \nاب ترے عشق و محبت میں گرفتار ہیں ہم \n\nغیر کے در پہ پڑی  رہتی ہے پگڑی ان کی \nاور یہ کہتے ہیں کہ صاحبِ دستار ہیں ہم \n\n ہم سے ہوتی نہیں دنیا کی غلامی ثانیؔ  \n اپنی دنیا کے میاں آج بھی مختار ہیں ہم\n"
      },
      {
        "id": "ghazal_87",
        "title": "ترے گلنار چہرے کی ضیاء کچھ اور کہتی ہے",
        "content": "ترے گلنار چہرے کی ضیاء کچھ اور کہتی ہے \nمگر مجھ میں جو بیٹھی ہے انا کچھ اور کہتی ہے\n\nتمہیں بولو بھروسہ کرلیں ہم تم پہ بھلا کیسے \nزباں کچھ اور کہتی ہے ادا کچھ اور کہتی ہے\n\nکوئی تو  بات ہے جس کو چھپانا چاہتے ہو تم\nبتا توکچھ رہے ہو پر فضا کچھ اور کہتی ہے \n\nوہ میرے بن بہت خوش ہے یہ قاصد نے کہا لیکن \nاسے جو چھو کے آئی ہے صباکچھ اور کہتی ہے\n\nہوئی ہے جیل زانی کو چلو یہ مانتے ہیں ہم\nشریعت تو مگر اس کی سزا کچھ اور کہتی ہے\n\nکبھی تھا امن کا پیکر اے ثانی ؔملک ہندوستاں \nمگر اس وقت کی آب و ہوا کچھ اور کہتی ہے"
      },
      {
        "id": "ghazal_88",
        "title": "یہ میری آنکھ جو پرنم نہیں ہے",
        "content": "یہ میری آنکھ جو پرنم نہیں ہے  \nاسے لگتا ہے مجھ کو غم نہیں ہے \n\nمری ہمّت مرا توحوصلہ دیکھ \nکسی غم کا کوئی ماتم نہیں ہے  \n\nخفاہے یوں امیرِ شہر مجھ سے  \nیہ سر کیوں اس کے آ گے خم نہیں ہے \n\nبنایا ہے اسے محبوب جب سے \nمرے حصے میں کوئی غم نہیں ہے\n\nابھی سے رک گئے نشتر لگانا \n”ابھی تو آنکھ بھی پرنم نہیں ہے“\n\nسنبھل کر زخم تو اپنے دکھانا \n کسی کے ہاتھ میں مرہم نہیں ہے\n\nوہ منزل کو نہ پائے گا کبھی بھی \nارادہ جس کا مستحکم نہیں ہے \n\nکبھی تو پاس آکر دیکھ لینا  \nترے بن ثانیؔ میں دم خم نہیں ہے"
      },
      {
        "id": "ghazal_89",
        "title": "خلوص و وفا اور چاہت اگر ہو",
        "content": "خلوص  و  وفا  اور چاہت  اگر ہو\nبدل جائیں حالات ہمت اگر ہو\n \nہوں لشکر کے لشکر عدو چاہے پھر بھی \nہمیں جیت جائیں گے ملت اگر ہو \n\nکئی تاجورہوں گے قدموں میں تیرے \nانا سے تکبر سے نفرت اگر ہو \n\nدعا رد ہو تیری یہ ممکن نہیں ہے\nعبادت بھی تیری عبادت اگر ہو \n\nرہیں گے درندے چرندے بھی مل کر  \nعمر جیسی لوگو خلافت اگر ہو \n\nاسے بوئے جنت ملے گی نہ ہرگز \nکہ جس کے بھی دل میں کدورت اگر ہو \n\nکبھی آدمیت سے بھٹکے نہ کوئی \nعمل میں محمدؐ کی سیرت اگر ہو \n\nپلٹ آئے چالیس گھروں سے بھی سیری\nصحابہ کے جیسی محبت اگر ہو \n\nپگھل جائے پتھر یہ ممکن ہے ثانیؔ\nجو ایماں میں تیرے حرارت اگر ہو"
      },
      {
        "id": "ghazal_90",
        "title": "نہ پوچھ مجھ کو کیا ملا، مذاق ہی مذاق میں",
        "content": "نہ پوچھ مجھ کو کیا ملا، مذاق ہی مذاق میں  \n غموں سے آشنا ہوا، مذاق ہی مذاق میں \n\nحسیں سنہرے خواب سارے چور چور ہو گئے \n کسی نے جب جگا دیا،  مذاق ہی مذاق میں  \n\nبہت  اداس لگ رہے ہو ان دنوں تو تم  میاں \n کسی نے غم دیا ہے کیا،  مذاق ہی مذاق میں \n\nنہ آنکھوں کو قرارہے، نہ دل کو ہی سکون ہے\nیہ کیسا روگ لگ گیا، مذاق ہی مذاق میں \n\nسمجھ میں بات آ گئی کہ دل لگی ہے کیا بلا\nکوئی بنا کوئی مٹا، مذاق ہی مذاق میں \n\nکسی کے دل کو توڑنا بہت بڑا گناہ ہے\nوہ  یہ گناہ کر رہا، مذاق ہی مذاق  میں  \n\nسفر حیات کا بہت ہے ثانیؔ قیمتی کہیں \nگزر نہ جائے دیکھنا، مذاق ہی مذاق میں "
      },
      {
        "id": "ghazal_91",
        "title": "جو اِدھر حال ہے وہ اُدھر بھی تو ہو",
        "content": "جو اِدھر حال ہے وہ اُدھر بھی تو ہو\nمیری چاہت کی اس کو خبر بھی تو ہو\n\nصرف باتیں بنانے سے کیا فائدہ \nتجھ میں دل جیتنے کا ہنر بھی تو ہو \n\nکیسے تنہا کوئی مسکرائے بھلا \n دلربا، ہم نوا، ہم سفر بھی تو ہو \n\nجس کی خاطر لٹاؤں میں جان و جگر \nکوئی ایسا یہاں معتبر بھی تو ہو \n\nدم نکل جائے نا تیرے بیمار کا \nاک نظر اے مسیحا اِدھر بھی تو ہو \n\nگرہے خواہش کہ بلبل کا نغمہ سنوں \nتیرے آنگن میں ثانیؔ شجر بھی تو ہو "
      },
      {
        "id": "ghazal_92",
        "title": "مرے جذبات زندہ ہیں ابھی ارمان باقی ہے",
        "content": "مرے جذبات زندہ ہیں ابھی ارمان باقی ہے\nترے کوچے سے کیوں جاؤں میں جب تک جان باقی ہے\n\nخبر کس کو ہے کب لوگو یہاں منظر بدل جائے \n”ابھی موجوں کے دل میں حشر کا طوفان باقی ہے“\n\nنفَس میرے ذرا ٹھہرو، ذرا سا صبر تو رکھو\nکہ انکے آنے کا دل میں ابھی امکان باقی ہے\n\nوہ ہرجائی ہے پھر بھی کیوں اسے تو یاد کرتا ہے\nابھی کیا اور کوئی غم دلِ نادان باقی ہے\n\nنہیں ہے ساتھ تو میرے حقیقت ہے یہی لیکن  \nتری یادوں کا دل کی میز پر گلدان باقی ہے\n\nجو سچائی کی خاطر جان بھی دے دیتا ہے اپنی  \nابھی دنیا میں ایسا بھی کوئی انسان باقی ہے  \n\n زمانے کے دلاسے کی مجھے حاجت نہیں ثانیؔ\n خدا کا شکر ہے لب پر ابھی مسکان باقی ہے"
      },
      {
        "id": "ghazal_93",
        "title": "رہے گی ہمیشہ ہی رفعت وطن کی",
        "content": "رہے گی ہمیشہ ہی رفعت وطن کی\nاگر تم رکھو گے محبت وطن کی \n\nوہ زندہ ہمیشہ دِلوں میں رہے گا \nکہ پائی ہے جس نے شہادت وطن کی\n\nسکھاتا ہے انساں کو ہر ایک مذہب\nعبادت ہے کرنا حفاظت وطن کی\n\nبھلا کر تعصب چلو سوچتے ہیں \nمٹے کس طرح سے عداوت وطن کی\n\nکہیں ڈوب جائے وہ پانی میں جا کر\nنہ ہو جس کے دل میں محبت وطن کی\n\nلگانا گلے صاف دِل سے عدو کو\nرہی ہے پرانی روایت وطن کی\n\nسناؤ غزل بھائی چارے کی ثانیؔ\nیہی ہے ابھی تو ضرورت وطن کی"
      },
      {
        "id": "ghazal_94",
        "title": "نہ بھولو گے شہیدوں کی شہادت کو قسم کھاؤ",
        "content": "نہ بھولو گے شہیدوں کی شہادت کو قسم کھاؤ \nہمیشہ یاد رکھّو گے فضیلت کو قسم کھاؤ\n\nپنپنے تم نہ دوگے یار نفرت کو قسم کھاؤ\nمٹاؤگے زمانے سے عداوت کو قسم کھاؤ\n\nکبھی سونے کی چڑیا تھی یہ اپنا ملک ہندوستاں \nوہی چڑیا بنانی ہے یہ بھارت کو قسم کھاؤ\n\nمٹانا ہے مٹانا ہے مٹانا ہے مٹانا ہے \nیہ پیارے دیش ہندوستاں سے نفرت کو قسم کھاؤ \n\nہمارا بھی تمہارا بھی ترنگا شان ہے سب کی \nترنگے کی نہ جھکنے دیں گے رفعت کو قسم کھاؤ\n\nوطن کے واسطے پھانسی بھی چڑھ جاؤ گے تم ثانیؔ \nنہ  دوگے آنچ  آنے  اسکی عظمت کو قسم کھاؤ"
      },
      {
        "id": "ghazal_95",
        "title": "کیسے اسلاف کا راستہ چھوڑ دیں",
        "content": "کیسے اسلاف کا راستہ چھوڑ دیں \nلوگ کہتے ہیں کہ ہم وفا چھوڑ دیں \n\nپھر ضرورت پڑی روشنی کی یہاں \nپھر چراغِ محبت جلا چھوڑ دیں \n\nوہ گریں گے بلندی  سے  میری  طرح \nاُن سے کہہ دو انا کا نشہ چھوڑ دیں \n\nسچ تو سچ ہے کبھی جھوٹ ہوتا نہیں \nہم بھلے دیکھنا آئینہ چھوڑ دیں \n\nپھر سے دنیا دیوانی محبت کی ہو \nدل کا دروازہ گر ہم کھْلا چھوڑ دیں \n\nیہ نئے دور کا ہے نیا قافلہ \nآپ  ثانیؔ  ذرا  راستا  چھوڑ  دیں "
      },
      {
        "id": "ghazal_96",
        "title": "یہ مانوگے اک دن کہا دیکھ لینا",
        "content": "یہ مانوگے اک دن کہا دیکھ لینا \nوفا میں ملے گا دغا دیکھ لینا \n\nابھی جس کو تو نے بٹھایا ہے سر پہ\nوہی کاٹ لے گا گلا دیکھ لینا \n\nحمایت کروگے جو تم ظالموں کی \nتمہارا  بھی  ہوگا  برا  دیکھ  لینا \n\nکروگے ابھی سے جو ضد اس کی پوری \nبگڑجائے گا لاڈلا دیکھ لینا \n\nفلک سے میں تارے لے آؤنگا اک دن \nرہی آپ کی گر دعا دیکھ لینا\n"
      },
      {
        "id": "ghazal_97",
        "title": "اب سوا موت کے کوئی چارہ نہیں",
        "content": "اب سوا موت کے کوئی چارہ نہیں \nان کے بن ایک پل بھی گزارا نہیں \n\nروٹھ کر وہ مجھے بے صدا کر گئے\nپھر یہ کہتے ہیں مجھ کو پکارا نہیں \n\nتیری سازش تھی یہ جو جلا آشیاں \nورنہ کوئی بھی دشمن ہمارا نہیں \n\nتیرے بچے نہ دیں گے سہارا تجھے\nتو بھی ماں باپ کا گر سہارا نہیں \n\nایسی کشتی کا ثانیؔ مسافر ہوں میں \nدور تک جس کا کوئی کنارہ نہیں "
      },
      {
        "id": "ghazal_98",
        "title": "زندگانی کا بھی موسم سہانا ہوا",
        "content": "زندگانی کا بھی موسم سہانا ہوا\nدوستو! گھر مرے اس کا آنا ہوا\n\nبدلے بدل سے ہیں دوست میرے سبھی \nجب سے غربت کا گھر میں ٹھکانہ ہوا\n\nعید کا چاند تیرا بہت شکریہ \nاس کی دیدار کا اک بہانہ ہوا\n\nعمر بھر خوش رکھا ہم نے ماں کو مگر \nدودھ کا قرض ہم سے ادا نہ ہوا\n\nآج ثانیؔ مجھے پھر وہ یاد آ گیا \nجس کو بھولے ہوئے اک زمانہ ہوا"
      },
      {
        "id": "ghazal_99",
        "title": "کسی کے گھر کے لئے اور کسی کی جاں کے لئے",
        "content": "کسی کے گھر کے لئے اور کسی کی جاں کے لئے \nخدا سے مانگ رہے ہیں دعا جہاں کے لئے \n\nتجھے اگرہے ضرورت تو لے کے جا سورج\nمجھے تو کافی ہے جگنو مرے مکاں کے لئے \n\nاکیلے میں مری طبیعت یہ مجھ سے کہتی ہے\nکوئی غزل  تو کہو  میری جانِ جاں کے لئے\n\nابوبکر، علی، عثمان، عمرکے جیسے پھر\n امیر  چاہیے  دنیا  کو  کارواں  کے  لئے\n\nزبان  دی  ہے  خدا نے خدا کی  بولے  گی \nزبان  میری  نہیں  غیر کے  بیاں کے لئے"
      },
      {
        "id": "ghazal_100",
        "title": "دوستو شکوے گِلے کو بھول جائیں عید میں",
        "content": "(غزل عید) \n\nدوستو شکوے گِلے کو بھول جائیں عید میں \nآؤ مل کر جشن ہم ایسا منائیں عید میں \n\nکون ہے اپنا پرایا بھول جانا ہے ہمیں \nدشمنوں کو بھی گلے اپنے لگائیں عید میں \n\nزندگی ہے چار دن جب دشمنی پھر کس لئے\nکیوں نہ دشمنوں کو بھی اپنے گھر بلائیں عید میں \n\nہم اگر چاہیں کہ خوشیاں ہم کو دوبالا ملے \nتو کسی مفلس کے بچّے کو ہنسائیں عید میں \n\nبھائی چارے سے یہ اپنا ملک ہو آراستہ \nآؤ ہم سب رب سے مانگیں یہ دعائیں عید میں \n\nرب کی یہ مرضی ہے ثانی ؔہم جو ہیں پردیس میں \nکون چاہے دل سے کہ ہم گھر نہ آئیں عید میں "
      },
      {
        "id": "ghazal_101",
        "title": "تماشہ دیکھنے والو تمہیں اس کی خبر کیا ہے",
        "content": "تماشہ دیکھنے والو تمہیں اس کی خبر کیا ہے\nجلا جس کا مکاں اس کے ہوا دل پہ اثر کیا ہے\n\nتری یادوں کا اٹھتا ہے دھواں دل سے مرے ہمدم\nکبھی تُو بھی تو آکر دیکھ مرا حالِ جگر کیا ہے\n\nاگر وہ دیکھ لے ہنس کر تو سب دیوانے ہوجائیں \nمیاں اس کی نگاہوں میں خدا جانے اثر کیا ہے \n\nارادہ نیک ہو جس کا تو منزل مل ہی جائے گی\nمسافر کے بھلا آگے یہ دریا کا سفر کیا  ہے\n\nستائے جو غریبوں کو رلائے جو یتیموں کو\nاگر ظالم نہیں تو پھر بتائیں وہ بشر کیا ہے\n\nدعاؤں کو مرے مولا رسائی کیوں نہیں ملتی \nکہ اس ناچیز ثانیؔ کی عبادت میں کسر کیا ہے\n"
      },
      {
        "id": "ghazal_102",
        "title": "یار ہم سے کیا ہمارے کھو گئے",
        "content": "یار ہم سے کیا ہمارے کھو گئے\nخوبصورت سب نظارے کھو گئے\n\nآتشِ نفرت کی زد میں دوستو\nماؤں  کے پیارے  دلارے کھو گئے\n\nکس  طرح  سے وہ گزارے  زندگی\nجس دکھی ماں کے سہارے کھو گئے\n\nجی  رہے ہیں آپ کے بن ایسے ہم\nجیسے کشتی سے کنارے کھو گئے \n\nوقت   نے  ثانیؔ  دکھایا  یہ  اثر\nآج  ہم  سے  ہی ہمارے کھو گئے"
      },
      {
        "id": "ghazal_103",
        "title": "آئینہ تُو ہمیں مت دکھانا کبھی",
        "content": "آئینہ  تُو  ہمیں مت  دکھانا کبھی\nسچ کو سیکھا نہیں ہے چھپانا کبھی\n\nگھر ترا بھی جلا سکتی ہے آگ تو\nگھر کسی غیر کا مت جلانا کبھی\n\nبے بسی سائلوں کی جو چہرے پہ ہے\nبھولے سے بھی ہنسی مت اڑانا کبھی\n\nاب پلٹ کر بھی وہ دیکھتا بھی نہیں \nمیرا شانہ تھا جس کا ٹھکانہ کبھی\n\nتم کو ہوگی یقیناً خوشی باخدا\nاپنے  ماں  باپ کا  سر  دبانا   کبھی\n\nآج نفرت ہے جن کو مرے نام سے \nگاتے تھے وہ میرا ہی ترانہ کبھی\n\nزخم  یادوں کے ثانیؔ ابھر آتے  ہیں \nپڑھتا ہوں جب کوئی خط پُرانا کبھی"
      },
      {
        "id": "ghazal_104",
        "title": "وہ جب سے مرے پاس آنے لگے ہیں",
        "content": "وہ جب سے مرے پاس آنے لگے ہیں \nجہاں والے طوفاں اٹھانے لگے ہیں \n\nملی ہے جو کرسی حکومت کی ان کو\nاشاروں پہ سب کو نچانے لگے ہیں \n\nخدا جانے انجام کیا ہو گلوں کا\nچمن باغباں خود جلانے لگے ہیں \n\nجو سپنے دکھاتے تھے اچھے دنوں کے\nوہی  میری  نیندیں  اڑانے  لگے  ہیں \n\nبھلا گھر سے کیسے نہ جائے گی برکت \nسوالی  کو  در  سے  بھگانے  لگے   ہیں \n\nمیں  مشہور  ثانیؔ  ہوا  جا رہا  ہوں \nغزل میری سب گنگنانے لگے ہیں "
      },
      {
        "id": "ghazal_105",
        "title": "جسے نظر میں جگر میں بسا کے رکھتے ہیں",
        "content": "جسے نظر میں جگر میں بسا کے رکھتے ہیں \nاُسی سے اپنی محبت چھپا کے رکھتے ہیں \n\nہر ایک راز جو دل میں چھپا کے رکھتے ہیں \nتمام رشتوں کو اپنے بچا کے رکھتے ہیں \n\nبساط کیا ھے اندھیروں کی جو ادھر ٹھہریں \n”چراغ ہو کہ نہ ہو دل جلا کے رکھتے ہیں“\n\nہمیں بھْلا دے زمانہ یہ غیر ممکن ہے \nہنر زمانے میں اپنی ادا کے رکھتے ہیں \n\nاُنہیں کسی کا کہاں غم دکھائی دیتا ہے\nانانیت کا جو چشمہ لگا کے رکھتے ہیں \n\nگلے  لگاتی  ہیں  ان کو  ہی منزلیں  ثانیؔ \nجو لوگ حوصلہ اپنا بنا کے رکھتے ہیں"
      },
      {
        "id": "ghazal_106",
        "title": "یہ میرے پاس اے لوگو ذرا سا کیا ہوا پیسہ",
        "content": "یہ میرے پاس اے لوگو ذرا سا کیا ہوا پیسہ \nمیں کب کھلتا تھا دنیا کو مرا کھلنے لگا پیسہ\n\nہماری دوستی میں فاصلہ آتا نہیں لیکن\nہمارے اور اُن کے درمیاں بس آگیا پیسہ\n\nاکیلا وہ سمجھتا ہے یہاں اپنے کو ترم خان \nکہیں سے مل گیا جس کو میاں تھوڑا گھنا پیسہ \n\nکروڑو ں کے جو مالک ہیں یہاں وہ بھی نہیں جیتے\nکسی کو کب بچاتا ہے کسی انسان کا پیسہ\n\nبخیلوں کے تو ہونٹوں پر نزع کے وقت اے ثانی ؔ\nیہی کلمات ہوتے ہیں مرا پیسہ مرا پیسہ"
      },
      {
        "id": "ghazal_107",
        "title": "بن کے موسم بہار آئے ہو",
        "content": "بن  کے  موسم   بہار  آئے   ہو\nساتھ اپنے خوشی بھی لائے ہو\n\nجان  لے لو  گے کیا  صنم   بولو\nکس لئے  بیٹھے سر جھکائے  ہو\n\nچھوڑ  دو  میرا  امتحاں  لینا\nمات کتنی دفعہ تو کھائے ہو\n\nکل کا انجام سوچ لینا تم\nآج مجھ کو جو یوں رلائے ہو\n\nباخبر تم نہیں زمانے سے \nاس لئے بے  نقاب  آئے ہو\n\nآج مل ہی گیا سکوں دل کو\nتم  جو  ہنس کر گلے  لگائے ہو \n\nڈھونڈتے  ہو  وفا  یہاں  ثانیؔ \nدوسرے کیا جہاں سے آئے ہو"
      },
      {
        "id": "ghazal_108",
        "title": "عشق کرنے والوں میں فاصلہ نہیں ہوتا",
        "content": "عشق کرنے والوں میں فاصلہ نہیں ہوتا\nتن  جدا  تو  ہوتا ہے من جدا نہیں  ہوتا\n\nہم اگر سمجھ جاتے وقت کی نزاکت کو\nرہزنوں کے ہاتھوں میں قافلہ نہیں ہوتا\n\nدوسروں پہ جو اکثر انگلیاں اٹھاتا ہے\nآدمی تو وہ خود بھی پارسا نہیں ہوتا\n\nٹوٹ  کر  اگر  لوگو  آدمی  بکھر  جائے\nپھر تو عمر بھر پیدا حوصلہ نہیں ہوتا\n\nماں کی جب دعا لے کر گھر سے میں نکلتا ہوں \nراستے میں پھر کوئی حادثہ نہیں ہوتا\n\nدوستی ذرا ثانیؔ آپ سوچ کر کیجے\nکون کب بدل جائے کچھ پتہ نہیں ہوتا"
      },
      {
        "id": "ghazal_109",
        "title": "تاریکیوں کو یوں بھی مٹانا پڑا مجھے",
        "content": "تاریکیوں کو یوں بھی مٹانا پڑا مجھے\nراہِ وفا میں دل کو جلانا پڑا مجھے\n\nیوں ہی نہیں چمن میں آئی بہار ہے\nپہلے لہو سے گل کو کھلانا پڑا مجھے\n\nرعنائیوں نے شہر کی روکا بہت مگر\nوعدے پہ تیرے لوٹ آنا پڑا مجھے\n\nوہ کیا گیا کہ ساری خوشی ساتھ لے گیا\nآخر غموں کو اپنا بنانا پڑا مجھے\n\nقیمت نہ پوچھئے کہ محبت کی کیا رہی\nخود کو مٹا کے مول چکانا پڑا مجھے \n\nدیکھا کیا رقیب کی بانہوں میں جب اُسے\nنامِ   وفا  کو  دل  سے  مٹانا  پڑا مجھے \n\nثانی چراغ تب کہیں جا کر کے یہ جلا\nپہلے تو گھر ہی اپنا جلانا پڑا مجھے"
      },
      {
        "id": "ghazal_110",
        "title": "مجھ کو چاہت میں کیا ہوا تیری",
        "content": "مجھ کو چاہت میں کیا ہوا تیری\nاب  جفا  بھی  لگے  وفا  تیری\n\nبجھ گیا ہوں تو کیا خطا تیری\nیہ تو فطرت ہے اے ہوا تیری\n\nذکر جب بھی ہوا جفاؤں کا\nیاد  آتی  رہی  وفا  تیری\n\nاب کسی اور کو لبھانا تو\nہم نے تو دیکھ لی ادا تیری\n\nنیم جاں ہو گئے تری خاطر\nاور چاہت ہے کیا بتا تیری\n\nلوگ دل کو دکھا کے ہنستے ہیں \nیہی دنیا ہے کیا خدا تیری\n\nقتل  تو  نے کیا  بھروسے  کا\nکس قلم سے لکھوں سزا تیری\n\nتجھ میں ثانیؔ انانیت کیوں ہے \nجاوداں  جاں  ہے کیا  بتا  تیری"
      },
      {
        "id": "ghazal_111",
        "title": "خود کو اتنا بھی مت اُچھالا کر",
        "content": "خود کو اتنا بھی مت اُچھالا کر\nقد ملا ہے تو قد سنبھالا کر\n\nتجھ کو منزل کی ہے اگر چاہت\nراستہ خود نیا نکالا کر\n\nصاف توبہ سے بھی نہ ہو پائے\nدل کو اتنا بھی تْو نہ کالا کر\n\nکچھ نہیں نفرتوں سے حاصل ہے\nپیار  ہی پیار  دل میں  پالا کر\n\n جان جائے تو جانے دے  ثانیؔ\nحق کا ہر دم ہی بول بالا کر"
      },
      {
        "id": "ghazal_112",
        "title": "سوچئے گا ذرا یہ خدا کے لئے",
        "content": "سوچئے گا ذرا یہ خدا کے لئے\nزندگی کیا ملی ہے خطا کے لئے\n\nاب مجھے غم ملے یا خوشی دوستو\nزندگی وقف کی ہے وفا کے لئے\n\nمجھ کو پاگل زمانہ سمجھتا رہا\nمیں پھرا کوبکو دلربا کے لئے\n\nہر مصیبت مری دور ہوتی گئی \nہاتھ جیسے اٹھائے دعا کے لئے \n\nوہ تو مر کے بھی دنیا میں زندہ رہا\nجان دی جس نے ثانیؔ خدا کے لئے"
      },
      {
        "id": "ghazal_113",
        "title": "جہان تیرے لئے ہے نہ تو جہاں کے لئے",
        "content": "جہان تیرے لئے ہے نہ تو جہاں کے لئے\nخدا نے بھیجا ہے انساں کو امتحاں کے لئے\n\nمجھے بھی شوق سے سولی پہ تم چڑھا دینا\nزباں کھلے گی مگر میری حق بیاں کے لئے \n\nمیں اُن کو داستاں اپنی سنانے بیٹھ گیا \nمگر وہ آئے تھے خود اپنی داستاں کے لئے \n\nخدارا  اور  میرا  امتحان  مت  لینا\nترس رہا ہوں میں برسوں سے تیری ہاں کے لئے\n\nیہاں تو جیسے بھی کٹنی تھی کٹ گئی ثانیؔ\nرکھا ہے آپ نے ساماں بھی کچھ وہاں کے لئے"
      },
      {
        "id": "ghazal_114",
        "title": "حجرے کے پاس ہے نہ وہ ممبر کے آس پاس",
        "content": "حجرے کے پاس ہے نہ وہ ممبر کے آس پاس\nواعظ کو ہم نے دیکھا ہے ساغر کے آس پاس\n\nآنکھوں میں اشک آ گئے جب ہم نے یہ سنا\n”بیٹھے ہوئے ہیں لوگ ستمگرکے آس پاس“\n\nاس کو ڈرا رہا ہے تُو رہتا ہے جس کا دل\nولیوں بزرگوں اور قلندر کے آس پاس\n\nپانی کی ایک بوند میسر نہ ہو سکی\nجینے کو جی رہے ہیں سمندر کے آس پاس\n\nحکمت ہے کیا خدا کی کسی کو نہیں خبر\nپالا ہے بت شکن کو بھی آزر کے آس پاس\n\nچین و سکون دل کو ملا ہے بہت خدا\nآیا ہے جب سے ثانیؔ ترے در کے آس پاس"
      },
      {
        "id": "ghazal_115",
        "title": "خدا کے سامنے اک دن سبھی کا فیصلہ ہوگا",
        "content": "خدا کے سامنے اک دن سبھی کا فیصلہ ہوگا\nوہاں بدلا ملے گا سب کو جس نے جو کیا ہوگا\n\nجلا کر گھر غریبوں کا جو تم اترتے پھرتے ہو  \nکبھی سوچا خدا کے سامنے انجام کیا ہوگا \n\nسفر کی مشکلوں سے تم کبھی واپس نہیں ہونا\nچلو گے اور آگے تو کوئی رستہ نیا ہوگا\n\nوفا کا میں ہوں شیدائی وفا کو عام کر دونگا\nکسی محبوب سے کوئی نہیں ہرگز جدا ہوگا\n\nعدو کی میں شکایت کیا کروں تم ہی کہو ثانی ؔ\n”لگا ہے پیٹھ پر خنجر کوئی اپنا رہا ہوگا“\n"
      },
      {
        "id": "ghazal_116",
        "title": "رخ اپنا پھیر کے مجھ سے جو جارہا ہے اب",
        "content": "رخ اپنا پھیر کے مجھ سے جو جارہا ہے اب \nنظر میں لاکے نظر سے گرا رہا ہے اب \n\nہمارے دور میں پوچھو نہ عشق کی حالت \nہمارے دور میں فتنہ بتا رہا ہے اب \n\nخدا ہی جانے کہ کیا ہے ارادہ قاتل کا \nمرا مسیحا وہ خود کو بتا رہا ہے اب \n\nفریب دیتا تھا اوروں کو جو زمانے میں \nفریب کھا کے زمانے سے جارہا ہے اب \n\nخلاف میرے رقیبوں نے کردیا اس کو \nوہ میرے دل کو مسلسل دکھا رہا ہے اب \n\nبیاض میرؔ کو ثانیؔ نے کیا پڑھا لوگو\nزمین ِ میر میں غزلیں سنا رہا ہے اب"
      },
      {
        "id": "ghazal_117",
        "title": "تجھ سے میں ڈر جاؤں کاہے کو",
        "content": "تجھ سے میں ڈر جاؤں کاہے کو\nجیتے جی مر جاؤں کاہے کو\n\nمیرا رب تو ہے دل میں میرے\nڈھونڈنے باہر جاؤں کاہے کو\n\nمیرے حق میں جب وہ چاند نہیں \n چھت کے اوپر جاؤں کاہے کو\n\nمیرا محافظ جب ہے ساتھ مرے\nلے کے لشکر جاؤں کاہے کو\n\n میں ہوں بھکاری اک تیرے در کا\nپھر میں در در جاؤں کاہے کو\n\nجن کو رشتے کا احساس نہیں \nان کے میں گھر جاؤں کاہے کو"
      },
      {
        "id": "ghazal_118",
        "title": "دورِ حاضر میں ایسی خطا کس لئے",
        "content": "دورِ حاضر میں ایسی خطا کس لئے\nمانگتے ہو وفا کا صلہ کس لئے\n\nجو نہ کرنا تھا وہ ہی کیا کس لئے\nبیچ کر کھا گئے تم انا کس لئے\n\nجام بھر بھر کے کل تک پلاتے رہے\nاب مجھے کہہ رہے ہو بُرا کس لئے\n\nدیکھ کر روشنی ہم غریبوں کے گھر\nدل میاں آپ کا جل گیا کس لئے \n\nجب زمانے سے لڑنے کی ہمت نہیں \nتم ہوئے عشق سے آشنا کس لئے \n\nمیں تو کہتا تھا بچنا امیروں سے تم \nآج دل ٹوٹنے کا گِلاکس لئے \n\nاُن دنوں کیا تھے تم یاد ثانیؔ کو ہے\nاِن دنوں بنتے ہو پارسا کس لئے"
      },
      {
        "id": "ghazal_119",
        "title": "کیا عجب شے یہ پیار ہے صاحب",
        "content": "کیا عجب شے یہ پیار ہے صاحب\nنام کی بس بہار ہے صاحب\n\nاب تو دنیا اسی کی سنتی ہے\nجو یہاں  مالدار ہے صاحب\n\nلوٹ کر وہ ضرور آئے گا\nٹوٹے دل کی پکار ہے صاحب\n\nلمس سے قبل سوچنا ہو گا\nساتھ گل کے تو خار ہے صاحب\n\nاب  دکھانے لگے  وہی آنکھیں \nجن پہ میرا ادھار ہے صاحب\n\nامن قائم تو ہو نہیں سکتا\nدل میں جب تک درار ہے صاحب\n\nڈال  دے گا کبھی  ہلاکت میں \n یہ جو میں کا خمار ہے صاحب\n"
      },
      {
        "id": "ghazal_120",
        "title": "روتے ہوئے کو یار ہنسانا، یہ اسلام سکھاتا ہے",
        "content": "روتے ہوئے کو یار ہنسانا، یہ اسلام سکھاتا ہے\nبھٹکے ہوئے کو راہ دکھانا، یہ اسلام سکھاتا ہے\n\nجن شاخوں پہ نفرت دیکھو یارو ایسی شاخوں کو\nکاٹ کے ان کو آگ لگانا، یہ اسلام سکھاتا ہے\n\nجو ہے دشمن مظلوموں کا اور ستمگر انساں کا\nاس کو مٹانے میں مٹ جانا، یہ اسلام سکھاتا ہے\n\nکوئی نہ چھوٹا اوربڑا ہے سب ہیں اللہ کے بندے\nسب سے دل سے ہاتھ ملانا، یہ اسلام سکھاتا ہے\n\nجاتی ہے تو جائے اپنی، جان بچانا اوروں کی\nخود سے پہلے پانی پلانا، یہ اسلام سکھاتا ہے \n\nراہ میں گر ہو کانٹا پتھر نظریں بچا کر مت جانا\nپہلے رُک کے اس کو ہٹانا، یہ اسلام سکھاتا ہے"
      },
      {
        "id": "ghazal_121",
        "title": "چراغِ محبت یوں جلنے کا نا ہے",
        "content": "چراغِ محبت یوں جلنے کا نا ہے\nکہ جب تک ترا دل بدلنے کا نا ہے\n\nسہارا  دے  اپنے  دیوانے کو آ کے\nکسی اور سے یہ سنبھلنے کا نا ہے\n\nتو جب تک کرے گا نہ اقرار سن لے\nدِوانہ ترے در سے ٹلنے کا نا ہے\n\nہم ہی ہیں جو نخرے اٹھاتے ہیں تیرے\nکسی  اور کے پاس  چلنے کا  نا  ہے\n\nتلاشی لو گھر کی بڑے، شوق سے تم\nکوئی بم یا خنجر نکلنے کا نا ہے\n\nخدا کو تُو محبوب تب تک نہ ہوگا\nتکبّر کو جب تک کچلنے کا نا ہے\n\nنئی نسل کی چاہتیں بھی نئی ہیں \nکھلونوں سے اب یہ بہلنے کا نا ہے \n\nخدا کی عنایت ہے مجھ ناتواں پہ \nستم سے یہ ثانیؔ دہلنے کا  نا  ہے\n"
      },
      {
        "id": "ghazal_122",
        "title": "بہت آسان ہے گھر کو جلانا",
        "content": "بہت آسان ہے گھر کو جلانا\nبہت مشکل ہے لیکن گھر بنانا\n\nچلیں گے چاندنی شب میں ٹہلنے\nمرے ہم راز ہمدم آپ آنا\n\nبہت مہنگا پڑے گا تم کو اک دن\nکسی مجبور کے دل کو دْکھانا\n\nوفا ہرگز نہ کرنا میری مانو\nدکھاوے کا ہے یہ عالم سہانا\n\nامیرِ شہر ایک جاہل بنا ہے\nہنر ثانیؔ سنبھل کر تم دِکھانا"
      },
      {
        "id": "ghazal_123",
        "title": "میں یہاں ڈھونڈتا ہی رہا اور کچھ",
        "content": "میں یہاں ڈھونڈتا ہی رہا اور کچھ\nتھا مقدر میں لیکن لکھا اور کچھ\n\nآ گیا بھائی جب غیر کی بات میں \nہوگا کیا اس سے بڑھ کر بُرا اور کچھ\n\nآپ کو جانا ہے جائیے بزم سے\nمجھ کو تو ہے ابھی دیکھنا اور کچھ\n\nدے رہا ہے تسلی مسیحا مجھے\nکہہ رہا ہے مگر آئینہ اور کچھ\n\nاس لئے فاصلہ درمیاں ہو گیا\nمیں نے بولا تھا کچھ سن لیا اور کچھ\n\nدل جگر جسم جاں عشق میں دے دیے\nتھا  تقاضا مگر عشق  کا  اور کچھ\n\nزندگی آ گئی آخری موڑ پہ\nچھوڑ ثانیؔ یہاں سوچنا اور کچھ\n"
      },
      {
        "id": "ghazal_124",
        "title": "ہماری طرح وفا تم بھی کر سکو گے کیا",
        "content": "ہماری طرح وفا تم بھی کر سکو گے کیا\nبھنور میں عشق کے بولو اُتر سکو گے کیا\n\nیہ عشق عشق ہے کوئی ہنسی مذاق نہیں \nیہ راہ  کانٹوں  بھری  ہے گزر سکو گے کیا\n\nامیرِ  شہر  سے  تیرا  ہے  خون کا رشتہ\nغریب خانے میں میرے ٹھہر سکو گے کیا\n\nہمیں ستاؤ گے  تڑپاؤ  گے  رلاؤ  گے\nامیرِ شہر ہو تم اور کر سکو گے کیا \n\nبدن کے زخم سبھی میرے بھر تو دو گے تم \nطبیبو زخمِ جگر میرا بھر سکو گے کیا \n\nخدا نے بخشی مجھ کو اڑان ہے ثانیؔ\nپروں کو میرے بھلا تم کتر سکو گے کیا\n"
      },
      {
        "id": "ghazal_126",
        "title": "تیرا دیوانہ بھلا اور کدھر جائے گا",
        "content": "تیرا  دیوانہ بھلا  اور  کدھر  جائے  گا\nچھوڑ کے در کو ترے کون سے در جائے گا\n\n کوئی  نقّاد  اگر  ناپے  پیمانے  پر\n”جتنا شیرازہ ہے لفظوں کا بکھر جائے گا“\n\nکل وہ روئے گا مجھے چھوڑ کے جانے والا\nجب رقیبوں کی نگاہوں سے اتر جائے گا\n\nاپنے  آنگن کا  شجر کاٹنے  والو  سوچو\nشام کو لوٹا پرندہ توکدھر جائے گا\n\nجسکے کہنے پہ جہاں بھر سے بغاوت کر لی\nکیا  خبر تھی کہ زمانے سے وہ ڈر جائے گا\n\nاپنے ایمان پہ مضبوطی سے رہنا ثانیؔ\nفتنہ طوفان سا ہوتا ہے گزر جائے گا"
      },
      {
        "id": "ghazal_126",
        "title": "خمار اس آنکھ کی تیکھی شراب کا نہ گیا",
        "content": "خمار اس آنکھ کی تیکھی شراب کا نہ گیا\nمیرے خیال سے چہرہ وہ چاند سا نہ گیا\n\nتمہارے پیار نے پیروں میں باندھ دی بیڑی\nمیں جا رہا تھا یہاں سے مگر چلا نہ گیا\n\nتمام عمر بھٹکتا رہا تلاش میں پر \nترے نگر کے لئے کوئی راستہ نہ گیا\n\nمیں اس لئے چلا آیا تیری محفل سے \nزبانِ غیر سے چرچا ترا سنا نہ گیا \n\nسزا ملی ہے ہمیں ایسے دل دکھانے کی \n”کسی پہ ہنس لئے اتنا کہ پھر ہنسا نہ گیا“\n\nمزاج ملتا بھی ان سے تو کس طرح ثانی\nوفا  پرست  تھا  میں  بے وفا  بنا نہ گیا"
      },
      {
        "id": "ghazal_127",
        "title": "تم جو تنہائی میں آ بیٹھے ہو",
        "content": "تم جو تنہائی میں آ  بیٹھے ہو\n”کیا کوئی روگ لگا بیٹھے ہو“\n\nحسن کی تم نے جو پائی دولت \nسب کو دیوانہ بنا بیٹھے ہو\n\nخود کو کہتے ہو بڑے دانا تم \nدل  مگر  اپنا گنوا  بیٹھے ہو \n\nاب تماشائی بنے گی دنیا \nحال ناداں کو سنا بیٹھے ہو\n\nنبض بھی تھمنے لگی ہے میری \nاور تم ہو کہ خفا بیٹھے ہو\n\nساری دنیا کو جلن ہونے لگی \nمیرے پہلو میں جو آ بیٹھے ہو\n\nگْم ہے سینے سے مرا دل ثانی ؔ\nکیا  کہیں  آپ چھپا  بیٹھے ہو\n"
      },
      {
        "id": "ghazal_128",
        "title": "دل میں تھا اس کے اور نہ اس کے جگر میں تھا",
        "content": "دل میں تھا اس کے اور نہ اس کے جگر میں تھا\nجو کچھ بھی تھا کمال وہ اس کی نظر میں تھا \n\nمنظر بیان کیسے کروں سوچتا ہوں میں \n”سورج کا اک گلاب سا طشتِ سحر میں تھا“ \n\nناکامیوں کا اپنی سبب کا پتا چلا \nدشمن کا رازدار تو اپنے ہی گھر میں تھا \n\nآسان تم سمجھتے ہو آنا یہاں مرا\nمعلوم تم کو کیا ہے کہ کب سے سفر میں  تھا\n\nکیسے چھپاتا خود کو بتا اے میرے صنم\nاپنی وفا کا تذکرہ ہر سو نگر میں تھا"
      },
      {
        "id": "ghazal_129",
        "title": "سوچ کر یہ میرا دل دہلنے لگا",
        "content": "سوچ کر یہ میرا دل دہلنے لگا\nراستہ کیوں بھلا وہ بدلنے لگا\n\nایک مدت سے پتھر بنا جو رہا\nعشق کی چوٹ سے وہ پگھلنے لگا\n\nجب تڑپ کر دعا ایک ماں نے ہے کی\nپھر تو صحرا بھی پانی اُبلنے لگا\n\nدشمنوں میں میرے کھلبلی مچ گئی\nجب دیا میرا طوفاں میں جلنے لگا\n\nتم نکل آؤ ماضی سے ثانیؔ کبھی\nشام کا اب تو سورج بھی ڈھلنے لگا\n"
      },
      {
        "id": "ghazal_130",
        "title": "فطرت نہیں بدلتی ہے انسان کیا کرے",
        "content": "فطرت نہیں بدلتی ہے انسان کیا کرے\nجس کا دغا ہے کام وہ کیسے وفا کرے\n\nسینے میں اس کی آگ لگی کو بجھائے کون\nخوشحالی دیکھ کر جو کسی کی جلا کرے\n\nسائل سبھی کے خیر میں کرتا رہا دعا\nاللہ دو جہان میں سب کا بھلا کرے\n\nہے یہ مرے پڑوسی کا محبوب مشغلہ\nدیکھے کہیں شرارہ تو اس پر ہوا کرے\n\nمیں مانگتا ہوں رب سے دعائیں یہ صبح و شام\n”ایسا کبھی نہ ہو کہ وہ ترکِ وفا کرے“\n\nثانیؔ میں اسکا کیوں نہ کروں دل سے احترام\nبے لوث دوسروں کی جو خدمت کیا کرے"
      },
      {
        "id": "ghazal_131",
        "title": "دل مرا سازِ محبت پہ چہک لیتا ہے",
        "content": "دل مرا سازِ محبت پہ چہک لیتا ہے\nتیرا دیوانہ ہے مستی میں تھرک لیتا ہے\n\nمفلسی ملک سے جائے بھی تو جائے کیسے\nحق غریبوں کا یہ نیتا ہی سٹک لیتا ہے\n\nاس سے بڑھ کر کے غلط حالِ چمن کیا ہوگا\nآبرو. پھول کی مالی ہی اُچک لیتا ہے\n\nیہ بھی حالات سے اک طرح بغاوت ہی تو ہے\nجس کو میدان میں ہونا تھا دُبک لیتا ہے\n\nدرد ہوتا ہے تو ہو جاتا ہے چہرے سے عیاں \nپھول جب شاخ پہ کھلتا ہے مہک لیتا ہے\n\nداستانِ غمِ دل کس کو سناؤں ثانیؔ\nجو بھی سنتا ہے وہی سن کے کھسک لیتا ہے"
      },
      {
        "id": "ghazal_132",
        "title": "بے وفا کو باوفا کاہے کہو ہو",
        "content": "بے وفا کو باوفا کاہے کہو ہو\nنا خدا کو تم خدا کاہے کہو ہو\n\nتم تو واقف نہیں اس آدمی سے \nاس کو اچھا یا بُرا کاہے کہو ہو \n\nکر کے مجھ سے بے وفائی جو گیا ہے \nاس کو میرا اب بھلا کاہے کہو ہو \n\n ہوش میں آ رے دیوانے ہوش میں آ\nزلفِ ناگن کو گھٹا کاہے کہو ہو \n\nصاحبِ مسند نے یہ اعلان کیا ہے \nتم گدھے کو بھی گدھا کاہے کہو ہو \n\nسب کا ہے ہندوستاں سب کا رہے گا\nصرف  اپنے  باپ کا کاہے کہو  ہو"
      },
      {
        "id": "ghazal_133",
        "title": "تجھ کو رسوا نہ کروں گا میں یہ سر جانے تک",
        "content": "تجھ کو رسوا نہ کروں گا میں یہ سر جانے تک\nمیری کوشش یہی ہوگی مرے مر جانے تک\n\nآئینہ آئینہ ہے آئینہ سچ بولے گا\nسنگ مارو بھلے اس کو بکھر جانے تک\n\nمیں تمہارا ہوں تمہارا ہی رہوں گا دلبر\nجانچ لینا مری سانسوں کے ٹھہر جانے تک\n\nآندھیاں دیکھ مجھے تُو نہ ڈرا پائے گا\nمیں تری راہ میں ہوں تیرے گزر جانے تک\n\nآسماں پہ ہی نظر رہتا ہے اس کا ہردم\nآخری پر بھی پرندے کا کتر جانے تک\n\nعزم ثانیؔ کا بھی دیکھے گا یہ دریا مغرور \nکشتی چھوڑوں گا نہ نرغے سے ابھر جانے تک"
      },
      {
        "id": "ghazal_134",
        "title": "تیری یادوں میں لپٹی ہوئی تر ہوا",
        "content": "تیری یادوں میں لپٹی ہوئی تر ہوا\nآتی رہتی ہے مجھ کو برابر ہوا \n\nجھونپڑی کیا حویلی بھی ٹک نا سکے\nگر  بدلنے  لگے  اپنے  تیور  ہوا \n\nجب فضاؤں میں پھیلی ہو آلودگی \nپھر  میسر  کہاں  سے  ہو  بہتر  ہوا \n\nچل  رہی  اِترا  اِترا  کے اُس  روز سے \nجب سے آئی ہے ان کو یہ چھو کر ہوا\n\nبھول جاؤں اُسے جب بھی سوچا کبھی \nاس کی  یادوں  کے لے آئی لشکر ہوا \n\nشکر ہے عزم میرا سلامت رہا \nیوں تو آئی ڈرانے کو اکثر ہوا\n\nوہ بھی  بے چین ہے ثانیؔ تیرے بغیر \nبس ابھی گزری ہے مجھ سے کہہ کر ہوا\n"
      }
    ]
  },
  {
    "id": "section_qita",
    "heading": "قطعہ",
    "items": [
      {
        "id": "qita_1",
        "title": "عہد حاضر کا ایسا سخنور ہے تو",
        "content": "عہد حاضر کا ایسا سخنور ہے تو\nاس جہانِ سخن میں تْو فانی نہیں \n\nمیر و  غالب کا ایک حسنِ بدل\nتو ہے ثانی مگر تیرا ثانی نہیں \n\n  توحید ازہر پورنوی"
      },
      {
        "id": "qita_2",
        "title": "ہر ایک شعر, غزل کو, ہر اک کہانی کو",
        "content": "ہر ایک شعر, غزل کو, ہر اک کہانی کو \nلکھا ہے جس سے قلم کی اسی روانی کو \nمری دعا ہے کہ محنت یہ انکی رنگ لائے \nخدا قبول کرے یارو عکسِ ثانی کو\n\nصاحب خان ساگر     "
      },
      {
        "id": "qita_3",
        "title": "پورا دل کا ہوا ارمان یارو",
        "content": "پورا دل کا ہوا ارمان یارو\nثانی  کا  آ گیا  دیوان  یارو \nاس میں بسی میری جان یارو \nثانی کا آ گیا دیوان یارو \n\nاردو کے لفظوں سے اس کو سنوارا \nہندی کا بھی تو لیا ہے سہارا \nدونوں زبان اس کی شان یارو \nثانی کا آ گیا دیوان یارو \n\nغزلوں میں اسکی غضب کی روانی \nہر شعر میں ہے مکمل کہانی \nاس کی یہی پہچان یارو \nثانی کا آ گیا دیوان یارو \n\nاردو ادب کے وہ اہلِ نظر ہیں \nاستاد صاحب تو انکے ثمر ہیں \nعلم و ہنر کی ہیں خان یارو \nثانی کا آ گیا دیوان یارو \nہوا یہ جہاں میں جو معتبر ہے\nدادا مظہر کی دعا کا اثر ہے\nرب نے عطا کی یہ شان  یارو \nثانی کا آ گیا دیوان یارو\n\nمحنت یہ ثانی کی وہ رنگ لائی \nدیتا ہے ہر کوئی دل سے بدھائی \nپیچھے رہے کیوں عمران یارو \nثانی کا آ گیا ثانی دیوان یارو  \n\n   عمران دھامپوری\n"
      }
    ]
  }
]
