[
  {
    "id": "section_hamd",
    "heading": "हम्द",
    "items": [
      {
        "id": "hamd_1",
        "title": "(हम्द बारी तआला) वह यकता है यगाना है वह हर आलम का बानी है",
        "content": "वह यकता है यगाना है वह हर आलम का बानी है\nन कोई उसका हमसर है न कोई उसका सानी है\n\nबिना उसकी इजाज़त के कोई पत्ता नहीं हिलता\nवह तन्हा है मगर हर चीज़ पर उसकी हुकूमत है\n\nजब अंबर देखता हूँ गौर से हैरान होता हूँ\nख़ला में चाँद ठहरा है घटा में छुपके पानी है\n\nकहीं शादाब है दुनिया कहीं मरुस्थल ही मरुस्थल है\nकहीं बेरंग नज़ारा है कहीं दिलकश रवानी है\n\nवह ख़ालिक है जहाँ भर का वह मालिक है जहाँ भर का\nवही दाता है हम सब का उसी की पासबानी है"
      },
      {
        "id": "hamd_2",
        "title": "तेरी क़ुदरत डाली डाली (हम्दिया नज़्म)",
        "content": "तेरी क़ुदरत डाली डाली\nपत्ता पत्ता बाली बाली\n\nतेरे दम से रोशन दुनिया\nतेरे दम से गुलशन दुनिया\n\nलहरों में तेरे दम से रवानी\nतेरे दम से बहता पानी\n\nतेरा नहीं है सानी कोई\nतेरा नहीं है बानी कोई\n\nतू है तन्हा यकता यगाना\nतेरे किनारे से सारा ज़माना\n\nतेरा जलवा ज़र्रा ज़र्रा\nदरिया दरिया मरुस्थल मरुस्थल\n\nपथ्थर तले भी कीड़े पालें\nअँधे साँप को रोज़ी डालें\n\nतू ही औल तो ही आख़िर\nतू ही बतन तू ही ज़ाहिर\n\nतेरी सँयाद से सब हैं क़ासिर\nअदना अएल भी माहिर शायर\n\nधड़कन की रफ़्तार में तू है\nआदम की गुफ़्तार में तू है\n\nसानी के पास कुछ नहीं नेकी के नाम पर\nकुछ है अगर तो वह है मोहब्बत रसूल की"
      }
    ]
  },
  {
    "id": "section_naat",
    "heading": "नअत",
    "items": [
      {
        "id": "naat_1",
        "title": "(नअत-ए-पाक) महबूब जिसको हो गई सन्नत-ए रसूल की",
        "content": "महबूब जिसको हो गई सन्नत-ए रसूल की\nउसे मिलेगी ख़ुल्द में क़ुरबत-ए रसूल की\n\nपढ़ते दरूद-ए-पाक हैं हूर व मलक सभी\nअज़्ज़ां है सबसे अज़्ज़ा है अज़मत-ए रसूल की\n\nकुरआन में ऐसा कोई भी पाराह नहीं मिला\nख़ुद ही जो कर रहा हो न मिफ़्ताह-ए रसूल की\n\nहज़रत बिलाल नाज़ाँ हैं अपने नसीब पर\nकरने लगे हैं जब से वह ख़िदमत-ए रसूल की\n\nउंगली के इक इशारे पर टुकड़े हुआ क़मर\nमन्कर ये देख कितनी है अज़मत-ए रसूल की\n\nबस वह ही मुस्कराएगा महशर में देखना\nआदत है जिसको करनी इतात-ए रसूल की\n\nसानी के पास कुछ नहीं नेकी के नाम पर\nकुछ है अगर तो वह है मोहब्बत-ए रसूल की"
      },
      {
        "id": "naat_2",
        "title": "(नअत-ए-पाक) जिस का भी मोहम्मद से वास्ता नहीं होगा",
        "content": "जिस का भी मोहम्मद से वास्ता नहीं होगा\nयह समझ लो उसका तो कुछ भला नहीं होगा\n\nवह खड़ा मुनाफ़िक की सफ़ में होगा महशर में\nइश्क़ जिस के सीने में आप का नहीं होगा\n\nख़ुल्द तक न पहुँच पाएगा, चाहे वह कोई भी हो\nराह-ए-क़मली वाले की अगर नहीं हो वफ़ा\n\nहो सकता है मोहम्मद का नाम लेने वाला\nयह ज़मीन फ़लक कुछ भी बाख़ुदा नहीं होगा\n\nपत्थर भी खा कर जो दुआएँ देता हो\nएक सिवा अहमद के दूसरा नहीं होगा\n\nरब के आगे महशर में आप के सिवा बोले\nऐसा और किसी को भी हौसला नहीं हुआ\n\nनअत पढ़ते रहो हर घड़ी सानी के साथ\nदेखो तुम्हारे साथ कुछ बुरा नहीं होगा"
      }
    ]
  },
  {
    "id": "section_manajat",
    "heading": "मनाजात",
    "items": [
      {
        "id": "manajat_1",
        "title": "एक बार मुझे भी तो तैबा को दिखा दे रब",
        "content": "एक बार मुझे भी तो तैबा को दिखा दे रब\nसोई है मेरी किस्मत किस्मत को जगा दे रब\n\nइस दुनिया में जहालत की छाई है घटा हर सू\nएक नूर की बदल को आलम में चला दे रब\n\nआसी हूँ बहुत लेकिन उम्मीद है वाबस्ता\nअहमद मर्सल के सिफ़के अपनी रज़ा दे रब\n\nजब तू ने मुझे आका की उम्मत में पैदा\nलहज़ा भी मेरा आका के लहज़े से मिला दे रब\n\nजिस राह पे चलने से मिलती हो रज़ा तेरा\nसानी को मुसाफिर तू उस राह का बना दे रब"
      }
    ]
  },
  {
    "id": "section_man_ki_yad",
    "heading": "माँ की याद में",
    "items": [
      {
        "id": "man_ki_yad_1",
        "title": "इस दुनिया में तू नहीं ज़िंदा, अब तन्हा घबराऊँ माँ",
        "content": "इस दुनिया में तू नहीं ज़िंदा, अब तन्हा घबराऊँ माँ\nतेरी जुदाई के ग़म से मैं, कैसे दिल बहलाऊँ माँ\n\nमैं न तुझ से दूर हुआ जब, तू क्यों मुझ से दूर हुई\nछोड़ के मुझ को जाने पर तू, क्यों कर के मजबूर हुई\n\nयाद में तेरी कितना रोऊँ, कैसे तुझे बताऊँ माँ\nतेरी जुदाई …………………………………………\n\nतुझसे बिछड़ के क्या क्या दुखड़ा, ऐ माँ मैंने उठाया है\nठोकर मारी उसने मुझे, जिस के जी में आया है\nआजा आ जा लौट कर आ जा, हरदम तुझे पुकारूँ माँ\nतेरी जुदाई …………………………………………\n\nख़्वाबों में ही आ जा मेरे, जी भर कर देखूँ तुझे\nरहता हूँ बे'चैन बहुत ही, कुछ तो मिले राहत मुझे\nइसके उसके जैसे मैं भी, नग़्मा खुशियों का गाऊँ माँ\nतेरी जुदाई …………………………………………\n\nप्यार से तेरा पास बुलाना, और गले से लगा लेना\nफिर चेहरे के हर हिस्से को, ख़ुश हो कर बोसा देना,\nदिन वह भुलाना चाहूँ पर इक, पल भी भुला पाऊँ माँ\nतेरी जुदाई …………………………………………\n\nदेख के मेरे माथे पे बल, हाई वह तेरा तड़प जाना\nमुझ को हर पल याद आता है, उल्फत का वह ज़माना\nकोई नहीं तेरा सानी, तुझ को कहाँ से लाऊँ माँ\nतेरी जुदाई …………………………………………\n"
      }
    ]
  },
  {
    "id": "section_ghazals",
    "heading": "ग़ज़लें",
    "items": [
      {
        "id": "ghazal_1",
        "title": "रहज़नी आ ने लगी जब रहबरों के दरमियाँ",
        "content": "रहज़नी आ ने लगी जब रहबरों के दरमियाँ\nएक वेहशत सी है तआरि क़ाफ़लों के दरमियाँ\n\nरिज़ा रिज़ा उसे मेरे हौसलों ने कर दिया\nआ गया पत्थर कोई गर रास्तों के दरमियाँ\n\nदिल दुआएँ देता रहता हर घड़ी उस शख़्स को\nजो लूटाता रहता खुशियाँ ग़मज़दों के दरमियाँ\n\nयह समझ लो वह वली है आज के इस दौर में\nहक़ बयानी जो है करता ब़ातलों के दरमियाँ\n\nज़ुल्फ़-दो’ंटा को झटक कर जब वह महफ़िल से गए\nएक क़ियामत सी है बरपा आशिक़ों के दरमियाँ\n\nकिस को फ़ुर्सत है यहाँ अब कौन हाल-ए-दिल सुने\nहर कोई उलझा हुआ है मसलों के दरमियाँ"
      },
      {
        "id": "ghazal_2",
        "title": "अगरچہ आरज़ू हो यह कि खुद को जवादान कर लें",
        "content": "अगरچہ آرज़ू हो यह कि खुद को जवादान कर लें\nरकम तारिख के पन्नों पे अपनी दास्ताँ कर लें\n\nअजल के ऐ फ़रिश्ते आ गया अच्छा क्या लेकिन\n\"इजाज़त दे कि अपनी दास्ताँ-ए-ग़म बयान कर लें\"\n\nतमन्ना अब उजाले की कहीं से और क्या करना\nचलो रोशन चराग़-ए-दिल जला के खुद जहाँ कर लें\n\nकोई मिद्द-ए-मूक़ाबिल फिर न ठहर पाई बात पैक़ी है\nअगरچہ हौसले को खुद ही अपने कारवाँ कर लें\n\nतरन्नुम से शहद टपके तःत से ये फ़ज़ा महके\nसमझ में सब को आजाएगी गर उर्दू ज़बां कर लें\n\nनहीं हो शर्मिंदगी उस दिन मिले जिस रोज खुद से हम\nभलाई का कोई भी काम ए सानी यहाँ कर लें"
      },
      {
        "id": "ghazal_3",
        "title": "जिनका परनूर इबादत से जिगर होता है",
        "content": "जिनका परनूर इबादत से जिगर होता है\nऐसे लोगों की दुआओं में असर होता है\n\nइस ज़माने में बहुत कम ही मगर होता है\nजान देने का भी आशिक़ में हुनर होता है\n\nले के तलवार निकल पड़ता है ग़ाज़िय-ए-वक़्त\nजब किसी पे भी कहीं ज़ुल्म अगर होता है\n\nतुम कभी आ के गले से भी लगा लो दिलबर\nअब नहीं ख़्वाबों ख़यालों से गुज़र होता है\n\nफ़न जिसे आता है औरों को दगा देने का\nआज कल चैन से उसका ही बस्र होता है\n\nईंट पत्थर से सिर्फ घर नहीं बनता सानीؔ\nमिल के रहते हैं जहाँ सब वही घर होता है"
      },
      {
        "id": "ghazal_4",
        "title": "उसी के इश्क़ के साँचे में ढल रहा हूँ मैं",
        "content": "उसी के इश्क़ के साँचे में ढल रहा हूँ मैं\nउसी के वास्ते इतना बदल रहा हूँ मैं\n\nगँवां के उमर किसी बेवफ़ा की खातिर आज\nन जाने क्यों कफ़-ए-अफ़़सूस मिल रहा हूँ मैं\n\nकफ़स में जैसे परिंदा तड़पता रहता है\nकिसी की याद में ऐसे मचल रहा हूँ मैं\n\nमुझे सँभाल सको तो सँभाल लो आ कर\nख़ुद ही मैं बर्फ़ की तरह पिघल रहा हूँ मैं\n\nअभी तुझे कहाँ एहसास है मेरे बच्चे\nबला की धूप में क्यों कर के जल रहा हूँ मैं"
      },
      {
        "id": "ghazal_5",
        "title": "रोज़ ही हादसा बन बन के मिला करती है",
        "content": "रोज़ ही हादसा बन बन के मिला करती है\nज़िंदगी किस से यहाँ सच में वफ़ा करती है\n\nराह-ए-संसान से आती हैं सदाएँ मुझको\nइसलिए रूह भी बेचैन रहा करती है\n\nतेरे आगमन के तसव्वुर से मचल जाता हूँ\n\"दिल के दरवाज़े पे दस्तक सी हवा रहती है\"\n\nवह मेरी शान मेरा नाज़ मेरी जान भी है\nउसकी सूरत है जो आँखों में बसा करती है\n\nयह मोहब्बत की अलामत नहीं तो फिर क्या है\nरात भर साथ मेरे वह भी जागा करती है\n\nमौत का ख़ौफ़ किसी और को होगा सानीؔ\nआशिक़ी मौत से कब यार डरा करती है"
      },
      {
        "id": "ghazal_6",
        "title": "आँखों से बदगुमानी का चश्मा उतार देख",
        "content": "आँखों से बदगुमानी का चश्मा उतार देख\nकितना है तेरी याद का दिल पर ग़ुबार देख\n\nतेरी तो कोशिशें रहीं हर दम रहे ख़िज़ाँ\nआ ही गई चमन में यह आख़िर बहार देख\n\nरंगीन यह जहान तुझे आएगा नज़र\nहो कर किसी पे तो भी तो दिल से निसार देख\n\nदिल को लगाया मैंने तो उस में अजब है क्या\nहर एक को किसी न किसी से है प्यार देख\n\nअच्छा नहीं हूँ तुझ से बिछड़ कर मैं आज कल\nहालत कभी तो आ के मेरे ग़मगसार देख"
      },
      {
        "id": "ghazal_7",
        "title": "ग़म के सागर से तू निकाल मुझे",
        "content": "ग़म के सागर से तू निकाल मुझे\n“आइना फेंक कर संभाल मुझे”\n\nउस को देखा तो यह कहा दिल ने\nअब रहा कुछ नहीं मलाल मुझे\n\nअब तो आठों पहर सताता है\nलम्हा लम्हा तेरा ख़याल मुझे\n\nपहले सपने हसीं दिखाए फिर\nदिल को तोड़ा क्या निड़्हाल मुझे\n\nमैं तो मिट्टी हूँ चाक की सानी\nजैसा चाहे तो वैसा ढाल मुझे"
      },
      {
        "id": "ghazal_8",
        "title": "दरिंदों की हिमायत हो रही है",
        "content": "दरिंदों की हिमायत हो रही है\nयह कैसी अब सियासत हो रही है\n\nजिसे सूली चढ़ाना चाहिए था\nउसी की अब हिफाज़त हो रही है\n\nजहाँ बेटी है मरियम और सीता\nवहीं पामाल इस्मत हो रही है\n\nभला इंसाफ़ अब कैसे मिलेगा\nबिकाऊ जब अदालत हो रही है\n\nकिसी को आइना जब से दिखाया\nमुसीबत पर मुसीबत हो रही है\n\nयह कैसी अब तरक़्क़ी हमने कर ली\nबहुत बीमार आदत हो रही है\n\nहिफाज़त घर की, सानी ख़ुद ही करना\nलुटेरों की हुकूमत हो रही है"
      },
      {
        "id": "ghazal_9",
        "title": "जब से मुझको तुझ से उल्फ़त हो गई",
        "content": "जब से मुझको तुझ से उल्फ़त हो गई\nतो ही मेरी हर ज़रूरत हो गई\n\nआप जब से दूर मुझ से हो गए\nहर मुसीबत अपनी क़िस्मत हो गई\n\nएक वहशी हो गया है पारसा\nउसको भी शायद मोहब्बत हो गई\n\nख़ून रोती है रियाया इन दिनों\nज़ालिमों की अब हुकूमत हो गई\n\nछाई रहती है उदासी घर मेरे\nजब से बेटी घर से रुख़्सत हो गई\n\nएक पागल की तरह देखा मुझे\n“यह न पूछा क्यों यह हालत हो गई”\n\nसानी सूली पे चढ़ेगा एक दिन\nहक़ बयानी की जो आदत हो गई"
      },
      {
        "id": "ghazal_10",
        "title": "इश्क़ में जाँ निसार कौन करे",
        "content": "इश्क़ में जाँ निसार कौन करे\nअब यहाँ सच्चा प्यार कौन करे\n\nजो दिया वह है तोहफ़ा मौसम का\nअब ख़िज़ाँ को बहार कौन करे\n\nसब को पैसे की पड़ गई चाहत\nफूल का कारोबार कौन करे\n\nआज नक़दी का जब ज़माना है\nचाहतें फिर उधार कौन करे\n\nजल रही आग राह-ए-उल्फ़त में\nदेखना है कि पार कौन करे\n\nबस तेरा ही तेरा दीवाना हूँ\nमुझ को अपना शुमार कौन करे\n\nथक थका कर कहा मेरे दिल ने\nउम्र भर इंतिज़ार कौन करे\n\nइश्क़ सोना है आप कहते हो\n“आप का इतबार कौन करे”"
      },
      {
        "id": "ghazal_11",
        "title": "मुझ को हसरत है उसे दिल के मकाँ तक देखूँ",
        "content": "मुझ को हसरत है उसे दिल के मकाँ तक देखूँ\nबंद आँखों से परे वहम व गुमाँ तक देखूँ\n\nतेरी चाहत ने यों नज़रों के हैं मंज़र बदले\nतेरी सूरत ही नज़र आए जहाँ तक देखूँ\n\nउसकी नज़रें तो नए रोज़ नज़ारे देखें\n“मैं फ़क़त एक ही तस्वीर कहाँ तक देखूँ”\n\nमेरे आगे ही वो गुलशन को जलाए मेरे\nऔर मजबूर करे है कि धुआँ तक देखूँ\n\nमुझ को बख़्शी है मोहब्बत ने करामत ऐसी\nकोई देखे न जहाँ तक मैं वहाँ तक देखूँ\n\nवक़्त दिखलाता है सब को ही तमाशा सानी\nवरना यह किस की तमन्ना है ख़िज़ाँ तक देखूँ"
      },
      {
        "id": "ghazal_12",
        "title": "कितना करते हो प्यार आज कहो",
        "content": "कितना करते हो प्यार आज कहो\nकब से था इंतिज़ार आज कहो\n\nग़ैर के कहने से बग़ावत की\nकौन है ग़मगसार आज कहो\n\nमुल्क को लग गई नज़र किस की\nक्यों है यह इंतिशार आज कहो\n\nक़र्ज़ पहला न जब चुक पाए\nकैसे लोगे उधार आज कहो\n\nपीठ पीछे बहुत फड़कते थे\nरोबरू हूँ मैं यार आज कहो\n\nअक़्ल वालों ने दिल गँवा डाला\nकौन है होशियार आज कहो\n\nभाई भाई के दरमियाँ सानी\nपड़ गई क्यों दरार आज कहो"
      },
      {
        "id": "ghazal_13",
        "title": "जो छोड़ा था उसी पर आ गया ना",
        "content": "जो छोड़ा था उसी पर आ गया ना\nतेरे हाथों में खंजर आ गया ना\n\nमैं कहता था कबूतर मत उड़ाना\nबेचारा ज़ख्म खा कर आ गया ना\n\nबहुत आसान समझते थे वफ़ा को\nतुम्हें भी यार चक्कर आ गया ना\n\nनतीजा यह तुम्हारी सोच का है\nहुकूमत में सितमगर आ गया ना\n\nहमारे क़त्ल पे कल तुम ही चुप थे\nतुम्हारा भी तो नंबर आ गया ना\n\nअदब की सारी दीवारें गिरा कर\nसर-ए-महफिल वो जोकर आ गया ना\n\nक़सम खा कर गया था गाँव से तू\nमगर सानी पलट कर आ गया ना"
      },
      {
        "id": "ghazal_14",
        "title": "ज़मीन के साथ अम्बर बोलता है",
        "content": "ज़मीन के साथ अम्बर बोलता है\nखुदा एक है यह मंज़र बोलता है\n\nवही हक़ है जो हक़ पर बोलता है\nमुजाहिद का कटा सर बोलता है\n\nवो जब अल्लाह अकबर बोलता है\nअदू के चेहरे पे डर बोलता है\n\nअगर हक़ पे हो इंसाँ तो क़सम से\nमदद में उसकी पत्थर बोलता है\n\nखता कर के कहाँ मैं जी सकूँगा\nमेरे दिल का क़लंदर बोलता है\n\nकिसी ज़ालिम के आगे सर झुका दो\nयह कब कोई सुखनवर बोलता है\n\nबड़ों से जिस को मिलती हैं दुआएँ\nउसी का तो मुक़द्दर बोलता है\n\nदिलावर तुम उसे समझो यहाँ जो\nसितमगर को सितमगर बोलता है\n\nलहू से तर फ़ज़ा है आज सारी\nयह सहमा सहमा मंज़र बोलता है\n\nसिला तुझ को मिला है परवरिश का\nयह बेटा जो पलट कर बोलता है\n\nहै ख़तरा हक़ बयानी में ऐ लोगो\nमगर सानी बराबर बोलता है"
      },
      {
        "id": "ghazal_15",
        "title": "उस के सिवा किसी से मोहब्बत नहीं हुई",
        "content": "उस के सिवा किसी से मोहब्बत नहीं हुई\nलेकिन यह बात कहने की हिम्मत नहीं हुई\n\nहम मंतज़िर हैं आज भी उन के लिए मगर\nउन को पलट के आने की फुरसत नहीं हुई\n\nउतरा रहे थे कल मियाँ अक़्ल व शऊर पर\nतुम से भी अपने दिल की हिफाज़त नहीं हुई\n\nहर सू हुआ धुआँ धुआँ लाशों का ढेर है\nऐसी कभी तो शहर की हालत नहीं हुई\n\nख़ुश हो के अपनी ज़िंदगी ग़ुरबत में काट ली\nताबे किसी के मेरी ज़रूरत नहीं हुई\n\nशैतान क्यों न ऐसे घरों में करेंगे राज\nमुद्दत से जिन घरों में तिलावत नहीं हुई\n\nसानी हमारे घर का मुहाफ़िज़ बना है वो\nअपने ही घर की जिस से हिफाज़त नहीं हुई"
      },
      {
        "id": "ghazal_16",
        "title": "अक़्ल हैरान है मेरी आज वो क्या कहते हैं",
        "content": "अक़्ल हैरान है मेरी आज वो क्या कहते हैं\nआँख वालों भी, अंधेरे को ज़िया कहते हैं\n\nआप भी जाँच लें, दुनिया की हक़ीक़त क्या है\nहम ने जाँचा है तभी उस को बुरा कहते हैं\n\nउन से उल्फ़त है हमें बस यह सबब है वरना\nहम किसी के कहाँ नखरे को अदा कहते हैं\n\nक्या बड़ी बात जो तुम पर भी उठी है उंगली\n“होती आई है कि अच्छों को बुरा कहते हैं”\n\nमुस्तनद वो तो कभी हो नहीं सकते सानी\nअपने होंटों से किसी को जो बुरा कहते हैं"
      },
      {
        "id": "ghazal_17",
        "title": "जो हुआ सो हुआ अमाँ छोड़ो",
        "content": "जो हुआ सो हुआ अमाँ छोड़ो\nज़ुल्म का तज़किरा अमाँ छोड़ो\n\nहादिसो, वो भी तुम मेरा रास्ता\nरोक पाओगे क्या अमाँ छोड़ो\n\nदर्द कैसा मुझे दिया उस ने\nक्या सुनोगे भला अमाँ छोड़ो\n\nमुझ को मालूम है कि क्या हो तुम\nलंबी यों फेंकना अमाँ छोड़ो\n\nमुतलबी दौर में किसी से भी\nप्यार का सिलसिला अमाँ छोड़ो\n\nदिल से खेलो न जब कहा उस से\nउस ने हँस के कहा अमाँ छोड़ो\n\nजिस का अख़लाक़ ही न बेहतर हो\nवो बशर है भला अमाँ छोड़ो\n\nआप सानी रहो हमेशा ख़ुश\nआप क़िस्सा मेरा अमाँ छोड़ो"
      },
      {
        "id": "ghazal_18",
        "title": "रंज व ग़म और मुसीबत के सिवा",
        "content": "रंज व ग़म और मुसीबत के सिवा\nज़िंदगी क्या है अज़ियत के सिवा\n\nइतने भी ज़ुल्म व सितम ठीक नहीं\nके बचे कुछ न बग़ावत के सिवा\n\nतुम न छेड़ो कभी ग़ैरत को मेरी\nपास कुछ भी नहीं ग़ैरत के सिवा\n\nहम ग़रीबों के घरों में साहब\nऔर क्या रखा है बरकत के सिवा\n\nमिलने जब भी करे दिल आ जाइए\nकुछ बचा ही नहीं फुरसत के सिवा\n\nउस को अपनों की मोहब्बत न मिली\nजिसको कुछ भाए न शोहरत के सिवा\n\nएक दिन मुँह की खाएगा वो\nकुछ नहीं करता जो ग़ीبت के सिवा\n\nहम दीवाने हैं दीवानों को काम\nकुछ नहीं आता है उल्फ़त के सिवा\n\nदौर-ए-हाज़िर के बशर में सानी\nआज सब कुछ तो है ग़ैरत के सिवा"
      },
      {
        "id": "ghazal_19",
        "title": "पागल कोई मजनूँ कोई दीवाना कहे है",
        "content": "पागल कोई मजनूँ कोई दीवाना कहे है\nएक तेरे सिवा कोई भी अच्छा न कहे है\n\nपरबत को अखाड़े है समंदर को समेटे\n“करके भी दिखाए है जो दीवाना कहे है”\n\nऐ दिल तू उसे भूल जा बेहतर यही होगा\nआतिश में यह जलते हुए परवाना कहे है\n\nमैंने तो कभी उस को पराया नहीं जाना\nहाँ वो तो मगर मुझ को ही बेगाना कहे है\n\nतुम ला दो कहीं से तो मेरे यार को ला दो\nकमबख्त यही बात मेरा शाना कहे है\n\nसानी की ग़ज़ल और न महफिल में सुनी जाए\nजब जब भी सुनो अपना ही अफ़साना कहे है"
      },
      {
        "id": "ghazal_20",
        "title": "हौसला मिस्ल-ए-पैंबर रखना",
        "content": "हौसला मिस्ल-ए-पैंबर रखना\nअपने अंदर कई लश्कर रखना\n\nमुस्तनद होने की चाहत है गर\nफिक्र तुम औरों से बेहतर रखना\n\nअब तो मुमकिन ही नहीं लगता है\nअपना किरदार मुनव्वर रखना\n\nएक दिन महँगा पड़ेगा तुझ को\nहक़ ग़रीबों का दबा कर रखना\n\nतेरा किरदार है तेरी पहचान\nयाद यह बात बराबर रखना\n\nतेरा ईमान गहर है सानी\nइस गहर को तू बचा कर रखना"
      },
      {
        "id": "ghazal_21",
        "title": "करके उपकार ज़रा देख ले दुखियारी पर",
        "content": "करके उपकार ज़रा देख ले दुखियारी पर\nदिल को तस्कीन मिला करती है ग़मख्वारी पर\n\nसोचता हूँ कि मैं बस्ती से चला जाऊँ कहीं\nलोग हँसते हैं यहाँ दोस्तों लाचारी पर\n\nलौट कर दुनिया को फनकार समझने वाले\nखुद ही कल रोएगा तो देखना होशियारी पर\n\nवक़्त ने आज कहाँ ला के उसे छोड़ा है\nनाज़ जिस को था कभी दोस्तों फनकारी पर\n\nमेरी हालत पे ज़रा सोच समझ के हँसना\nरश्क करती है यह ग़ुरबत मेरी ख़ुददारी पर\n\nक्या मिलेगा तुझे ऐ सानी वफ़ा पे चल कर\n“अब तो इनाम दिया जाता है ग़द्दारी पर”"
      },
      {
        "id": "ghazal_22",
        "title": "क्या कहूँ उस ने क्या दिया फिर से",
        "content": "क्या कहूँ उस ने क्या दिया फिर से\nमुझ को नश्तर लगा दिया फिर से\n\nमुद्दतों बाद होश आया था\nउस ने जलवा दिखा दिया फिर से\n\nबंद आँखों से मैंने कैनवस पर\nउस का चेहरा बना दिया फिर से\n\nजो उजाला ही अपना खो बैठा\nकैसे कह दूँ भला दिया फिर से\n\nज़िक्र ग़ैरों से उन का सुनते ही\nदिल ने महशर उठा दिया फिर से\n\nज़ख्म मेरा करीद कर सानी\nदर्द उस ने बढ़ा दिया फिर से"
      },
      {
        "id": "ghazal_23",
        "title": "दम अखड़ अखड़ जाए ज़िंदगी बिखर जाए",
        "content": "दम अखड़ अखड़ जाए ज़िंदगी बिखर जाए\nटूट कर जो सीने में दिल कभी बिखर जाए\n\nहै बहुत अंधेरे में आज कल मेरी दुनिया\nतुम जो लौट आओ तो रौशनी बिखर जाए\n\nचैन से यह पागल भी थोड़ी देर सो लेगा\nज़ुल्फ़ काली काली गर आप की बिखर जाए\n\nमौत इतनी मिहलत दे काम यह मैं कर जाऊँ\nग़म स्मेट लूँ सारे और ख़ुशी बिखर जाए\n\nवास्ता है उल्फ़त का आप मुस्करा दें तो\nइस उदास चेहरे पे ताज़गी बिखर जाए\n\nआप को ख़बर भी है रूठने से क्या होगा\nसच कहूँ तो सानी की शायरी बिखर जाए"
      },
      {
        "id": "ghazal_24",
        "title": "उल्फ़त में दिल फरीफ़्ता बनाए हुए तो हैं",
        "content": "उल्फ़त में दिल फरीफ़्ता बनाए हुए तो हैं\nयानी कि ख़ुद का होश उड़ाए हुए तो हैं\n\nगरचे मिले न ख्वाब की ताबीर उम्र भर\nपलकों पे अपने ख्वाब सजाए हुए तो हैं\n\nमाना कि उस को आने की फुरसत नहीं मगर\nहम आस उसकी फिर भी लगाए हुए तो हैं\n\nकुछ और हो तो वो भी ला कर के दे दो तुम\nरंज व अलम का बोझ उठाए हुए तो हैं\n\nबाक़ी कोई भी अब हमें चाहत नहीं रही\nसाँसों में उस की ख़ुशबू बसाए हुए तो हैं\n\nवो है मसीहा मेरा दवा दे कि छोड़ दे\nज़ख्मों को उस को सानी दिखाए हुए तो हैं"
      },
      {
        "id": "ghazal_25",
        "title": "पास आ ऐ मेरे यार थोड़ा सा और",
        "content": "पास आ ऐ मेरे यार थोड़ा सा और\nकर मुझे ख़ुदसे बीज़ार थोड़ा सा और\n\nमैं तुम्हारी गली से चला जाऊँगा\nमुझको करने दो दीदार थोड़ा सा और\n\nज़िंदगी तो फिरेगी कहाँ दर ब दर\nपास आ दूँ तुझे प्यार थोड़ा सा और\n\nकाम हिम्मत से ले ऐ मेरे दिल ज़रा\nरास्ता है यह परखार थोड़ा सा और\n\nतू हर एक सफ़ से बाहर निकल जाएगा\nगर गिरा तेरा किरदार थोड़ा सा और\n\nजल्द ही लौट आऊँगा परदेस से\nसब्र कर मेरे दिलदार थोड़ा सा और\n\nतुझ को भी मिल ही जाएगा कोई खिताब\nतू बढ़ा सानी मेयार थोड़ा सा और"
      },
      {
        "id": "ghazal_26",
        "title": "कितना भूखा है यह ज़माना भी",
        "content": "कितना भूखा है यह ज़माना भी\nखाए चिड़ियों का आब व दाना भी\n\nजिस की उल्फ़त पे नाज़ करते हो\nमशवरा है कि आज़माना भी\n\nमैं तेरे इंतिज़ार में रोया\nजब कि मौसम तो था सुहाना भी\n\nदेख के उन को हँस दिया वरना\nमेरा मुश्किल था मुस्कराना भी\n\nजब मुखालिफ़ हुआ हो ऐ सानी\nहै करामत दिया जलाना भी"
      },
      {
        "id": "ghazal_27",
        "title": "हिज्र में तुम्हारा दिल कैसे यार लगता है",
        "content": "हिज्र में तुम्हारा दिल कैसे यार लगता है\nसाँसों का गुज़रना भी मुझ पे बार लगता है\n\nकल तलक बिछड़ने का डर जिसे सताता था\nवस्ल आज कल उस को ना गुवार लगता है\n\nचोट खाया होता है जो भी शख्स चाहत में\nफूलों का बिछौना भी उस को खार लगता है\n\nतुम को क्या ख़बर है कि मिलती है ख़ुशी कितनी\nजब किसी मुसाफिर का नाव पार लगता है\n\nजब तलक वो रहता है साथ में मेरे यारो\nयह ख़िज़ाँ का मौसम भी ख़ुशगुवार लगता है\n\nलड़खड़ाए फिरता हूँ आज कल जो मैं सानी\nउस की ही मोहब्बत का यह ख़ुमार लगता है"
      },
      {
        "id": "ghazal_28",
        "title": "कहूँ क्या एक तेरी दोस्ती को",
        "content": "कहूँ क्या एक तेरी दोस्ती को\nमोहब्बत थी नहीं मुझ से किसी को\n\nरफ़ाक़त हो गई जब तारीकी से\nदिया ठुकरा रहा है रौशनी को\n\nलहू उनकी भी आँखें रो रहीं आज\nजो आसान कह रहे थे आशिक़ी को\n\nजिसे चाहो उसे पागल बना दो\nमयस्सर यह अदा है आप ही को\n\nमेरे ख्वाबों में आई थी कभी जो\nयह आँखें ढूँढती हैं बस उसी को"
      },
      {
        "id": "ghazal_29",
        "title": "उस को पाना मेरी हसरत ही सही",
        "content": "उस को पाना मेरी हसरत ही सही\nगर यह ग़फ़लत है तो ग़फ़लत ही सही\n\nमैं तो मस्ती में रहूँगा हर दम\nज़िंदगी में हो अज़ियत ही सही\n\nसाथ तेरा है गवारा मुझ को\nदोस्ती तेरी मुसीबत ही सही\n\nएक शहज़ादी से चाहत कर ली\nयह हमाक़त है हमाक़त ही सही\n\nमेरी ग़ुरबत है इनायत तेरी\nतू अगर ख़ुश है तो ग़ुरबत ही सही\n\nकर दे सानी को तू हँस कर रुख़्सत\nचाहे रख दिल में कदूरत ही सही"
      },
      {
        "id": "ghazal_30",
        "title": "यह करिश्मा हुआ आप ही के सबब",
        "content": "यह करिश्मा हुआ आप ही के सबब\nहर ख़ुशी मिल गई दोस्ती के सबब\n\nअक़्ल जाती रही होश जाता रहा\nक्या से क्या हो गए आशिक़ी के सबब\n\nभूक बच्चों की माँ से न देखी गई\nआबरू बीच दी मुफ़लसी के सबब\n\nइस नए दौर में यह तरक़्क़ी हुई\nआदमी मर रहा आदमी के सबब\n\nलोग दुनिया में ऐसे भी मौजूद हैं\nसरखरू हो गए आजिज़ी के सबब\n\nमेरी आँखों ने देखे ऐसे भी घर\nजिन का रुतबा बढ़ा लाडली के सबब\n\nसानी मंज़िल मिलेगी भला किस तरह\nजो हैं भटके हुए रहबरी के सबब"
      },
      {
        "id": "ghazal_31",
        "title": "मर जाना हक़ की ख़ातिर दिल से क़ुबूल है",
        "content": "मर जाना हक़ की ख़ातिर दिल से क़ुबूल है\nमेरे क़बीले का यह पुराना उसूल है\n\nउन के जमाल-ए-हुस्न को सोचो तो गौर से\nउल्फ़त न हो गई तो ग़ुलामी क़ुबूल है\n\nतुम से सवाल है मेरा तुम ही जवाब दो\nवो कैसे मुस्कराए जो ग़म से मलूल है\n\nइस बार भी न आएगा मालूम है ऐ दिल\nयों इंतिज़ार करना तुम्हारा फ़ुज़ूल है\n\nइस दिल का क्या मज़ाल कि उस को भुला दे यह\nइस दिल के गोशे गोशे में यादों की धूल है"
      },
      {
        "id": "ghazal_32",
        "title": "पुर सुकून गाँव नगर थे पुर सुकून बाज़ार था",
        "content": "पुर सुकून गाँव नगर थे पुर सुकून बाज़ार था\nजब तलक अल्लाह वाला मुल्क का सरदार था\n\nज़िंदगानी के सफ़र में ग़म का एक कोहसार था\nजब तलक हम को तुम्हारे प्यार से इनकार था\n\nठोकरों में थे हमारे दुनिया के सब तख़्त व ताज\nज़िक्र-ए-रब से दिल हमारा जब तलक सरशार था\n\nऐ अमीर-ए-शहर तुझ को देना होगा अब हिसाब\nफिर क्यों वो मारा गया जो आदमी ख़ुददार था\n\nजंग कैसे जीती हम ने दुनिया को हैरानी है\nहाथ में खंजर न कोई साथ में सालार था\n\nहर घड़ी भरता हूँ दम में इस लिए असलाफ़ का\nसाफ़ सुथरे लोग थे वो मुस्तनद किरदार था\n\nकैसे करता सानी उस के प्यार से इनकार मैं\nदिल नशीं उस की अदा थी आँखों में इसरार था"
      },
      {
        "id": "ghazal_33",
        "title": "उन का ही इतबार करते रहे",
        "content": "उन का ही इतबार करते रहे\nजो हमें बे क़रार करते रहे\n\nअपनी दुनिया ख़राब होती रही\n“ज़िक्र-ए-फ़स्ल-ए-बहार करते रहे”\n\nएक मुद्दत से वो नहीं आए\nहम मगर इंतिज़ार करते रहे\n\nउसी ख़ाना ख़राब की ख़ातिर\nरोज़ दरिया को पार करते रहे\n\nउस की गलियों में आने जाने की\nभूल हम बार बार करते रहे\n\nमहनती लोग बन गए सूरज\nहम सितारे शुमार करते रहे"
      },
      {
        "id": "ghazal_34",
        "title": "मुझे फ़र्क़ कुछ नहीं पड़ता है, चाहिए मुझ से कोई ख़फ़ा रहे",
        "content": "मुझे फ़र्क़ कुछ नहीं पड़ता है, चाहिए मुझ से कोई ख़फ़ा रहे\nमेरे साथ कोई रहे न रहे, मेरे साथ मेरा खुदा रहे\n\nमेरे दर्द का न मलाल कर, मेरे पास आ मेरी बात सुन\nमेरे सामने ज़रा बैठ तो, ताकि ग़म से दिल यह रहा रहे\n\nमरा आख़िरी तो सलाम ले मरा आख़िरी तो कलाम सुन\nयह दुआ है तेरे हबीब की तेरा ग़म से रिश्ता कटा रहे\n\nयह जहान सारा तमाशा घर यह तमाशा देखना है मगर\nतुझे जाना है ऐ बशर कहाँ, तुझे याद यह भी सदा रहे\n\nमैं दीवाना इश्क़ का हूँ मियाँ, मुझे डर नहीं किसी रोग का\nहै यह इश्क़ गर कोई रोग तो, मुझे रोग फिर यह लगा रहे"
      },
      {
        "id": "ghazal_35",
        "title": "तेरी नफ़रत को भी मैंने कब नफ़रत से देखा है",
        "content": "तेरी नफ़रत को भी मैंने कब नफ़रत से देखा है\nजब भी देखा तुझ को दिलबर बस चाहत से देखा है\n\nहम दोनों की एक कहानी, एक सी अपनी हालत है\nएक दूजे को जब जब देखा, बस हैरत से देखा है\n\nयह तो मेरा रब जाने है या फिर जाने दिल मेरा\nअरमानों को जलते मैंने किस शिद्दत से देखा है\n\nमेरे शाने पे उस का सर घंटों घंटों रहता था\nउन आँखों ने ऐसा मंज़र भी क़िस्मत से देखा है\n\nअब तो वो कतराने लगा है सानी मुँह दिखलाने से\nजिस ने मुझ को एक ज़माने तक फुरसत से देखा है"
      },
      {
        "id": "ghazal_36",
        "title": "तुम से वादा है इस दीवाने का",
        "content": "तुम से वादा है इस दीवाने का\nसर झुका देगा यह ज़माने का\n\nकोई रास्ता ज़रूर निकलेगा\nहौसला कीजिए तो आने का\n\nमाना कि दोस्त दोस्त होता है\nज़ख्म लेकिन नहीं दिखाने का\n\nहाल-ए-दिल बे वफ़ा घमंडी को\nफ़ायदा कुछ नहीं सुनाने का\n\nतुम को अब कौन रोक पाएगा\nतुम ने तय कर लिया है जाने का\n\nदरिया-ए-इश्क़ में न उतरे वो\nजिस को ख़दशा हो डूब जाने का\n\nइश्क़ कीजिए मगर यह याद रहे\nफिदया लगता है मुस्कराने का\n\nतेरे कूचे में दोस्ती कर ली\nयह बहाना है आने जाने का\n\nआज वो भी तो है निशाने पर\nशौक़ जिस को था आज़माने का\n\nतेरे बीमार की गुज़ारिश है\nतर्क कर दे इरादा जाने का"
      },
      {
        "id": "ghazal_37",
        "title": "गुज़रा है कैसा सानिहा दिल ख़ूब जाने है",
        "content": "गुज़रा है कैसा सानिहा दिल ख़ूब जाने है\nक्या है सितम का माजरा दिल ख़ूब जाने है\n\nहोने न देंगे आप की तौहीन जीते जी\nकिस की खता है आप का दिल ख़ूब जाने है\n\nबस आप लुत्फ़ लीजिए भरपूर वस्ल का\nदुश्वार कितना रास्ता था दिल ख़ूब जाने है\n\nमंज़िल पे आ के क्यों न मैं शुक्र-ए-खुदा करूँ\nथा कौन रोड़ा रास्ते का दिल ख़ूब जाने है\n\nमहफ़ूज़ मेरे पास है तोहफ़ा हर एक का\nकिस ने है मुझ को क्या दिया दिल ख़ूब जाने है\n\nसानी कभी भी आप शिकायत न कीजिए\nक्या है वफ़ा का ज़ाब्ता दिल ख़ूब जाने है"
      },
      {
        "id": "ghazal_38",
        "title": "सहमी हुई है आज फ़ज़ा घट रहा है दम",
        "content": "सहमी हुई है आज फ़ज़ा घट रहा है दम\nज़हरीली हो गई है हवा घट रहा है दम\n\nसारे जहाँ में बरपा क़यामत सी हो गई\nआई है कैसी यार वबा घट रहा है दम\n\nजो भी है बात आ के सुना तो वो रोबरू\nख़ामोशियों पे तेरी मेरा घट रहा है दम\n\nदुनिया के कहने पे कभी होता न था मलाल\nतुम ने कहा है जब से बुरा घट रहा है दम\n\nमेरे हबीब तुझ को मोहब्बत का वास्ता\nमेरे भी हक़ में कर दे दुआ घट रहा है दम"
      },
      {
        "id": "ghazal_39",
        "title": "जफ़ा तो कर या वफ़ा अब तो तेरी मर्ज़ी है",
        "content": "जफ़ा तो कर या वफ़ा अब तो तेरी मर्ज़ी है\nबुरा समझ या भला अब तो तेरी मर्ज़ी है\n\nहवा के सामने हम ने तो रख दिया मौला\nदिया जला या बुझा अब तो तेरी मर्ज़ी है\n\nइज़हार-ए-इश्क़ मेरा तुझ से करना जर्म सही\nरिहाई दे या सजा अब तो तेरी मर्ज़ी है\n\nमैं तेरे वास्ते अपनों को छोड़ आया हूँ\nगले लगा न लगा अब तो तेरी मर्ज़ी है\n\nतुम्हारे सामने सर खम तुम्हारा मुजरिम है\nमआफ़ी दे या सजा अब तो तेरी मर्ज़ी है"
      },
      {
        "id": "ghazal_40",
        "title": "राह पर दुश्मनों की वो चलने लगे",
        "content": "राह पर दुश्मनों की वो चलने लगे\nदोस्त मेरे सभी अब बदलने लगे\n\nरहनमाओं ने मुझ को है गुमराह किया\nपाँव मंज़िल की जानब जो चलने लगे\n\nअब मुहाफ़िज़ चमन का मियाँ कौन है\nख़ुद ही माली गुलों को मसलने लगे\n\nमेरे होंटों पे कलमा-ए-तौहीद हो\nया खुदा जब मेरा दम निकलने लगे\n\nउम्र भर में जिन्हें दोस्त कहता रहा\nमेरी शोहरत से सानी वो जलने लगे"
      },
      {
        "id": "ghazal_40",
        "title": "राह पर दुश्मनों की वो चलने लगे",
        "content": "राह पर दुश्मनों की वो चलने लगे\nदोस्त मेरे सभी अब बदलने लगे\n\nरहनमाओं ने मुझ को है गुमराह किया\nपाँव मंज़िल की जानब जो चलने लगे\n\nअब मुहाफ़िज़ चमन का मियाँ कौन है\nख़ुद ही माली गुलों को मसलने लगे\n\nमेरे होंटों पे कलमा-ए-तौहीद हो\nया ख़ुदा जब मेरा दम निकलने लगे\n\nउम्र भर में जिन्हें दोस्त कहता रहा\nमेरी शोहरत से सानी वो जलने लगे"
      },
      {
        "id": "ghazal_41",
        "title": "तेरी आँखों में जो काजल नहीं है",
        "content": "तेरी आँखों में जो काजल नहीं है\nफलक पे दूर तक बादल नहीं है\n\nवफ़ा का एक हामी मैं यहाँ हूँ\nमेरे जैसा कोई पागल नहीं है\n\nअगर पत्थर नहीं तो फिर वो क्या है\nदया का जिस में गंगा जल नहीं है\n\nयहाँ तो क़त्ल होता है बराबर\nमगर देखो यहाँ मक़तल नहीं है\n\nकिसी के हिज्र ने ख़ामोश किया है\nमेरी दुनिया में अब हलचल नहीं है\n\nतुझे कैसे बताऊँ कि तेरे बिन\nमुझे आराम पल दो पल नहीं है\n\nवफ़ा का मसअला ऐसा है सानी\nसही पूछो तो कोई हल नहीं है"
      },
      {
        "id": "ghazal_42",
        "title": "अब रिहाई या ज़मानत हो न हो",
        "content": "अब रिहाई या ज़मानत हो न हो\nइश्क़ तो है हम को राहत हो न हो\n\nजो अभी है ऐसी सूरत हो न हो\nकल मुझे भी तेरी चाहत हो न हो\n\nएक तेरी बस इनायत काफ़ी है\nअब किसी की भी इनायत हो न हो\n\nआप की मुझे ज़रूरत है बहुत\nआप को मेरी ज़रूरत हो न हो\n\nआ गया हूँ इश्क़ के बाज़ार में\nफ़ायदे की ये तिजारत हो न हो\n\nआँख भर कर देख लेने दो उसे\nक्या पता फिर से ज़ियारत हो न हो\n\nआओ बैठें मिल के सानी आज हम\nकल मयस्सर वक़्त-ए-फुरसत हो न हो"
      },
      {
        "id": "ghazal_43",
        "title": "उसकी यादों के मैं लश्कर से घिरा रहता हूँ",
        "content": "उसकी यादों के मैं लश्कर से घिरा रहता हूँ\nपर कटा एक परिंदा सा पड़ा रहता हूँ\n\nमुद्दतों बाद भी आई न उन्हें याद मेरी\nजिन की ख़ातिर मैं यहाँ बुत सा बना रहता हूँ\n\nइतनी आसानी से पहचान नहीं मिट सकती\nमैं जहाँ रहता हूँ इंसान बना रहता हूँ\n\nक्यों ज़माने की कही बातों में आ जाते हो\nमैं किसी से भी नहीं यार ख़फ़ा रहता हूँ\n\nजिस के दिल में न हो एहसास-ए-मोहब्बत सानी\nऐसे लोगों से बहुत दूर सदा रहता हूँ"
      },
      {
        "id": "ghazal_44",
        "title": "एक नज़र देख लो आ कर तुम हो",
        "content": "एक नज़र देख लो आ कर तुम हो\nमेरी साँसों में बराबर तुम हो\n\nजी में आया कि अभी मर जाऊँ\nउस ने जब बोला कि लोफर तुम हो\n\nतुम को एहसास नहीं तुम क्या हो\nमेरी हिम्मत मेरा तेवर तुम हो\n\nकोई माने कि न माने सच है\nचलता फिरता हुआ खंजर तुम हो\n\nचाँद निकला है ये सब कहते हैं\nमुझ को मालूम है छत पर तुम हो"
      },
      {
        "id": "ghazal_45",
        "title": "कोई शिकवा नहीं ज़माने से",
        "content": "कोई शिकवा नहीं ज़माने से\nदिल तो टूटा है दिल लगाने से\n\nजब मेरा दम निकल ही जाएगा\nफ़ायदा होगा फिर क्या आने से\n\nतू कहीं ख़ुद न रुसवा हो जाए\nबाज़ आ भी जा आज़माने से\n\nकैसे तेरे बग़ैर ज़िंदा हूँ\nदेखने आ किसी बहाने से\n\nदूर कैसा ये आ गया सानी\nलोग डरते हैं मुस्कराने से"
      },
      {
        "id": "ghazal_46",
        "title": "काम ऐसा महान कर बैठा",
        "content": "काम ऐसा महान कर बैठा\nअपनी आँखें वो दान कर बैठा\n\nइतनी ऊँची उड़ान कर बैठा\nख़ुद ही आफ़त में जान कर बैठा\n\nभाव गल्ले का अब बढ़ाया यारो\nख़ुदकुशी जब किसान कर बैठा\n\nज़ख़्म देता रहा वही मुझ को\nजिस को अपना मैं जान कर बैठा\n\nदौर-ए-हाज़िर में हक़ का पैकर भी\nख़ुद को अब बे ज़बान कर बैठा\n\nइस दीवाने पे कुछ नहीं साहब\nएक दिल था वो दान कर बैठा\n\nवो आयदत को आएँगे सानी\nमैं ये कैसा गुमान कर बैठा"
      },
      {
        "id": "ghazal_47",
        "title": "किसी से दिल को लगाने की क्या ज़रूरत थी",
        "content": "किसी से दिल को लगाने की क्या ज़रूरत थी\nबे वजह अश्क बहाने की क्या ज़रूरत थी\n\nतुम्हें थी हम से मोहब्बत तो साफ़ कह देते\nघुमा फिरा के बताने की क्या ज़रूरत थी\n\nदियार-ए-इश्क़ में जब शौक़ ना था मरने का\nदियार-ए-इश्क़ में आने की क्या ज़रूरत थी\n\nख़ता हमारी थी हम को ही बस सजा देते\nहमारी बस्ती जलाने की क्या ज़रूरत थी\n\nअगर इरादा था सानी को छोड़ जाने का\nतो इतने पास भी आने की क्या ज़रूरत थी"
      },
      {
        "id": "ghazal_48",
        "title": "आप से क्या जुदा हुआ है दिल",
        "content": "आप से क्या जुदा हुआ है दिल\nसारी दुनिया से ही ख़फ़ा है दिल\n\nजिस किसी ने भी उन को देखा है\nउन पे अपना लुटा गया है दिल\n\nइश्क़ में क्या बुरा है क्या अच्छा\nइश्क़ में कब ये सोचता है दिल\n\nभूल जा उन को और ख़ुश रह तू\nतुझ से मेरा ये मशवरा है दिल\n\nउन से मिलना गिराँ गुज़रता है\nउन से मेरा बहुत दुखा है दिल\n\nउन को एहसास-ए-ग़म नहीं तेरा\nजिन की ख़ातिर तू जल रहा है दिल\n\nकैसे तोड़ेगा अब कोई सानी\nमैंने पत्थर सा कर लिया है दिल"
      },
      {
        "id": "ghazal_49",
        "title": "यार हँसने हँसाने का माहौल हो",
        "content": "यार हँसने हँसाने का माहौल हो\nकुछ तो ग़म को भुलाने का माहौल हो\n\nदिल तड़पते थे औरों का ग़म देख कर\nआज फिर उस ज़माने का माहौल हो\n\nहम तो जन्नत समझते हैं अक्सर उसे\nख़ुश नुमा जिस घराने का माहौल हो\n\nएक पल भी ठहरता नहीं मैं वहाँ\nजिस जगह दिल दुखाने का माहौल हो\n\nइश्क़, चाहत, मोहब्बत, वफ़ा, दोस्ती\nइन को दिल से निभाने का माहौल हो\n\nसानी रो रो के करता है दिल से दुआ\nख़ुश नुमा इस ज़माने का माहौल हो"
      },
      {
        "id": "ghazal_50",
        "title": "आप जब तोड़ोगे अपनी ख़ामोशी का सिलसिला",
        "content": "आप जब तोड़ोगे अपनी ख़ामोशी का सिलसिला\nमुस्कुरा उठेगा फिर से दोस्ती का सिलसिला\n\nपूछ लो चाहे किसी से सब को है मालूम ये\nतुम से वाबस्ता है मेरी हर ख़ुशी का सिलसिला\n\nफ़ायदा तेरा हुआ ना फ़ायदा मेरा हुआ\nआओ मिल कर ख़त्म कर दें दुश्मनी का सिलसिला\n\nएक नज़र जो देखा उस को फिर न पूछो क्या हुआ\nजड़ गया है ज़िंदगी से आशिक़ी का सिलसिला\n\nदिल फटा जाता है अब तो सानी का शाम व सहर\nअब ख़ुदारा तोड़ दीजिए रुख़ी का सिलसिला"
      },
      {
        "id": "ghazal_51",
        "title": "मैं हूँ मीठा सा एक समंदर देख",
        "content": "मैं हूँ मीठा सा एक समंदर देख\nमेरे अंदर उतर के दिलबर देख\n\nउस की आँखों ने ये कहा मुझ से\nहै इजाज़त तुझे मुकर्रर देख\n\nहिज्र में तेरे इस दीवाने का\nहाल कितना बुरा है आ कर देख\n\nमाँग लेना फलक से तारे भी\nपहले अपनी तो यार चादर देख\n\nग़म लिए किस तरह से ज़िंदा हूँ\nएक दिन मेरे साथ जी कर देख"
      },
      {
        "id": "ghazal_52",
        "title": "वफ़ा व प्यार की बातें",
        "content": "वफ़ा व प्यार की बातें\nहैं अब बे कार की बातें\n\nज़माना अब नहीं सुनता\nमियाँ ख़ुद्दार की बातें\n\nतरक़्क़ी चाहिए फिर तो\nसुनो दरबार की बातें\n\nअकेले रोज़ सुनता हूँ\nदर ओ दीवार की बातें\n\nपुरानी हो गईं हैं अब\nलब ओ रुख़सार की बातें\n\nकिसी बेवा से मत करना\nकभी सिंगार की बातें\n\nसलीक़े से सुनाती हैं\nपरी कोहसार की बातें\n\nजो अच्छा है वो क्यों समझे\nकिसी बीमार की बातें\n\nडराती है बहुत सानी\nमुझे होशियार की बातें"
      },
      {
        "id": "ghazal_53",
        "title": "ले तो सारी की सारी दुनिया रख",
        "content": "ले तो सारी की सारी दुनिया रख\nमेरी आँखों में मेरा सपना रख\n\nख़ुद को अब तू महव-ए-तमाशा रख\nअपने लब पर लगा के ताला रख\n\nतू यहाँ पर सभी से रिश्ता रख\nअपने दिल को बना के दरिया रख\n\nजिस के मन में जो आया लिख डाला\nकिस ने बोला था दिल को सादा रख\n\nहै तक़ाज़ा यही जुदाई का\nअपनी यादों में उस को ज़िंदा रख\n\nकोई सुनता नहीं किसी की अब\nपास अपने तो अपना दुखड़ा रख\n\nतेरी दुनिया उजड़ भी सकती है\nअपने क़ाबू में अपना गुस्सा रख\n\nख़ुद ज़माना गले लगाएगा\nदिल से तू दूर बग़्ज़ व कीना रख\n\nकामयाबी क़दम को चूमेगी\nहौसला बरक़रार अपना रख\n\nसूरत-ए-हाल कुछ भी हो सानी\nअपने लब पर सदा तो कलमा रख"
      },
      {
        "id": "ghazal_54",
        "title": "तन्हा तन्हा चलना होगा कब तक आख़िर हम को और",
        "content": "तन्हा तन्हा चलना होगा कब तक आख़िर हम को और\nइश्क़ की आग में जलना होगा कब तक आख़िर हम को और\n\nतुम्हें निकालो रास्ता कोई बात मिलन तक आपहुँचे\nदूर से हाथ को मलना होगा कब तक आख़िर हम को और\n\nहरदम हरपल हर लम्हा सोचता रहता है साइल\nग़ैर के दर से पलना होगा कब तक आख़िर हम को और\n\nअब तो करम कर अपना बना ले दे दे प्यार की भीख हमें\nतेरे दर से टलना होगा कब तक आख़िर हम को और\n\nभूल गए वो हम को या फिर दूर बसा ली बस्ती है\nइस सदमे में घुलना होगा कब तक आख़िर हम को और"
      },
      {
        "id": "ghazal_55",
        "title": "कहीं पे फूल कहीं दिल बिछा दिया मैंने",
        "content": "कहीं पे फूल कहीं दिल बिछा दिया मैंने\nवो आ रहे हैं यूँ रास्ता सजा दिया मैंने\n\nबस अब तो देखना ये है कि फ़ैसला क्या हो\nजो मेरे दिल में था वो सब सुना दिया मैंने\n\nमेरी ये सादगी देखो जो मेरा क़ातिल है\nउसे तो अपने ही घर का पता दिया मैंने\n\nवो मेरी राह में काँटे बिछा रहा है अब\nवो जिस को दोस्तों चलना सिखा दिया मैंने\n\nये बात और है मुझ को वो याद आता है\nये बात सच है कि दिल से भुला दिया मैंने"
      },
      {
        "id": "ghazal_56",
        "title": "ज़िंदगानी थी मेरी बस वही ज़िंदगानी",
        "content": "ज़िंदगानी थी मेरी बस वही ज़िंदगानी\nमाँ के साये तले जो कटी ज़िंदगानी\n\nए अंधेरे मुझे तो डराएगा क्या\nहादिसों में मेरी तो पली ज़िंदगानी\n\nये मोहब्बत उजब शे है यारो यहाँ\nजिस को भी मिल गई है मिली ज़िंदगानी\n\nज़िंदगानी भर अना बीच सकता नहीं\nमुफ़लसी छीन चाहे मेरी ज़िंदगानी\n\nहम ने सीखा था दिल बहल जाएगा\nसानी अब बन गई शायरी ज़िंदगानी"
      },
      {
        "id": "ghazal_57",
        "title": "सामने बस मेरे आइना रह गया",
        "content": "सामने बस मेरे आइना रह गया\nखो गईं मंज़िलें रास्ता रह गया\n\nइस ज़माने में अब अपना किस को कहूँ\nमुतलबी बस यहाँ वास्ता रह गया\n\nकिस तरफ़ जाऊँ मैं आज हैरान हूँ\nहर तरफ़ हादिसा हादिसा रह गया\n\nमेरे जीने की माँगी है क्यों कर दुआ\nअब सितम आप का कौन सा रह गया\n\nछोड़ कर चल दिए दोस्त सानी सभी\nसाथ मेरे मेरा हौसला रह गया"
      },
      {
        "id": "ghazal_58",
        "title": "मुझ को वो क्या मिले ज़िंदगानी मिल गई",
        "content": "मुझ को वो क्या मिले ज़िंदगानी मिल गई\nमेरे होंटों को यारो हँसी मिल गई\n\nअब से पहले भटकता रहा दर ब दर\nसाथ जब तुम चले रहबरी मिल गई\n\nये मेरी ज़िंदगानी अंधेरों में थी\nतेरा साथ जब मिला रौशनी मिल गई\n\nमैं ग़मों के जहाँ से निकल आया हूँ\nतो ने की जब वफ़ा हर ख़ुशी मिल गई\n\nये मेरी साँसें थमने लगीं थीं मगर\nतुम को देखा तो फिर ज़िंदगानी मिल गई"
      },
      {
        "id": "ghazal_59",
        "title": "कर लिया तुम ने इरादा ये कभी सोचा भी है",
        "content": "कर लिया तुम ने इरादा ये कभी सोचा भी है\nइस मोहब्बत के सफ़र में दूर तक सहरा भी है\n\nबदतमीज़ी कर रहे हो तुम अभी जिस शख्स से\nजान ले लेगा तुम्हारी उस का एक बेटा भी है\n\nक्या कहूँ मैं आज क्या है इश्क़ का रुतबा यहाँ\nये जहाँ है इश्क़ से पर इश्क़ पे पहरा भी है\n\nहम करें फरियाद क्यों जब होने वाला कुछ नहीं\nजो हमारा हाकिमराँ है गूँगा है बहरा भी है\n\nतुम बलंदी पे पहुँच के यूँ न इतराया करो\nअर्श से गिरते को मैंने फ़र्श पर देखा भी है\n\nइस सखी से मिल के मेरा दिल बहुत ही ख़ुश हुआ\nशुक्र है मौला का कोई तो है जो अच्छा भी है"
      },
      {
        "id": "ghazal_60",
        "title": "वो जिस ने देखा हो बस रौशनी को",
        "content": "वो जिस ने देखा हो बस रौशनी को\nवो क्या जाने किसी की तीरगी को\n\nकोई इल्ज़ाम क्यों दूँ मैं किसी को\nउदासी भा गई है ज़िंदगानी को\n\nरफ़ाक़त हो गई जब तारीकी से\nदिया ठुकरा रहा है रौशनी को\n\nलहू उनकी भी आँखें रो रही हैं\nजो आसान कह रहे थे आशिक़ी को\n\nजिसे चाहो उसे पागल बना दो\nमयस्सर ये अदा है आप ही को\n\nमेरे ख्वाबों में आई थी कभी जो\nये आँखें ढूँढती हैं बस उसी को\n\nहमारे वास्ते जुगनू बहुत हैं\nतुम अपने पास रखो चाँदनी को"
      },
      {
        "id": "ghazal_61",
        "title": "सदाए हक़ दबा देगा अबे जा",
        "content": "सदाए हक़ दबा देगा अबे जा\nमुझे सूली चढ़ा देगा अबे जा\n\nमुझे इन आर सी का डर दिखा कर\nमेरी नींदें उड़ा देगा अबे जा\n\nवतन ये जाँ से भी प्यारा है हम को\nयहाँ से तो भगा देगा अबे जा\n\nहमारे दिल में है भारत का नक़्शा\nइसे कैसे मिटा देगा अबे जा\n\nहैं भाई भाई हम हिंदू मुसलमाँ\nतो आपस में लड़ा देगा अबे जा\n\nतेरा सपना ये सपना ही रहेगा\nहमें और तो मिटा देगा अबे जा\n\nहमारी शान है अव्वल ही रहना\nहमें सानी बना देगा अबे जा"
      },
      {
        "id": "ghazal_62",
        "title": "जागना और जगाते रहना",
        "content": "जागना और जगाते रहना\nराह भूले को दिखाते रहना\n\nउन का दरवाज़ा खुलेगा एक दिन\nहाज़िरी रोज़ लगाते रहना\n\nकाम आसान नहीं है लेकिन\nरस्म-ए-उल्फ़त को निभाते रहना\n\nआप को महँगा भी पड़ सकता है\nदिल किसी का यूँ दुखाते रहना\n\nअदल व इंसाफ़ की ख़ातिर सानी\nआप तलवार उठाते रहना"
      },
      {
        "id": "ghazal_63",
        "title": "कू बकू यूँ जो भटकता हूँ मैं हरदम हरपल",
        "content": "कू बकू यूँ जो भटकता हूँ मैं हरदम हरपल\nउस की ख़ातिर ही तड़पता हूँ मैं हरदम हरपल\n\nहिज्र के तीर ने ऐसा किया ज़ख़्मी दिल को\nअपने अंदर ही सिसकता हूँ मैं हरदम हरपल\n\nकल मेरी याद में आँसू भी बहाएगा वो\nआज कल जिस को खटकता हूँ मैं हरपल हरदम\n\nअपने पैरों पे खड़ा हो के रहूँगा एक दिन\nइन दिनों गिर के संभलता हूँ मैं हरदम हरपल\n\nजानता हूँ मैं उसे पा नहीं सकता सानी\nफिर भी पाने को मचलता हूँ मैं हरदम हरपल"
      },
      {
        "id": "ghazal_64",
        "title": "तू है क़रीब मेरे और जुस्तजू करें क्या",
        "content": "तू है क़रीब मेरे और जुस्तजू करें क्या\nतेरे सिवा किसी से भी गुफ़्तगू करें क्या\n\nतूने हमें तो रुसवा महफ़िल में कर दिया है\nतेरी शिकायतें हम भी रूबरू करें क्या\n\nफुट पाथ पर कोई कल रो रो के कह रहा था\nलोगो बदल गया है अपना लहू करें क्या\n\nचारागरों की मेरे, फ़ितरत अजीब सी है\nनश्तर लगाएँ और फिर, पूछें रफ़ू करें क्या\n\nघर से निकलना सानी, दुश्वार हो गया है\nबैठा क़दम क़दम पे, अपना अदू करें क्या"
      },
      {
        "id": "ghazal_65",
        "title": "कैसे बयाँ करूँ मैं कि क्या क्या नज़र में है",
        "content": "कैसे बयाँ करूँ मैं कि क्या क्या नज़र में है\nउस का हसीं जलवा मेरे चश्म-ए-तर में है\n\nआसार मेरे दोस्त क़यामत के तो नहीं\nअख़लाक़ के अलावा तो सब कुछ बशर में है\n\nबरसों रहा हूँ चाँद में उस की नज़र का यार\nदो चार दिन से वो जो तुम्हारी नज़र में है\n\nउस का ख़याल दिल से निकाला न जाएगा\nवो फ़िक्र व फ़न में और मेरी रहगुज़र में है\n\nअसार उस के रोने के गर्चे नहीं तो फिर\nसानी नमी सी किस लिए दीवार व दर में है"
      },
      {
        "id": "ghazal_66",
        "title": "ज़िंदगानी की डगर अच्छी नहीं",
        "content": "ज़िंदगानी की डगर अच्छी नहीं\nअब यहाँ शाम व सहर अच्छी नहीं\n\nटूट जाए दिल किसी का ए मियाँ\nबदगुमानी इस क़दर अच्छी नहीं\n\nलुट गई इस्मत किसी मासूम की\nये ख़बर है पर ख़बर अच्छी नहीं\n\nबिन तुम्हारे सच कहूँ कैसी रही\nचाँदनी शब थी मगर अच्छी नहीं\n\nरूठ कर जब से गए हैं वो अधर\nअब हवा चलती अधर अच्छी नहीं\n\nकह रही थी एक परी माँ बाप से\nक्यों जहाँ की अब नज़र अच्छी नहीं\n\nतोड़ देना दोस्ती सानी मगर\nएक ज़रा सी बात पर अच्छी नहीं"
      },
      {
        "id": "ghazal_67",
        "title": "अदू की भीड़ देखो न अदू का क़ाफ़िला देखो",
        "content": "अदू की भीड़ देखो न अदू का क़ाफ़िला देखो\nतुम्हारे हौसलों पे मुनहसिर है मआरिका देखो\n\nकिसी के साथ भी तुम से ना इंसाफ़ी नहीं होगी\nउमर फ़ारूक़ जैसा तुम जो कर के फ़ैसला देखो\n\nये तुम से कह दिया किस ने कि तुम कुछ कर नहीं सकते\nलगा दो जान की बाज़ी फिर अपना मर्तबा देखो\n\nनज़र आने लगेगी दुश्मनों में ख़ूबियाँ तुम को\nतुम अपनी सोच का पहले बदल कर ज़ाविया देखो\n\nबचा लाया हूँ किश्ती को मैं तूफ़ाँ से भी ए सानी\nमेरी हिम्मत, मेरी जुर्रत, मेरा तुम हौसला देखो"
      },
      {
        "id": "ghazal_68",
        "title": "जो दानिशमंद होते हैं कभी ऐसा नहीं करते",
        "content": "जो दानिशमंद होते हैं कभी ऐसा नहीं करते\nख़याल-ए-दिल सभी के सामने रखा नहीं करते\n\nमिले जज़्बे वरासत में मुसाइब से भी लड़ने के\nकभी हम मुश्किलों से यार घबराया नहीं करते\n\nमेरे बिगड़े हुए हालात पे कहने लगे अहबाब\nकिसी को इस क़दर भी टूट कर चाहा नहीं करते\n\nहमारी शान व शौकत का सबब है ये ज़माने में\nसिवा अल्लाह के औरों से हम माँगा नहीं करते\n\nहमारे घर में फ़ाक़ा हो कि चाहे तंगदस्ती हो\nख़ुदा का शुक्र है ईमाँ को हम बेचा नहीं करते\n\nसलीक़ा ही नहीं आता हमें जीने का ए सानी\nअगर माँ बाप बचपन में हमें डाँटा नहीं करते"
      },
      {
        "id": "ghazal_69",
        "title": "याद उन की दिला के आख़िर कार",
        "content": "याद उन की दिला के आख़िर कार\nक्या मिला दिल दुखा के आख़िर कार\n\nहम तो बरबाद हो गए साहब\nशहर-ए-उल्फ़त में आ के आख़िर कार\n\nतुम को जाना ही था चले जाते\nक्यों गए दिल जला के आख़िर कार\n\nकर दिया शर्मसार दुश्मन को\nमुझ को अपना बना के आख़िर कार\n\nख़ुद को बदनाम कर ही डाला ना\nराज़ अपना सुना के आख़िर कार\n\nकब तलक दिल को सानी बहलाए\nउस की फोटो दिखा के आख़िर कार"
      },
      {
        "id": "ghazal_70",
        "title": "वो जो कहे वही करें ऐसे नहीं हैं हम",
        "content": "वो जो कहे वही करें ऐसे नहीं हैं हम\nदीवानगी में इतने भी बहके नहीं हैं हम\n\nजी भर के आज जश्न मनाले तू फ़तह का\nमैदान में तेरे सामने उतरे नहीं हैं हम\n\nतारीख़ है गवाह हमारे उसूल की\nबस्ती कभी भी कोई जलाए नहीं हैं हम\n\nमहफ़ूज़ हम को देख के हैरतज़दा है तू\nहालात के सितम से जो टूटे नहीं हैं हम\n\nउस ने तो ख़ूब चाहा कि मिट जाएँ हम मगर\nरब का है ये करिश्मा के मिटते नहीं हैं हम\n\nमाला हमारे नाम का जपता था जो कभी\nउस की नज़र में इन दिनों अच्छे नहीं हैं हम\n\nरह जाए बस भरम यही तेरे गुमान का\nसानी है सच तो ये कि फ़रिश्ते नहीं हैं हम"
      },
      {
        "id": "ghazal_71",
        "title": "बुज़ुर्गों के जो क़दमों में कभी बैठा नहीं होगा",
        "content": "बुज़ुर्गों के जो क़दमों में कभी बैठा नहीं होगा\nकिसी भी तौर से वो शख्स तो आला नहीं होगा\n\nतुझे रुसवा मैं कर दूँगा तिरी चौखट पे ख़ुद मर के\nमसीहा गर मदावा मेरे ज़ख़्मों का नहीं होगा\n\nकिसी भूके सवाली को जो वो फटकार देता है\nमुझे लगता है शायद उस का दिल ज़िंदा नहीं होगा\n\nतिलावत जो कोई करता रहेगा सूरह-ए-बक़रह की\nये दावा है कि उस के हाथ में कासा नहीं होगा\n\nजहाँ अजदाद रहते थे जगह वो ढूँढ सकता हूँ\nअगर चौपाल का बूढ़ा शजर काटा नहीं होगा\n\nतुम्हें एहसास कब होगा शजर को काटने वाले\nशजर कटते रहे यूँ ही तो फिर साया नहीं होगा\n\nसियासी जो है उन से तुम ए सानी फ़ासला रखना\nसगा मेरा नहीं है ये सगा तेरा नहीं होगा"
      },
      {
        "id": "ghazal_72",
        "title": "दिल से जब अपने बुज़ुर्गों की दुआ पाओगे",
        "content": "दिल से जब अपने बुज़ुर्गों की दुआ पाओगे\nअपनी दुनिया से हर एक ग़म को जुदा पाओगे\n\nदावा करते हो ये जो मुझ से मोहब्बत का तुम\nक्या मेरी राहों के काँटों को हटा पाओगे\n\nहा हमी रब्त तुम्हारा रहा मज़बूत अगर\nएक छोड़ो कई लश्कर को हरा पाओगे\n\nमेरी चाहत, मेरी उल्फ़त मेरी क़ुर्बानी तुम\nभूलना चाहो गे फिर भी न भुला पाओगे\n\nअज़्म हिम्मत है, न दिल में कोई जज़्बा सानी\nकैसे सहरा में कोई फूल खिला पाओगे"
      },
      {
        "id": "ghazal_73",
        "title": "सलामत जब तलक ईमाँ है ऐसा नहीं होगा",
        "content": "सलामत जब तलक ईमाँ है ऐसा नहीं होगा\nकिसी फ़िरऔन के आगे मेरा सजदा नहीं होगा\n\nमेरी ग़ैरत की तुम क़ीमत लगाने आ गए फिर से\nतुम्हें सौ बार बोला है कि ये सौदा नहीं होगा\n\nन छेड़ो हम शरीफ़ों को इसी में ख़ैर है वरना\nनतीजा जान लो उस का कभी अच्छा नहीं होगा\n\nचलन अब छोड़ भी दो तुम मुझे बे जा सताने का\nनहीं तो हाल वो कर दूँगा जो सोचा नहीं होगा\n\nइबादत जान के माँ बाप की खिदमत करो वरना\nतुम्हारे हक़ में भी कल के लिए अच्छा नहीं होगा\n\nलहू रोते हुए उस बाप को देखा है कल मैंने\nजो कहता था कभी लोफर मेरा बेटा नहीं होगा\n\nहक़ीक़त में वही हक़दार है जन्नत का ए सानी\nख़ुदा का रास्ता जिस शख्स ने छोड़ा नहीं होगा"
      },
      {
        "id": "ghazal_74",
        "title": "क़ल्ब से क़ल्ब का जब राब्ता हो जाएगा",
        "content": "क़ल्ब से क़ल्ब का जब राब्ता हो जाएगा\nएक दूजे के लिए आइना हो जाएगा\n\nअज़्म हिम्मत से अगर लेता रहा काम तो फिर\nतेरा आसान ख़ुद ही रास्ता हो जाएगा\n\nकौन क्या है यहाँ दुनिया को पता चल जाए\nआओ मैदान में कभी फ़ैसला हो जाएगा\n\nतल्ख़ लहजे से हमेशा ही बचा कर वरना\nतेरे अपनों से तेरा फ़ासला हो जाएगा\n\nनींद आँखों से बहुत दूर चली जाएगी\nहिज्र से जिस रोज़ मियाँ वास्ता हो जाएगा\n\nहिज्र के दर्द से दम टूट रहा सानी का\nकिस को मालूम था ये हादिसा हो जाएगा"
      },
      {
        "id": "ghazal_75",
        "title": "ज़िंदगानी के सफ़र में हादिसा कुछ कम न था",
        "content": "ज़िंदगानी के सफ़र में हादिसा कुछ कम न था\nलेकिन अपना हौसला भी बा ख़ुदा कुछ कम न था\n\nफूल सब मुरझा गए शाख़ों से कलियाँ गिर पड़ीं\nमेरा गुलशन से निकलना हादिसा कुछ कम न था\n\nशुक्र है अल्लाह का जो मैं रहा साबित क़दम\nवरना तो ज़ुल्म व सितम का सिलसिला कुछ कम न था\n\nमाना कि क़िस्मत में अपनी था लिखा रंज व अलम\nहाँ मगर किरदार उस में आप का कुछ कम न था\n\nमिल रही है ज़िंदगानी उस रोज़ से हँस कर गले\nएक नज़र तेरा मुझे वो देखना कुछ कम न था\n\nकाश सानी आइना दिल की नज़र से देखता\nफ़िक्र में तेरे परेशाँ आइना कुछ कम न था"
      },
      {
        "id": "ghazal_76",
        "title": "तुम्हारा साथ जब होगा तो फिर ऐसा नहीं होगा",
        "content": "तुम्हारा साथ जब होगा तो फिर ऐसा नहीं होगा\nयूँ बे तरतीब सा हरगिज़ मेरा कमरा नहीं होगा\n\nतुम्हारे बाद क्या होगा तुम्हें कैसे मैं समझाऊँ\nमेरी आँखें तो होंगी हाँ मगर सपना नहीं होगा\n\nतेरे आशिक़ नहीं होंगे तुझे ये कब कहा मैंने\nमगर दावा है दीवाना मेरे जैसा नहीं होगा\n\nजुदा होना नहीं मुझ से मेरे दिलबर कभी वरना\nमेरा इस दिल के धड़कन से कोई रिश्ता नहीं होगा\n\nनई यारी है तुझ से इस लिए तारीफ़ करता है\nअभी बेचारा तुझ को ठीक से समझा नहीं होगा"
      },
      {
        "id": "ghazal_77",
        "title": "जीने के लिए हरगिज़ ऐसा नहीं करते हैं",
        "content": "जीने के लिए हरगिज़ ऐसा नहीं करते हैं\nलक़्मा कभी औरों का छीना नहीं करते हैं\n\nउठे जो क़दम फिर तो मंज़िल पे ही जा पहुँचे\nथक हार के राहों से लौटा नहीं करते हैं\n\nवअदे पे अटल उन को देखा है सदा हम ने\nइस्लाम के शिदाई धोका नहीं करते हैं\n\nवो ख़ुद भी तरसते हैं ए यार हँसी ख़ातिर\nमुस्कान जो ग़ैरों में बाँटा नहीं करते हैं\n\nरोने के सिवा उन को कुछ काम नहीं रहता\nहालात के रुख़ को जो परखा नहीं करते हैं\n\nबेकार ही करते हैं मोती की तमन्ना वो\nदरिया की सतह तक जो उतरा नहीं करते हैं\n\nतारीख़ वही अपनी करते हैं रक़म सानी\nहद से भी ज़ियादा जो सोचा नहीं करते हैं"
      },
      {
        "id": "ghazal_78",
        "title": "यारो मुझ को अक्सर ऐसा, क्यों लगता है सोच रहा हूँ",
        "content": "यारो मुझ को अक्सर ऐसा, क्यों लगता है सोच रहा हूँ\nआख़िर वो ही दिल को प्यारा, क्यों लगता है सोच रहा हूँ\n\nइस दुनिया में और भी यारो, रहते मेरे साथ हैं लेकिन\nसब से ज़ियादा वो ही अपना, क्यों लगता है सोच रहा हूँ\n\nउन की आँखें मेरी आँखें, कल परसों टकराई लेकिन\nसदियों पुराना उन से रिश्ता, क्यों लगता है सोच रहा हूँ\n\nक्या मैं पागल हो बैठा हूँ या अब पागल हो जाऊँगा\nख़ुद का साया उस का साया, क्यों लगता है सोच रहा हूँ\n\nमुझ पे क्या है जादू या फिर, मैं ही इश्क़ में पागल हूँ\nउस के सिवा हर एक बेगाना, क्यों लगता है सोच रहा हूँ\n\nदिलकश दिलकश मंज़र में भी, वो गर मेरे साथ नहीं तो\nजीना मुश्किल हो गया मेरा, क्यों लगता है सोच रहा हूँ\n\nउन का वअदा बिलकुल सच्चा, और का वअदा बिलकुल झूठा\nमुझ को सानी जाने ऐसा, क्यों लगता है सोच रहा हूँ"
      },
      {
        "id": "ghazal_79",
        "title": "क्या है तूने दिखावा, दिखावा निकलेगा",
        "content": "क्या है तूने दिखावा, दिखावा निकलेगा\nख़ुलूस के बिना बेकार सजदा निकलेगा\n\nकुछ और देर ठहर साथ तू अभी मेरे\nये देखना इसी सहरा से दरिया निकलेगा\n\nअमीर-ए-शहर लरज़ जाएगा फलक उस दिन\nअगर यतीम की आँखों से क़तरा निकलेगा\n\nवफ़ा की आड़ में नश्तर चुभो दिया उस ने\nख़बर कहाँ थी मेरा यार ऐसा निकलेगा\n\nज़रा तो सब्र से हिम्मत से काम ले ए दोस्त\nयहीं से देखना मंज़िल का रास्ता निकलेगा\n\nख़ुद अपने आप पे सानी यक़ीन है मुझ को\nमेरी हथेली से एक दिन उजाला निकलेगा"
      },
      {
        "id": "ghazal_80",
        "title": "तमाम उम्र जो करता रहा है काम ग़लत",
        "content": "तमाम उम्र जो करता रहा है काम ग़लत\nबनेगा कैसे न उस का तो फिर मक़ाम ग़लत\n\nज़रूरी है करें अच्छों का एहतराम मगर\nख़याल रखिए ग़लत का है एहतराम ग़लत\n\nतुम्हारे दर पे अगर हाज़िरी न हो तो फिर\nहमारी सुब्ह ग़लत है हमारी शाम ग़लत\n\nग़ज़ल कहूँ कि रुबाई कहूँ कि नज़्म कहूँ\nअगर न हो तेरा ज़िक्र तो सब कलाम ग़लत\n\nसजा दे या के मआफ़ी दे तेरी मर्ज़ी है\nअगर करे कभी तेरा ग़ुलाम काम ग़लत\n\nनमाज़ रोज़ा हो या हो कोई अमल सानी\nअगर दिखावे के हों तो हैं सारे काम ग़लत"
      },
      {
        "id": "ghazal_81",
        "title": "इश्क़ कर के तूने ए दिल ख़ाक अच्छा कर लिया",
        "content": "इश्क़ कर के तूने ए दिल ख़ाक अच्छा कर लिया\nग़म क्या मुद्‌द मुक़ाबिल ख़ाक अच्छा कर लिया\n\nजिस में शामिल भूखा कोई और ना प्यासा हुआ\nये सजाई तूने महफ़िल ख़ाक अच्छा कर लिया\n\nक्या पढ़ा लिखा वतन में नीता कोई था नहीं\nचुन के तू लाया है जाहिल ख़ाक अच्छा कर लिया\n\nजिस ने मंदिर और मस्जिद की न रखी लाज तक\nतुम ने हो के भीड़ में शामिल ख़ाक अच्छा कर लिया\n\nदेख ले ए बेवफ़ा मैं जी रहा हूँ आज भी\nकर के मेरे दिल को बस्मल ख़ाक अच्छा कर लिया\n\nमस्नद-ए-पीर-ए-मग़ाँ के वास्ते तुम ने मियाँ\nना अहल को समझा क़ाबिल ख़ाक अच्छा कर लिया\n\nधूप से डर कर के सानी ज़ुल्फ़-ए-सायेदार में\nभूल बैठा अपनी मंज़िल ख़ाक अच्छा कर लिया"
      },
      {
        "id": "ghazal_82",
        "title": "न पूछो हम से तुम क्या क्या हम अपना छोड़ देते हैं",
        "content": "न पूछो हम से तुम क्या क्या हम अपना छोड़ देते हैं\nकिसी की गर तमन्ना हो तो दुनिया छोड़ देते हैं\n\nहुनर जिस में यहाँ होता है अक्सर रहनुमाई का\nउसी को क़ाफ़िले वाले अकेला छोड़ देते हैं\n\nहमारे दौर के हाकिम क्या करते हैं ऐसा भी\nउजाला छीन लेते हैं अंधेरा छोड़ देते हैं\n\nयक़ीनन सर्ख़ रू होते हैं दुनिया में वही एक दिन\nके जो भाई की ख़ातिर अपना हिस्सा छोड़ देते हैं\n\nसंभल कर आप रहिएगा यहाँ चालाक लोगों से\nचुरा लेते हैं दिल को और कलीजा छोड़ देते हैं\n\nहक़ीक़त में भरोसा उन पे ये दुनिया नहीं करती\nजो अपनों पे यहाँ करना भरोसा छोड़ देते हैं\n\nबहुत जल्दी उसे दुनिया भुला देती है ए सानी\nवही जो अपने परखों का तरीक़ा छोड़ देते हैं"
      },
      {
        "id": "ghazal_83",
        "title": "हाय कैसी अपनी क़िस्मत हो गई",
        "content": "हाय कैसी अपनी क़िस्मत हो गई\nबे वफ़ा से क्यों मोहब्बत हो गई\n\nआबरू भी बिक रही है इन दिनों\nकितनी महँगी अब ज़रूरत हो गई\n\nइश्क़ ठहरा जब हमाक़त आज कल\nआप से फिर क्यों हमाक़त हो गई\n\nइस लिए आँखें बरसती हैं मेरी\nउन को देखे एक मुद्दत हो गई\n\nअब न, उम्मीद-ए-वफ़ा करना यहाँ\nअब ये दुनिया बे मुरव्वत हो गई\n\nछिन गईं एक लख्त सारी रौनक़ें\nलाडली जब घर से रुख़्सत हो गई\n\nअब वो आए हैं पलट कर किस लिए\nजब कि ग़म खाने की आदत हो गई"
      },
      {
        "id": "ghazal_84",
        "title": "उस की तरह हमारी तो आदत न होने की",
        "content": "उस की तरह हमारी तो आदत न होने की\nबस्ती जला के दिल को मसर्रत न होने की\n\nमुझ को निकाले शहर से या जान ले ले वो\nमग़रूर हाकिमराँ से अक़ीदत न होने की\n\nफ़ाक़ा कशी के डर से मैं ईमाँ बेच दूँ\nमुझ से कभी भी ऐसी तिजारत न होने की\n\nअजदाद ने सिखाया मुरव्वत का जो सबक़\nउस को भुला दूँ ऐसी हमाक़त न होने की\n\nएअलान कर के शहर में सब को बताया जाए\nकम ज़र्फ़ जो है उस की इताअत न होने की\n\nफ़रमा दिया ख़ुदा ने तो क़ुरआँ में जा बजा\nलक़्मा हराम खा के इबादत न होने की\n\nमुजरिम अगरचे बाप हो बेटा हो भाई हो\nमुझ से कभी उसकी हिमायत न होने की"
      },
      {
        "id": "ghazal_85",
        "title": "अमन के क़ातिल अमन के दुश्मन, अब तो तेरी ख़ैर नहीं",
        "content": "अमन के क़ातिल अमन के दुश्मन, अब तो तेरी ख़ैर नहीं\nतो ने जलाया हिंद का गुलशन, अब तो तेरी ख़ैर नहीं\n\nमंदिर, मस्जिद के चक्कर में कितना ख़ून बहाए हो\nजान चकी सच्चाई जिन जिन, अब तो तेरी ख़ैर नहीं\n\nअपनी सूरत जिस में अक्सर मिल के देखा करते थे\nतोड़ दिया वो तूने दरपन, अब तो तेरी ख़ैर नहीं\n\nताक़त क्या है हम जैसे की अब के पता चल जाएगा\nतोने की जनता से अन बन, अब तो तेरी ख़ैर नहीं\n\nअच्छे दिन के ख्वाब दिखा कर, फिर से लूट न पाएगा\nसुन ले मेरे देस के रहज़न, अब तो तेरी ख़ैर नहीं"
      },
      {
        "id": "ghazal_86",
        "title": "आज तक उन की मोहब्बत से यूँ बेज़ार हैं हम",
        "content": "आज तक उन की मोहब्बत से यूँ बेज़ार हैं हम\nउम्र भर वो ये समझते रहे अग़ियार हैं हम\n\nहुस्न-ए-किरदार कभी हम ने न छोड़ा लोगो\nये अलग बात है कि ख़ैर से ज़रदार हैं हम\n\nटेस ज़ख़्मों से जो उठती है मज़ा आता है\nइस लिए तेरी जफ़ाओं के तलबगार हैं हम\n\nतेरी मर्ज़ी है हँसा दे या रुला दे हम को\nअब तेरे इश्क़ व मोहब्बत में गिरफ़्तार हैं हम\n\nग़ैर के दर पे पड़ी रहती है पगड़ी उनकी\nऔर ये कहते हैं कि साहब-ए-दस्तार हैं हम\n\nहम से होती नहीं दुनिया की ग़ुलामी सानी\nअपनी दुनिया के मियाँ आज भी मुख़्तार हैं हम"
      },
      {
        "id": "ghazal_87",
        "title": "तेरे गुलनार चेहरे की ज़िया कुछ और कहती है",
        "content": "तेरे गुलनार चेहरे की ज़िया कुछ और कहती है\nमगर मुझ में जो बैठी है अना कुछ और कहती है\n\nतुम्हें बोलो भरोसा कर लें हम तुम पे भला कैसे\nज़बाँ कुछ और कहती है अदा कुछ और कहती है\n\nकोई तो बात है जिस को छुपाना चाहते हो तुम\nबता तो कुछ रहे हो पर फ़ज़ा कुछ और कहती है\n\nवो मेरे बिन बहुत ख़ुश है ये क़ासिद ने कहा लेकिन\nउसे जो छू के आई है सबा कुछ और कहती है\n\nहुई है जेल ज़ानी को चलो ये मानते हैं हम\nशरीअत तो मगर उस की सजा कुछ और कहती है\n\nकभी था अमन का पैकर ए सानी मुल्क हिंदुस्तान\nमगर इस वक़्त की आब व हवा कुछ और कहती है"
      },
      {
        "id": "ghazal_88",
        "title": "ये मेरी आँख जो परनम नहीं है",
        "content": "ये मेरी आँख जो परनम नहीं है\nउसे लगता है मुझ को ग़म नहीं है\n\nमेरी हिम्मत मेरा हौसला देख\nकिसी ग़म का कोई मातम नहीं है\n\nख़फ़ा है यूँ अमीर-ए-शहर मुझ से\nये सर क्यों उस के आगे खम नहीं है\n\nबनाया है उसे महबूब जब से\nमेरे हिस्से में कोई ग़म नहीं है\n\nअभी से रुक गए नश्तर लगाना\nअभी तो आँख भी परनम नहीं है\n\nसंभल कर ज़ख़्म तो अपने दिखाना\nकिसी के हाथ में मरहम नहीं है\n\nवो मंज़िल को न पाएगा कभी भी\nइरादा जिस का मुस्तहकम नहीं है\n\nकभी तो पास आ कर देख लेना\nतेरे बिन सानी में दम खम नहीं है"
      },
      {
        "id": "ghazal_89",
        "title": "ख़ुलूस व वफ़ा और चाहत अगर हो",
        "content": "ख़ुलूस व वफ़ा और चाहत अगर हो\nबदल जाएँ हालात हिम्मत अगर हो\n\nहों लश्कर के लश्कर अदू चाहे फिर भी\nहमें जीत जाएँगे मिल्लत अगर हो\n\nकई ताजुरहों गे क़दमों में तेरे\nअना से तकब्बुर से नफ़रत अगर हो\n\nदुआ रद हो तेरी ये मुमकिन नहीं है\nइबादत भी तेरी इबादत अगर हो\n\nरहें गे दरिंदे चरिंदे भी मिल कर\nउम्र जैसी लोगो ख़िलाफ़त अगर हो\n\nउसे बू-ए-जन्नत मिलेगी न हरगिज़\nके जिस के भी दिल में कदूरत अगर हो\n\nकभी आदमीयत से भटके न कोई\nअमल में मोहम्मद की सीरत अगर हो\n\nपलट आए चालीस घरों से भी सीरी\nसहाबा के जैसी मोहब्बत अगर हो\n\nपिघल जाए पत्थर ये मुमकिन है सानी\nजो ईमाँ में तेरे हरारत अगर हो"
      },
      {
        "id": "ghazal_90",
        "title": "न पूछ मुझ को क्या मिला, मज़ाक ही मज़ाक में",
        "content": "न पूछ मुझ को क्या मिला, मज़ाक ही मज़ाक में\nग़मों से आश्ना हुआ, मज़ाक ही मज़ाक में\n\nहसीं सुनहरे ख़्वाब सारे चूर चूर हो गए\nकिसी ने जब जगा दिया, मज़ाक ही मज़ाक में\n\nबहुत उदास लग रहे हो इन दिनों तो तुम मियाँ\nकिसी ने ग़म दिया है क्या, मज़ाक ही मज़ाक में\n\nन आँखों को क़रार है, न दिल को ही सुकून है\nये कैसा रोग लग गया, मज़ाक ही मज़ाक में\n\nसमझ में बात आ गई कि दिल्लगी है क्या बला\nकोई बना कोई मिटा, मज़ाक ही मज़ाक में\n\nकिसी के दिल को तोड़ना बहुत बड़ा गुनाह है\nवो ये गुनाह कर रहा, मज़ाक ही मज़ाक में\n\nसफ़र हयात का बहुत है सानी क़ीमती कहीं\nगुज़र न जाए देखना, मज़ाक ही मज़ाक में"
      },
      {
        "id": "ghazal_91",
        "title": "जो इधर हाल है वो उधर भी तो हो",
        "content": "जो इधर हाल है वो उधर भी तो हो\nमेरी चाहत की उस को ख़बर भी तो हो\n\nसिर्फ़ बातें बनाने से क्या फ़ायदा\nतुझ में दिल जीतने का हुनर भी तो हो\n\nकैसे तन्हा कोई मुस्कुराए भला\nदिलरुबा, हमनवा, हमसफ़र भी तो हो\n\nजिस की ख़ातिर लुटाऊँ मैं जान व जिगर\nकोई ऐसा यहाँ मुस्तनद भी तो हो\n\nदम निकल जाए ना तेरे बीमार का\nएक नज़र ऐ मसीहा इधर भी तो हो\n\nगर है ख़्वाहिश कि बुलबुल का नग़मा सुनूँ\nतेरे आँगन में सानी शजर भी तो हो"
      },
      {
        "id": "ghazal_92",
        "title": "मेरे जज़्बात ज़िंदा हैं अभी अरमान बाक़ी है",
        "content": "मेरे जज़्बात ज़िंदा हैं अभी अरमान बाक़ी है\nतेरे कूचे से क्यों जाऊँ मैं जब तक जान बाक़ी है\n\nख़बर किस को है कब लोगो यहाँ मंज़र बदल जाए\nअभी मौजों के दिल में हश्र का तूफ़ान बाक़ी है\n\nनफ़स मेरे ज़रा ठहरो, ज़रा सा सब्र तो रखो\nकि उनके आने का दिल में अभी इमकान बाक़ी है\n\nवो हरजाई है फिर भी क्यों उसे तू याद करता है\nअभी क्या और कोई ग़म दिल-ए-नादान बाक़ी है\n\nनहीं है साथ तो मेरे हक़ीक़त है यही लेकिन\nतेरी यादों का दिल की मेज़ पर गुलदान बाक़ी है\n\nजो सच्चाई की ख़ातिर जान भी दे देता है अपनी\nअभी दुनिया में ऐसा भी कोई इंसान बाक़ी है\n\nज़माने के दिलासे की मुझे हाजत नहीं सानी\nख़ुदा का शुक्र है लब पर अभी मुस्कान बाक़ी है"
      },
      {
        "id": "ghazal_93",
        "title": "रहेगी हमेशा ही रफ़अत वतन की",
        "content": "रहेगी हमेशा ही रफ़अत वतन की\nअगर तुम रखो गे मोहब्बत वतन की\n\nवो ज़िंदा हमेशा दिलों में रहेगा\nकि पाई है जिस ने शहादत वतन की\n\nसिखाता है इंसाँ को हर एक मज़हब\nइबादत है करना हिफ़ाज़त वतन की\n\nभला कर तअस्सुब चलो सोचते हैं\nमिटे किस तरह से अदावत वतन की\n\nकहीं डूब जाए वो पानी में जा कर\nन हो जिस के दिल में मोहब्बत वतन की\n\nलगाना गले साफ़ दिल से अदू को\nरही है पुरानी रवायत वतन की\n\nसुनाओ ग़ज़ल भाई चारे की सानी\nयही है अभी तो ज़रूरत वतन की"
      },
      {
        "id": "ghazal_94",
        "title": "न भूलो गे शहीदों की शहादत को क़सम खाओ",
        "content": "न भूलो गे शहीदों की शहादत को क़सम खाओ\nहमेशा याद रख्खो गे फ़ज़ीलत को क़सम खाओ\n\nपनपने तुम न दो गे यार नफ़रत को क़सम खाओ\nमिटाओगे ज़माने से अदावत को क़सम खाओ\n\nकभी सोने की चिड़िया थी ये अपना मुल्क हिंदुस्तान\nवही चिड़िया बनानी है ये भारत को क़सम खाओ\n\nमिटाना है मिटाना है मिटाना है मिटाना है\nये प्यारे देश हिंदुस्तान से नफ़रत को क़सम खाओ\n\nहमारा भी तुम्हारा भी तिरंगा शान है सब की\nतिरंगे की न झुकने देंगे रफ़अत को क़सम खाओ\n\nवतन के वास्ते फाँसी भी चढ़ जाओ गे तुम सानी\nन दो गे आँच आने उस की अज़मत को क़सम खाओ"
      },
      {
        "id": "ghazal_95",
        "title": "कैसे असलाफ़ का रास्ता छोड़ दें",
        "content": "कैसे असलाफ़ का रास्ता छोड़ दें\nलोग कहते हैं कि हम वफ़ा छोड़ दें\n\nफिर ज़रूरत पड़ी रौशनी की यहाँ\nफिर चिराग़-ए-मोहब्बत जला छोड़ दें\n\nवो गिरेंगे बलंदी से मेरी तरह\nउन से कह दो अना का नशा छोड़ दें\n\nसच तो सच है कभी झूठ होता नहीं\nहम भले देखना आइना छोड़ दें\n\nफिर से दुनिया दीवानी मोहब्बत की हो\nदिल का दरवाज़ा गर हम खुला छोड़ दें\n\nये नए दौर का है नया क़ाफ़िला\nआप सानी ज़रा रास्ता छोड़ दें"
      },
      {
        "id": "ghazal_96",
        "title": "ये मानोगे एक दिन कहा देख लेना",
        "content": "ये मानोगे एक दिन कहा देख लेना\nवफ़ा में मिलेगा दग़ा देख लेना\n\nअभी जिस को तू ने बिठाया है सर पे\nवही काट लेगा गला देख लेना\n\nहिमायत करोगे जो तुम ज़ालिमों की\nतुम्हारा भी होगा बुरा देख लेना\n\nकरोगे अभी से जो ज़िद उस की पूरी\nबिगड़ जाएगा लाडला देख लेना\n\nफलक से मैं तारे ले आऊँगा एक दिन\nरही आप की गर दुआ देख लेना"
      },
      {
        "id": "ghazal_97",
        "title": "अब सिवा मौत के कोई चारा नहीं",
        "content": "अब सिवा मौत के कोई चारा नहीं\nउन के बिन एक पल भी गुज़ारा नहीं\n\nरूठ कर वो मुझे बे सदा कर गए\nफिर ये कहते हैं मुझ को पुकारा नहीं\n\nतेरी साज़िश थी ये जो जला आशियाँ\nवरना कोई भी दुश्मन हमारा नहीं\n\nतेरे बच्चे न देंगे सहारा तुझे\nतू भी माँ बाप का गर सहारा नहीं\n\nऐसी कश्ती का सानी मुसाफ़िर हूँ मैं\nदूर तक जिस का कोई किनारा नहीं"
      },
      {
        "id": "ghazal_98",
        "title": "ज़िंदगानी का भी मौसम सुहाना हुआ",
        "content": "ज़िंदगानी का भी मौसम सुहाना हुआ\nदोस्तो! घर मेरे उस का आना हुआ\n\nबदले बदल से हैं दोस्त मेरे सभी\nजब से ग़ुरबत का घर में ठिकाना हुआ\n\nईद का चाँद तेरा बहुत शुक्रिया\nउस की दीदार का एक बहाना हुआ\n\nउम्र भर ख़ुश रखा हम ने माँ को मगर\nदूध का क़र्ज़ हम से अदा न हुआ\n\nआज सानी मुझे फिर वो याद आ गया\nजिस को भूले हुए एक ज़माना हुआ"
      },
      {
        "id": "ghazal_99",
        "title": "किसी के घर के लिए और किसी की जाँ के लिए",
        "content": "किसी के घर के लिए और किसी की जाँ के लिए\nख़ुदा से माँग रहे हैं दुआ जहाँ के लिए\n\nतुझे अगर है ज़रूरत तो ले के जा सूरज\nमुझे तो काफ़ी है जुगनू मेरे मकान के लिए\n\nअकेले में मेरी तबीयत ये मुझ से कहती है\nकोई ग़ज़ल तो कहो मेरी जान-ए-जाँ के लिए\n\nअबू बक्र, अली, उस्मान, उमर के जैसे फिर\nअमीर चाहिए दुनिया को कारवाँ के लिए\n\nज़बान दी है ख़ुदा ने ख़ुदा की बोलेगी\nज़बान मेरी नहीं ग़ैर के बयाँ के लिए"
      },
      {
        "id": "ghazal_100",
        "title": "दोस्तो शिकवे गिले को भूल जाइए ईद में",
        "content": "(ग़ज़ल ईद)\n\nदोस्तो शिकवे गिले को भूल जाइए ईद में\nआओ मिल कर जश्न हम ऐसा मनाइए ईद में\n\nकौन है अपना पराया भूल जाना है हमें\nदुश्मनों को भी गले अपने लगाइए ईद में\n\nज़िंदगी है चार दिन जब दुश्मनी फिर किस लिए\nक्यों न दुश्मनों को भी अपने घर बुलाइए ईद में\n\nहम अगर चाहें कि ख़ुशियाँ हम को दोबाला मिले\nतो किसी मुफ़लिस के बच्चे को हँसाइए ईद में\n\nभाई चारे से ये अपना मुल्क हो आरास्ता\nआओ हम सब रब से माँगें ये दुआएँ ईद में\n\nरब की ये मर्ज़ी है सानी हम जो हैं परदेस में\nकौन चाहे दिल से कि हम घर न आइए ईद में"
      },
      {
        "id": "ghazal_101",
        "title": "तमाशा देखने वालो तुम्हें उस की ख़बर क्या है",
        "content": "तमाशा देखने वालो तुम्हें उस की ख़बर क्या है\nजला जिस का मकान उस के हुआ दिल पे असर क्या है\n\nतेरी यादों का उठता है धुआँ दिल से मेरे हमदम\nकभी तू भी तो आकर देख मेरा हाल-ए-जिगर क्या है\n\nअगर वो देख ले हँस कर तो सब दीवाने हो जाएँ\nमियाँ उस की निगाहों में ख़ुदा जाने असर क्या है\n\nइरादा नीक हो जिस का तो मंज़िल मिल ही जाएगी\nमुसाफ़िर के भला आगे ये दरिया का सफ़र क्या है\n\nसताए जो ग़रीबों को रुलाए जो यतीमों को\nअगर ज़ालिम नहीं तो फिर बताएँ वो बशर क्या है\n\nदुआओं को मेरे मौला रसाई क्यों नहीं मिलती\nकि इस नाचीज़ सानी की इबादत में कसर क्या है"
      },
      {
        "id": "ghazal_102",
        "title": "यार हम से क्या हमारे खो गए",
        "content": "यार हम से क्या हमारे खो गए\nख़ूबसूरत सब नज़ारे खो गए\n\nआतिश-ए-नफ़रत की ज़द में दोस्तो\nमाँओं के प्यारे दिलारे खो गए\n\nकिस तरह से वो गुज़ारे ज़िंदगी\nजिस दुखी माँ के सहारे खो गए\n\nजी रहे हैं आप के बिन ऐसे हम\nजैसे कश्ती से किनारे खो गए\n\nवक़्त ने सानी दिखाया ये असर\nआज हम से ही हमारे खो गए"
      },
      {
        "id": "ghazal_103",
        "title": "आइना तू हमें मत दिखाना कभी",
        "content": "आइना तू हमें मत दिखाना कभी\nसच को सीखा नहीं है छुपाना कभी\n\nघर तेरा भी जला सकती है आग तो\nघर किसी ग़ैर का मत जलाना कभी\n\nबे बसी साइलों की जो चेहरे पे है\nभूले से भी हँसी मत उड़ाना कभी\n\nअब पलट कर भी वो देखता भी नहीं\nमेरा शाना था जिस का ठिकाना कभी\n\nतुम को होगी यक़ीनन ख़ुशी बाख़ुदा\nअपने माँ बाप का सर दबाना कभी\n\nआज नफ़रत है जिन को मेरे नाम से\nगाते थे वो मेरा ही तराना कभी\n\nज़ख़्म यादों के सानी उभर आते हैं\nपढ़ता हूँ जब कोई ख़त पुराना कभी"
      },
      {
        "id": "ghazal_104",
        "title": "वो जब से मेरे पास आने लगे हैं",
        "content": "वो जब से मेरे पास आने लगे हैं\nजहाँ वाले तूफ़ान उठाने लगे हैं\n\nमिली है जो कुर्सी हुकूमत की उन को\nइशारों पे सब को नचाने लगे हैं\n\nख़ुदा जाने अंजाम क्या हो गुलों का\nचमन बाग़बाँ ख़ुद जलाने लगे हैं\n\nजो सपने दिखाते थे अच्छे दिनों के\nवही मेरी नींदें उड़ाने लगे हैं\n\nभला घर से कैसे न जाएगी बरकत\nसवाली को दर से भगाने लगे हैं\n\nमैं मशहूर सानी हुआ जा रहा हूँ\nग़ज़ल मेरी सब गुनगुनाने लगे हैं"
      },
      {
        "id": "ghazal_105",
        "title": "जिसे नज़र में जिगर में बसा के रखते हैं",
        "content": "जिसे नज़र में जिगर में बसा के रखते हैं\nउसी से अपनी मोहब्बत छुपा के रखते हैं\n\nहर एक राज़ जो दिल में छुपा के रखते हैं\nतमाम रिश्तों को अपने बचा के रखते हैं\n\nबसात क्या है अंधेरों की जो इधर ठहरीं\nचिराग़ हो कि न हो दिल जला के रखते हैं\n\nहमें भुला दे ज़माना ये ग़ैर मुमकिन है\nहुनर ज़माने में अपनी अदा के रखते हैं\n\nउन्हें किसी का कहाँ ग़म दिखाई देता है\nअनानियत का जो चश्मा लगा के रखते हैं\n\nगले लगाती हैं उन को ही मंज़िलें सानी\nजो लोग हौसला अपना बना के रखते हैं"
      },
      {
        "id": "ghazal_106",
        "title": "ये मेरे पास ऐ लोगो ज़रा सा क्या हुआ पैसा",
        "content": "ये मेरे पास ऐ लोगो ज़रा सा क्या हुआ पैसा\nमैं कब खुलता था दुनिया को मेरा खुलने लगा पैसा\n\nहमारी दोस्ती में फ़ासला आता नहीं लेकिन\nहमारे और उनके दरमियाँ बस आ गया पैसा\n\nअकेला वो समझता है यहाँ अपने को तुर्रम ख़ान\nकहीं से मिल गया जिस को मियाँ थोड़ा घना पैसा\n\nकरोड़ों के जो मालिक हैं यहाँ वो भी नहीं जीते\nकिसी को कब बचाता है किसी इंसान का पैसा\n\nबख़ीलों के तो होंटों पर नज़अ के वक़्त ऐ सानी\nयही कलमात होते हैं मेरा पैसा मेरा पैसा"
      },
      {
        "id": "ghazal_107",
        "title": "बन के मौसम बहार आए हो",
        "content": "बन के मौसम बहार आए हो\nसाथ अपने ख़ुशी भी लाए हो\n\nजान ले लोगे क्या सनम बोलो\nकिस लिए बैठे सर झुकाए हो\n\nछोड़ दो मेरा इम्तिहाँ लेना\nमात कितनी दफ़ा तो खाए हो\n\nकल का अंजाम सोच लेना तुम\nआज मुझ को जो यूँ रुलाए हो\n\nबाख़बर तुम नहीं ज़माने से\nइस लिए बे नक़ाब आए हो\n\nआज मिल ही गया सुकून दिल को\nतुम जो हँस कर गले लगाए हो\n\nढूँढते हो वफ़ा यहाँ सानी\nदूसरे क्या जहाँ से आए हो"
      },
      {
        "id": "ghazal_108",
        "title": "इश्क़ करने वालों में फ़ासला नहीं होता",
        "content": "इश्क़ करने वालों में फ़ासला नहीं होता\nतन जुदा तो होता है मन जुदा नहीं होता\n\nहम अगर समझ जाते वक़्त की नज़ाकत को\nरहज़नों के हाथों में क़ाफ़िला नहीं होता\n\nदूसरों पे जो अक्सर उंगलियाँ उठाता है\nआदमी तो वो ख़ुद भी पारसा नहीं होता\n\nटूट कर अगर लोगो आदमी बिखर जाए\nफिर तो उम्र भर पैदा हौसला नहीं होता\n\nमाँ की जब दुआ ले कर घर से मैं निकलता हूँ\nरास्ते में फिर कोई हादिसा नहीं होता\n\nदोस्ती ज़रा सानी आप सोच कर कीजे\nकौन कब बदल जाए कुछ पता नहीं होता"
      },
      {
        "id": "ghazal_109",
        "title": "तारीकियों को यूँ भी मिटाना पड़ा मुझे",
        "content": "तारीकियों को यूँ भी मिटाना पड़ा मुझे\nराह-ए-वफ़ा में दिल को जलाना पड़ा मुझे\n\nयूँ ही नहीं चमन में आई बहार है\nपहले लहू से गुल को खिलाना पड़ा मुझे\n\nरुनाइयों ने शहर की रोका बहुत मगर\nवअदे पे तेरे लौट आना पड़ा मुझे\n\nवो क्या गया कि सारी ख़ुशी साथ ले गया\nआख़िर ग़मों को अपना बनाना पड़ा मुझे\n\nक़ीमत न पूछिए कि मोहब्बत की क्या रही\nख़ुद को मिटा के मोल चुकाना पड़ा मुझे\n\nदेखा क्या रक़ीब की बाहों में जब उसे\nनाम-ए-वफ़ा को दिल से मिटाना पड़ा मुझे\n\nसानी चिराग़ तब कहीं जा कर के ये जला\nपहले तो घर ही अपना जलाना पड़ा मुझे"
      },
      {
        "id": "ghazal_110",
        "title": "मुझ को चाहत में क्या हुआ तेरी",
        "content": "मुझ को चाहत में क्या हुआ तेरी\nअब जफ़ा भी लगे वफ़ा तेरी\n\nबुझ गया हूँ तो क्या ख़ता तेरी\nये तो फ़ितरत है ऐ हवा तेरी\n\nज़िक्र जब भी हुआ जफ़ाओं का\nयाद आती रही वफ़ा तेरी\n\nअब किसी और को लुभाना तो\nहम ने तो देख ली अदा तेरी\n\nनीम जाँ हो गए तेरी ख़ातिर\nऔर चाहत है क्या बता तेरी\n\nलोग दिल को दुखा के हँसते हैं\nयही दुनिया है क्या ख़ुदा तेरी\n\nक़त्ल तू ने किया भरोसे का\nकिस क़लम से लिखूँ सज़ा तेरी\n\nतुझ में सानी अनानियत क्यों है\nजावदाँ जाँ है क्या बता तेरी"
      },
      {
        "id": "ghazal_111",
        "title": "ख़ुद को इतना भी मत उछाला कर",
        "content": "ख़ुद को इतना भी मत उछाला कर\nक़द मिला है तो क़द संभाला कर\n\nतुझ को मंज़िल की है अगर चाहत\nरास्ता ख़ुद नया निकाला कर\n\nसाफ़ तौबा से भी न हो पाए\nदिल को इतना भी तू न काला कर\n\nकुछ नहीं नफ़रतों से हासिल है\nप्यार ही प्यार दिल में पाला कर\n\nजान जाए तो जाने दे सानी\nहक़ का हर दम ही बोल बाला कर"
      },
      {
        "id": "ghazal_112",
        "title": "सोचिएगा ज़रा ये ख़ुदा के लिए",
        "content": "सोचिएगा ज़रा ये ख़ुदा के लिए\nज़िंदगी क्या मिली है ख़ता के लिए\n\nअब मुझे ग़म मिले या ख़ुशी दोस्तो\nज़िंदगी वक़्फ़ की है वफ़ा के लिए\n\nमुझ को पागल ज़माना समझता रहा\nमैं फिरा कू बकू दिलरुबा के लिए\n\nहर मुसीबत मेरी दूर होती गई\nहाथ जैसे उठाए दुआ के लिए\n\nवो तो मर के भी दुनिया में ज़िंदा रहा\nजान दी जिस ने सानी ख़ुदा के लिए"
      },
      {
        "id": "ghazal_113",
        "title": "जहान तेरे लिए है न तू जहान के लिए",
        "content": "जहान तेरे लिए है न तू जहान के लिए\nख़ुदा ने भेजा है इंसाँ को इम्तिहाँ के लिए\n\nमुझे भी शौक़ से सूली पे तुम चढ़ा देना\nज़बाँ खुलेगी मगर मेरी हक़ बयाँ के लिए\n\nमैं उन को दास्ताँ अपनी सुनाने बैठ गया\nमगर वो आए थे ख़ुद अपनी दास्ताँ के लिए\n\nख़ुदारा और मेरा इम्तिहान मत लेना\nतरस रहा हूँ मैं बरसों से तेरी हाँ के लिए\n\nयहाँ तो जैसे भी कटनी थी कट गई सानी\nरखा है आप ने सामान भी कुछ वहाँ के लिए"
      },
      {
        "id": "ghazal_114",
        "title": "हुजरे के पास है न वो मिम्बर के आस पास",
        "content": "हुजरे के पास है न वो मिम्बर के आस पास\nवाइज़ को हम ने देखा है साग़र के आस पास\n\nआँखों में अश्क आ गए जब हम ने ये सुना\nबैठे हुए हैं लोग सितमगर के आस पास\n\nउस को डरा रहा है तू रहता है जिस का दिल\nवलियों बुज़ुर्गों और क़लंदर के आस पास\n\nपानी की एक बूँद मयस्सर न हो सकी\nजीने को जी रहे हैं समंदर के आस पास\n\nहिकमत है क्या ख़ुदा की किसी को नहीं ख़बर\nपाला है बुत शिकन को भी आज़र के आस पास\n\nचैन व सुकून दिल को मिला है बहुत ख़ुदा\nआया है जब से सानी तेरे दर के आस पास"
      },
      {
        "id": "ghazal_115",
        "title": "ख़ुदा के सामने एक दिन सभी का फ़ैसला होगा",
        "content": "ख़ुदा के सामने एक दिन सभी का फ़ैसला होगा\nवहाँ बदला मिलेगा सब को जिस ने जो किया होगा\n\nजला कर घर ग़रीबों का जो तुम इतराते फिरते हो\nकभी सोचा ख़ुदा के सामने अंजाम क्या होगा\n\nसफ़र की मुश्किलों से तुम कभी वापस नहीं होना\nचलो गे और आगे तो कोई रास्ता नया होगा\n\nवफ़ा का मैं हूँ शिदाई वफ़ा को आम कर दूँगा\nकिसी महबूब से कोई नहीं हरगिज़ जुदा होगा\n\nअदू की मैं शिकायत क्या करूँ तुम ही कहो सानी\nलगा है पीठ पर खंजर कोई अपना रहा होगा"
      },
      {
        "id": "ghazal_116",
        "title": "रुख़ अपना फेर के मुझ से जो जा रहा है अब",
        "content": "रुख़ अपना फेर के मुझ से जो जा रहा है अब\nनज़र में ला के नज़र से गिरा रहा है अब\n\nहमारे दौर में पूछो न इश्क़ की हालत\nहमारे दौर में फ़ितना बता रहा है अब\n\nख़ुदा जाने कि क्या है इरादा क़ातिल का\nमेरा मसीहा वो ख़ुद को बता रहा है अब\n\nफ़रेब देता था औरों को जो ज़माने में\nफ़रेब खा के ज़माने से जा रहा है अब\n\nख़िलाफ़ मेरे रक़ीबों ने कर दिया उस को\nवो मेरे दिल को मुसल्सल दुखा रहा है अब\n\nबियाज़ मीर को सानी ने किया पढ़ा लोगो\nज़मीन-ए-मीर में ग़ज़लें सुना रहा है अब"
      },
      {
        "id": "ghazal_117",
        "title": "तुझ से मैं डर जाऊँ काहे को",
        "content": "तुझ से मैं डर जाऊँ काहे को\nजीते जी मर जाऊँ काहे को\n\nमेरा रब तो है दिल में मेरे\nढूँढने बाहर जाऊँ काहे को\n\nमेरे हक़ में जब वो चाँद नहीं\nछत के ऊपर जाऊँ काहे को\n\nमेरा मुहाफ़िज़ जब है साथ मेरे\nले के लश्कर जाऊँ काहे को\n\nमैं हूँ भिखारी एक तेरे दर का\nफिर मैं दर दर जाऊँ काहे को\n\nजिन को रिश्ते का एहसास नहीं\nउन के मैं घर जाऊँ काहे को"
      },
      {
        "id": "ghazal_118",
        "title": "दौर-ए-हाज़िर में ऐसी ख़ता किस लिए",
        "content": "दौर-ए-हाज़िर में ऐसी ख़ता किस लिए\nमाँगते हो वफ़ा का सिला किस लिए\n\nजो न करना था वो ही किया किस लिए\nबीच कर खा गए तुम अना किस लिए\n\nजाम भर भर के कल तक पिलाते रहे\nअब मुझे कह रहे हो बुरा किस लिए\n\nदेख कर रौशनी हम ग़रीबों के घर\nदिल मियाँ आप का जल गया किस लिए\n\nजब ज़माने से लड़ने की हिम्मत नहीं\nतुम हुए इश्क़ से आश्ना किस लिए\n\nमैं तो कहता था बचना अमीरों से तुम\nआज दिल टूटने का गिला किस लिए\n\nउन दिनों क्या थे तुम याद सानी को है\nइन दिनों बनते हो पारसा किस लिए"
      },
      {
        "id": "ghazal_119",
        "title": "क्या अजब शे ये प्यार है साहब",
        "content": "क्या अजब शे ये प्यार है साहब\nनाम की बस बहार है साहब\n\nअब तो दुनिया उसी की सुनती है\nजो यहाँ मालदार है साहब\n\nलौट कर वो ज़रूर आएगा\nटूटे दिल की पुकार है साहब\n\nलम्स से क़ब्ल सोचना होगा\nसाथ गुल के तो ख़ार है साहब\n\nअब दिखाने लगे वही आँखें\nजिन पे मेरा उधार है साहब\n\nअमन क़ायम तो हो नहीं सकता\nदिल में जब तक दरार है साहब\n\nडाल देगा कभी हलाकत में\nये जो मैं का ख़ुमार है साहब"
      },
      {
        "id": "ghazal_120",
        "title": "रोते हुए को यार हँसाना, ये इस्लाम सिखाता है",
        "content": "रोते हुए को यार हँसाना, ये इस्लाम सिखाता है\nभटके हुए को राह दिखाना, ये इस्लाम सिखाता है\n\nजिन शाख़ों पे नफ़रत देखो यारो ऐसी शाख़ों को\nकाट के उन को आग लगाना, ये इस्लाम सिखाता है\n\nजो है दुश्मन मज़लूमों का और सितमगर इंसाँ का\nउस को मिटाने में मिट जाना, ये इस्लाम सिखाता है\n\nकोई न छोटा और बड़ा है सब हैं अल्लाह के बंदे\nसब से दिल से हाथ मिलाना, ये इस्लाम सिखाता है\n\nजाती है तो जाए अपनी, जान बचाना औरों की\nख़ुद से पहले पानी पिलाना, ये इस्लाम सिखाता है\n\nराह में गर हो काँटा पत्थर नज़रें बचा कर मत जाना\nपहले रुक के उस को हटाना, ये इस्लाम सिखाता है"
      },
      {
        "id": "ghazal_121",
        "title": "चिराग़-ए-मोहब्बत यूँ जलने का ना है",
        "content": "चिराग़-ए-मोहब्बत यूँ जलने का ना है\nकि जब तक तेरा दिल बदलने का ना है\n\nसहारा दे अपने दीवाने को आ के\nकिसी और से ये संभलने का ना है\n\nतू जब तक करे गा न इक़रार सुन ले\nदीवाना तेरे दर से टलने का ना है\n\nहम ही हैं जो नखरे उठाते हैं तेरे\nकिसी और के पास चलने का ना है\n\nतलाशी लो घर की बड़े शौक़ से तुम\nकोई बम या खंजर निकलने का ना है\n\nख़ुदा को तू महबूब तब तक न होगा\nतकब्बुर को जब तक कुचलने का ना है\n\nनई नस्ल की चाहतें भी नई हैं\nखिलौनों से अब ये बहलने का ना है\n\nख़ुदा की इनायत है मुझ नातवाँ पे\nसितम से ये सानी दहलने का ना है"
      },
      {
        "id": "ghazal_122",
        "title": "बहुत आसान है घर को जलाना",
        "content": "बहुत आसान है घर को जलाना\nबहुत मुश्किल है लेकिन घर बनाना\n\nचलेंगे चाँदनी शब में टहलने\nमेरे हम राज़ हमदम आप आना\n\nबहुत महँगा पड़ेगा तुम को एक दिन\nकिसी मजबूर के दिल को दुखाना\n\nवफ़ा हरगिज़ न करना मेरी मानो\nदिखावे का है ये आलम सुहाना\n\nअमीर-ए-शहर एक जाहिल बना है\nहुनर सानी संभल कर तुम दिखाना"
      },
      {
        "id": "ghazal_123",
        "title": "मैं यहाँ ढूँढता ही रहा और कुछ",
        "content": "मैं यहाँ ढूँढता ही रहा और कुछ\nथा मुक़द्दर में लेकिन लिखा और कुछ\n\nआ गया भाई जब ग़ैर की बात में\nहोगा क्या उस से बढ़ कर बुरा और कुछ\n\nआप को जाना है जाइए बज़्म से\nमुझ को तो है अभी देखना और कुछ\n\nदे रहा है तस्सली मसीहा मुझे\nकह रहा है मगर आइना और कुछ\n\nइस लिए फ़ासला दरमियाँ हो गया\nमैं ने बोला था कुछ सुन लिया और कुछ\n\nदिल जिगर जسم जाँ इश्क़ में दे दिए\nथा तक़ाज़ा मगर इश्क़ का और कुछ\n\nज़िंदगी आ गई आख़िरी मोड़ पे\nछोड़ सानी यहाँ सोचना और कुछ"
      },
      {
        "id": "ghazal_124",
        "title": "हमारी तरह वफ़ा तुम भी कर सको गे क्या",
        "content": "हमारी तरह वफ़ा तुम भी कर सको गे क्या\nभँवर में इश्क़ के बोलो उतर सको गे क्या\n\nये इश्क़ इश्क़ है कोई हँसी मज़ाक़ नहीं\nये राह काँटों भरी है गुज़र सको गे क्या\n\nअमीर-ए-शहर से तेरा है ख़ून का रिश्ता\nग़रीब ख़ाने में मेरे ठहर सको गे क्या\n\nहमें सताओ गे तड़पाओ गे रुलाओ गे\nअमीर-ए-शहर हो तुम और कर सको गे क्या\n\nबदन के ज़ख़्म सभी मेरे भर तो दो गे तुम\nतबीबो ज़ख़्म-ए-जिगर मेरा भर सको गे क्या\n\nख़ुदा ने बख़्शी मुझ को उड़ान है सानी\nपरों को मेरे भला तुम कतर सको गे क्या"
      },
      {
        "id": "ghazal_126",
        "title": "तेरा दीवाना भला और किधर जाएगा",
        "content": "तेरा दीवाना भला और किधर जाएगा\nछोड़ के दर को तेरे कौन से दर जाएगा\n\nकोई नक़्क़ाद अगर नापे पैमाने पर\nजितना शीराज़ा है लफ़्ज़ों का बिखर जाएगा\n\nकल वो रोएगा मुझे छोड़ के जाने वाला\nजब रक़ीबों की निगाहों से उतर जाएगा\n\nअपने आँगन का शजर काटने वालो सोचो\nशाम को लौटा परिंदा तो किधर जाएगा\n\nजिस के कहने पे जहाँ भर से बग़ावत कर ली\nक्या ख़बर थी कि ज़माने से वो डर जाएगा\n\nअपने ईमान पे मज़बूती से रहना सानी\nफ़ितना तूफ़ान सा होता है गुज़र जाएगा"
      },
      {
        "id": "ghazal_126",
        "title": "ख़ुमार उस आँख की तीखी शराब का न गया",
        "content": "ख़ुमार उस आँख की तीखी शराब का न गया\nमेरे ख़याल से चेहरा वो चाँद सा न गया\n\nतेरे प्यार ने पैरों में बाँध दी बेड़ी\nमैं जा रहा था यहाँ से मगर चला न गया\n\nतमाम उम्र भटकता रहा तलाश में पर\nतेरे नगर के लिए कोई रास्ता न गया\n\nमैं इस लिए चला आया तेरी महफ़िल से\nज़बान-ए-ग़ैर से चर्चा तेरा सुना न गया\n\nसज़ा मिली है हमें ऐसे दिल दुखाने की\nकिसी पे हँस लिए इतना कि फिर हँसा न गया\n\nमिज़ाज मिलता भी उन से तो किस तरह सानी\nवफ़ा परस्त था मैं बे वफ़ा बना न गया"
      },
      {
        "id": "ghazal_127",
        "title": "तुम जो तन्हाई में आ बैठे हो",
        "content": "तुम जो तन्हाई में आ बैठे हो\nक्या कोई रोग लगा बैठे हो\n\nहुस्न की तुम ने जो पाई दौलत\nसब को दीवाना बना बैठे हो\n\nख़ुद को कहते हो बड़े दाना तुम\nदिल मगर अपना गँवा बैठे हो\n\nअब तमाशाई बनेगी दुनिया\nहाल नादान को सुना बैठे हो\n\nनब्ज़ भी थमने लगी है मेरी\nऔर तुम हो कि ख़फ़ा बैठे हो\n\nसारी दुनिया को जलन होने लगी\nमेरे पहलू में जो आ बैठे हो\n\nग़म है सीने से मेरा दिल सानी\nक्या कहें आप छुपा बैठे हो"
      },
      {
        "id": "ghazal_128",
        "title": "दिल में था उस के और न उस के जिगर में था",
        "content": "दिल में था उस के और न उस के जिगर में था\nजो कुछ भी था कमाल वो उस की नज़र में था\n\nमंज़र बयान कैसे करूँ सोचता हूँ मैं\nसूरज का एक गुलाब सा तश्त-ए-सहर में था\n\nनाकामियों का अपनी सबब का पता चला\nदुश्मन का राज़दार तो अपने ही घर में था\n\nआसान तुम समझते हो आना यहाँ मेरा\nमालूम तुम को क्या है कि कब से सफ़र में था\n\nकैसे छुपाता ख़ुद को बता ऐ मेरे सनम\nअपनी वफ़ा का तज़किरा हर सो नगर में था"
      },
      {
        "id": "ghazal_129",
        "title": "सोच कर ये मेरा दिल दहलने लगा",
        "content": "सोच कर ये मेरा दिल दहलने लगा\nरास्ता क्यों भला वो बदलने लगा\n\nएक मुद्दत से पत्थर बना जो रहा\nइश्क़ की चोट से वो पिघलने लगा\n\nजब तड़प कर दुआ एक माँ ने है की\nफिर तो सहरा भी पानी उबलने लगा\n\nदुश्मनों में मेरे खलबली मच गई\nजब दिया मेरा तूफ़ान में जलने लगा\n\nतुम निकल आओ माज़ी से सानी कभी\nशाम का अब तो सूरज भी ढलने लगा"
      },
      {
        "id": "ghazal_130",
        "title": "फ़ितरत नहीं बदलती है इंसान क्या करे",
        "content": "फ़ितरत नहीं बदलती है इंसान क्या करे\nजिस का दग़ा है काम वो कैसे वफ़ा करे\n\nसीने में उस की आग लगी को बुझाए कौन\nख़ुशहाली देख कर जो किसी की जला करे\n\nसाइल सभी के ख़ैर में करता रहा दुआ\nअल्लाह दो जहान में सब का भला करे\n\nहै ये मेरे पड़ोसी का महबूब मशग़ला\nदेखे कहीं शरारा तो उस पर हवा करे\n\nमैं माँगता हूँ रब से दुआएँ ये सुब्ह व शाम\nऐसा कभी न हो कि वो तर्क-ए-वफ़ा करे\n\nसानी मैं उस का क्यों न करूँ दिल से एहतराम\nबे लौस दूसरों की जो ख़िदमत किया करे"
      },
      {
        "id": "ghazal_131",
        "title": "दिल मेरा साज़-ए-मोहब्बत पे चहक लेता है",
        "content": "दिल मेरा साज़-ए-मोहब्बत पे चहक लेता है\nतेरा दीवाना है मस्ती में थरक लेता है\n\nमुफ़लिसी मुल्क से जाए भी तो जाए कैसे\nहक़ ग़रीबों का ये नीता ही सटक लेता है\n\nउस से बढ़ कर के ग़लत हाल-ए-चमन क्या होगा\nआबरू फूल की माली ही उचक लेता है\n\nये भी हालात से एक तरह बग़ावत ही तो है\nजिस को मैदान में होना था दुबक लेता है\n\nदर्द होता है तो हो जाता है चेहरे से ज़ाहिर\nफूल जब शाख़ पे खिलता है महक लेता है\n\nदास्तान-ए-ग़म-ए-दिल किस को सुनाऊँ सानी\nजो भी सुनता है वही सुन के खिसक लेता है"
      },
      {
        "id": "ghazal_132",
        "title": "बे वफ़ा को बावफ़ा काहे कहो हो",
        "content": "बे वफ़ा को बावफ़ा काहे कहो हो\nना ख़ुदा को तुम ख़ुदा काहे कहो हो\n\nतुम तो वाक़िफ़ नहीं उस आदमी से\nउस को अच्छा या बुरा काहे कहो हो\n\nकर के मुझ से बे वफ़ाई जो गया है\nउस को मेरा अब भला काहे कहो हो\n\nहोश में आ रे दीवाने होश में आ\nज़ुल्फ़-ए-नागिन को घटा काहे कहो हो\n\nसाहब-ए-मस्नद ने ये एलान किया है\nतुम गधे को भी गधा काहे कहो हो\n\nसब का है हिंदुस्तान सब का रहेगा\nसिर्फ़ अपने बाप का काहे कहो हो"
      },
      {
        "id": "ghazal_133",
        "title": "तुझ को रुसवा न करूँगा मैं ये सर जाने तक",
        "content": "तुझ को रुसवा न करूँगा मैं ये सर जाने तक\nमेरी कोशिश यही होगी मेरे मर जाने तक\n\nआइना आइना है आइना सच बोलेगा\nसंग मारो भले उस को बिखर जाने तक\n\nमैं तुम्हारा हूँ तुम्हारा ही रहूँगा दिलबर\nजाँच लेना मेरी साँसों के ठहर जाने तक\n\nआँधियाँ देख मुझे तू न डरा पाएगा\nमैं तेरी राह में हूँ तेरे गुज़र जाने तक\n\nआस्माँ पे ही नज़र रहता है उस का हरदम\nआख़िरी पर भी परिंदे का कतर जाने तक\n\nअज़्म सानी का भी देखेगा ये दरिया मग़रूर\nकश्ती छोड़ूँगा न नरग़े से उभर जाने तक"
      },
      {
        "id": "ghazal_134",
        "title": "तेरी यादों में लिपटी हुई तर हवा",
        "content": "तेरी यादों में लिपटी हुई तर हवा\nआती रहती है मुझको बराबर हवा\n\nझोपड़ी क्या हवेली भी टिक न सके\nगर बदलने लगे अपने ऐतवार हवा\n\nजब फ़िज़ाओं में फैली हो आلودगी\nफिर मयस्सर कहाँ से हो बेहतर हवा\n\nचल रही इतरा इतरा के उस रोज से\nजब से आई है इनको ये छूकर हवा\n\nभूल जाऊँ उसे जब भी सोचा कभी\nउसकी यादों के लिए आई लश्कर हवा\n\nशुक्र है इरादा मेरा सलामत रहा\nयूँ तो आई डराने को अकसर हवा\n\nवह भी बे'चैन है सानीؔ तेरे बगैर\nबस अभी गुज़री है मुझसे कहकर हवा"
      }
    ]
  },
  {
    "id": "section_qita",
    "heading": "क़िता",
    "items": [
      {
        "id": "qita_1",
        "title": "अहद-ए-हाज़िर का ऐसा सख़नवर है तू",
        "content": "अहद-ए-हाज़िर का ऐसा सख़नवर है तू\nइस जहाँ-ए-सखन में तू फ़ानी नहीं\n\nमीर व ग़ालिब का इक हुस्न-ए-बदल\nतू है सानी मगर तेरा सानी नहीं\n\nतौहीद अज़हरपूरनोवी"
      },
      {
        "id": "qita_2",
        "title": "हर इक शेर, ग़ज़ल को, हर इक कहानी को",
        "content": "हर इक शेर, ग़ज़ल को, हर इक कहानी को\nलिखा है जिसने कलम की उसी रवानी को\nमेरी दुआ है कि मेहनत ये इनकी रंग लाए\nख़ुदा कबूल करे यारों अक्स-ए-सानी को\n\nसाहिब ख़ान सागर"
      },
      {
        "id": "qita_3",
        "title": "पूरा दिल का हुआ अरमान यारो",
        "content": "पूरा दिल का हुआ अरमान यारो\nसानी का आ गया दीवान यारो\nइसमें बसी मेरी जान यारो\nसानी का आ गया दीवान यारो\n\nउर्दू के लफ़्ज़ों से उसको सँवारा\nहिंदी का भी तो लिया सहारा\nदोनो भाषाओं की शान यारो\nसानी का आ गया दीवान यारो\n\nग़ज़लों में उसकी गज़ब की रवानी\nहर शेर में है मुकम्मल कहानी\nइसकी यही पहचान यारो\nसानी का आ गया दीवान यारो\n\nउर्दू अदब के वो अहल-ए–नज़र हैं\nउस्ताद साहिब तो इनके सहर हैं\nइल्म-ओ-हुनर की है ख़ान यारो\nसानी का आ गया दीवान यारो\nहुआ ये जहाँ में जो मुअतबर है\nदादा मज़हर की दुआ का असर है\nरब ने अता की ये शान यारो\nसानी का आ गया दीवान यारो\n\nमेहनत ये सानी की वो रंग लाई\nदेता है हर कोई दिल से बदाई\nपीछे रहे क्यों इमरान यारो\nसानी का आ गया दीवान यारो"
      }
    ]
  }
]
