[
{
"id": 1,
"title": {
"ur": "ابھرتے ہوئے شاعر نور الدین ثانیؔ کی دلکش شاعری",
"en": "The Captivating Poetry of Emerging Poet Nooruddin Sani",
"hi": "उभरते हुए शायर नूरुद्दीन सानी की मनमोहक शायरी"
},
"author": {
"ur": "تنویر پھولؔ (نیو یارک، امریکہ)\ntanwirphool@gmail.com\n0015182217060",
"en": "Tanwir Phool (New York, USA)\ntanwirphool@gmail.com\n0015182217060",
"hi": "तनवीर फूल (न्यू यॉर्क, अमेरिका)\ntanwirphool@gmail.com\n0015182217060"
},
"content": {
"ur": "[عہد حاضر کے ابھرتے ہوئے شاعروں میں نورالدین ثانیؔ کا نام نمایاں ہے، وہ ایک ہونہار شاعر ہیں اور اپنی خداداد صلاحیت کو کام میں لاکر حمد ونعت اور غزل کے گلستان میں گلہائے رنگا رنگ کا اضافہ کررہے ہیں۔ انہیں اپنی زندگی کی ابتداء میں ہی بڑی مشکلوں کو سامنا کرنا پڑا جس کا اظہار انہوں نے اپنے پیش لفظ میں کیا ہے۔ وہ نہایت خلیق، متقی اور صوم و صلوٰۃ کے پابند ہیں جس کا عکس ان کی شاعری میں بھی نمایاں ہے۔نورالدین ثانی ؔ کے مجموعہ ئ کلام کا نام ”عکس ثانی“ ہے جس کی ابتدا حمد باری تعالیٰ سے ہوتی ہے۔\n وہ اپنی حمد کا آغاز اس طرح کرتے ہیں: \n\nوہ یکتا ہے، یگانہ ہے، وہ ہر عالم کا بانی ہے \nنہ کوئی اس کا ہمسر ہے، نہ کوئی اس کا ثانی ہے \n\nبنا اُس کی اجازت کے، کوئی پتہ نہیں ہلتا \nوہ تنہا ہے مگرہرشے پہ اُس کی حکمرانی ہے \nحمد باری تعالیٰ کے بعد بارگاہِ رسول اکرم صلی اللہ علیہ وسلم میں نعت کا نذرانہ ملاحظہ کیجئے: \nانگلی کے اک اشارے پہ ٹکڑے ہوا قمر \nمنکر! یہ دیکھ، کتنی ہے عظمت رسولؐ کی \n\nثانیؔ کے پاس کچھ نہیں نیکی کے نام پر \nکچھ ہے اگر تو وہ ہے محبت رسولؐ کی \nلیکن وہ محض زاہدِ خشک نہیں، وہ اخلاقی اور روحانی قدروں کے ساتھ ساتھ حسن و عشق کے تعلق کو بھی انسانیت کے وقار اور احترام کے تناظر میں پیش کرتے ہیں۔ ان کے کلام میں کہیں بھی تہذیب و ثقافت کی سنجیدہ قدروں سے انحراف نہیں ملتا۔ یہاں ایک وضاحت ضروری ہے کہ، کچھ زاہدِ خشک قسم کے لوگ غزلیہ شاعری اور اس میں محبوب کے ذکر کو دینی نقطہئ نظر سے قابل عتراض سمجھتے ہیں لیکن وہ اس حقیقت کو بھول جاتے ہیں کہ حضرت کعبؓ بن زبیر نے اپنا مشہور بانت سعاد حضور  ﷺ کی خدمت میں پیش کیا تھا۔ ساٹھ اشعار کے اس قصیدے کے ابتدائی پندرہ اشعار میں شاعر نے اپنی محبوبہ سعاد کے حسن اور اُس سے جدائی کا ذکر عاشقانہ انداز میں کیا ہے۔ اس کے بعد پچیس اشعار میں اُس ناقہ کا ذکر ہے جو شاعر کو محبوبہ سعاد کے پاس لے جارہی تھی لیکن وہ رسول اللہ صلی اللہ علیہ وسلم کے پاس پہنچ گئی۔ آخری بیس اشعار میں نعتیہ مضامین ہیں۔ حضور صلی اللہ علیہ وسلم نے قصیدے کے ابتدائی اشعار پر کوئی اعتراض نہیں فرمایااور انہیں خارج کرنے کو نہیں کہا بلکہ شاعر کو اپنی چادر مبارک بطور انعام عطا فرمائی۔ اس مبارک اصلاح اور قصیدہ بانت سعاد(جسے قصیدہ بردہ شریف اوّل اور قصیدہئ لامیہ بھی کہا جاتا ہے) کا ذکر حدیث اور تاریخ کی کتابوں میں موجود ہے۔ اب نور الدین ثانیؔ کی شاعری کے کچھ دلکش نمونے ملاحظہ کیجئے: \n\nعزم و حوصلہ کا اظہار:     \nریزہ ریزہ اُس کو میرے حوصلوں نے کردیا \nآگیا  پتھر کوئی گر راستوں کے درمیاں \n\nتمنا اب اجالے کی، کہیں سے اور کیا کرنا \n چلو روشن چراغ دل جلاکے خود جہاں کر لیں \nاظہار حقیقت: \nاینٹ پتھر سے فقط گھر نہیں بنتا ثانیؔ \nمل کے رہتے ہیں جہاں سب وہی گھر ہوتا ہے \nغزل کا رنگ دیکھئے: \nگنوا کے عمر کسی بے وفا کے خاطر آج \nنہ جانے کیوں کفِ افسوس مل رہا ہوں میں \nقفس میں جیسے پرندہ تڑپتا رہتا ہے \nکسی کی یاد میں ایسے مچل رہا ہوں میں \nشہر آشوب کا رنگ اور موجودہ حالات کی عکاسی دیکھئے: \nدرندوں کی حمایت ہورہی ہے \nیہ کیسی اب سیاست ہو رہی ہے \nبھلا انصاف اب کیسے ملے گا \nبکاؤ جب عدالت ہو رہی ہے \nصنعت تلمیح سے آراستہ اشعار دیکھئے جن میں نوک نیزہ پر حضرت امام حسینؓ کے سر مبارک کا ذکر ہے: \nوہی حق ہے، جو حق پر بولتا ہے \nمجاہد کا کٹا سر بولتا ہے \nوہ جب اللہ اکبر بولتا ہے \nعدو کے چہرے پر ڈر بولتا ہے \nموجودہ زمانے کا المیہ: \nصلہ تجھ کو ملا ہے پرورش کا \nیہ بیٹا جو پلٹ کر بولتا ہے \nتغزل سے بھرپور یہ اشعار ملاحظہ کیجئے: \nاس کے سوا کسی سے محبت نہیں ہوئی \nلیکن یہ بات کہنے کی ہمت نہیں ہوئی \n\nواسطہ ہے الفت کا، آپ مسکرادیں تو \nاس اُداس چہرے پر تازگی بکھر جائے \n\nان کا ہی اعتبار کرتے رہے \nجو ہمیں بے قرار کرتے رہے \nایک مدت سے وہ نہیں آئے \nہم مگر انتظار کرتے رہے \nاس کی آنکھوں نے یہ کہا مجھ سے \nہے اجازت تجھے، مکرر دیکھ! \n\nمجھ کو وہ کیا ملے، زندگی مل گئی \nمیرے ہونٹوں کو یارو! ہنسی مل گئی \n\nعشق میں کیا بُرا ہے، کیا اچھا؟ \nعشق میں کب یہ سوچتا ہے دل! \nمطلب پرست اور خوشامدی لوگوں پر طنز کرتے ہوئے کہتے ہیں: \nعقل حیراں ہے مری، آج ہو کیا کہتے ہیں! \nآنکھ والے بھی اندھیرے کو ضیاء کہتے ہیں \nانہوں نے راہِ زیست میں بہت پریشانیوں کا سامنا کیا ہے اس لئے کہتے ہیں: \nرنج و غم اور مصیبت کے سوا \nزندگی کیا ہے؟ اذیت کے سوا \nتم نہ چھیڑو کبھی غیرت کو مری \nپاس کچھ بھی نہیں غیرت کے سوا \nشاعری میں جذبہئ محبت اور الہامی کیفیت کا ذکر دیکھئے: \nمجھ کو بخشی ہے محبت نے کرامت ایسی \nکوئی دیکھے نہ جہاں تک، میں وہاں تک دیکھوں \nبیٹی کی رخصتی پر اُداسی اور اپنی حق گوئی کاذکر کرتے ہوئے کہتے ہیں: \nچھائی رہتی ہے اُداسی گھر مرے \nجب سے بیٹی گھر سے رخصت ہوگئی \nثانیؔ سولی پر چڑھے گا ایک دن \nحق بیانی کی جو عادت ہوگئی \nانتباہ کا یہ انداز دیکھئے: \nمیں کہتا تھا، کبوتر مت اڑانا \nبچارا زخم کھا کر آگیا نا! \nہمارے قتل پر کل تم ہی چپ تھے \nتمہارا بھی تو نمبرآگیا نا! \nمعاشرے کی دکھتی رگ پر ہاتھ رکھتے ہوئے کہتے ہیں: \nبھوک بچوں کی، ماں سے نہ دیکھی گئی \nآبرو بیچ دی مفلسی کے سبب \nنصیحت کا اندازہ دیکھئے: \nمعتبر ہونے کی چاہت ہے اگر \nفکر تم اوروں سے بہتر رکھنا \nایک دن مہنگا پڑے گا تجھ کو \nحق غریبوں کا دبا کر رکھنا \nتیرا کردار ہے تری پہچان \nیاد یہ بات برابر رکھنا \nمحنتی لوگ بن گئے سورج \nہم ستارے شمار کرتے رہے \nکلام میں تغزل کا رنگ: \nمدتوں بعد ہوش آیا تھا\nاس نے جلوہ دکھادیا پھر سے \n\nپاگل، کوئی مجنوں، کوئی دیوانہ کہے ہے \nاک تیرے سوا کوئی بھی اچھا نہ کہے ہے \nان اشعار میں عزم و ہمت کا اظہار دیکھئے: \nغم لئے کس طرح سے زندہ ہوں! \nایک دن میرے ساتھ جی کر دیکھ \nچھوڑ کر چل دیئے دوست، ثانیؔ! سبھی \nساتھ میرے، مرا حوصلہ رہ گیا \nیہ دلکش اشعار بھی دیکھئے: \nاکیلے روز سنتا ہوں \nدر و دیوار کی باتیں \nپُرانی ہوگئی ہیں اب \nلب و رخسار کی باتیں \n\nجانے کیسی اپنی قسمت ہوگئی \nبے وفا سے کیوں محبت ہوگئی \nاس لئے آنکھیں برستی ہیں مری \nاس کو دیکھے ایک مدت ہوگئی \n\nسوکھے پیڑوں سے کہہ کر پرندے اُڑے \nاب ہمارا کہاں ہے ٹھکانا یہاں \nخوف ہے، لوگ تم پر نہ ہنسنے لگیں \nداستانِ وفا مت سنانا یہاں \n\nبہت آسان ہے گھر کو جلانا \nبہت مشکل ہے لیکن گھر بنانا \nبہت مہنگا پڑے گا تم کو اک دن \nکسی مجبور کے دل کو دُکھانا \n\nراہ پر دشموں کی، وہ چلنے لگے \nدوست میرے سبھی اب بدلنے لگے \nاب محافظ چمن کا میاں! کون ہے؟ \nخود ہی مالی گلوں کو مسلنے لگے \n\nکوئی شکوہ نہیں زمانے سے \nدل تو ٹوٹا ہے دل لگانے سے \nدَور کیسا یہ آگیا ثانیؔ \nلوگ ڈرتے ہیں مسکرانے سے \n\nوقت نے آج کہاں لاکے اسے چھوڑا ہے \nناز جس کو تھا کبھی دوستو! فنکاری پر \nماحول میں آلودگی اور اپنے عزم کا اظہار دیکھئے: \nجب فضاؤں میں پھیلی ہو آلودگی \nپھر میسر کہاں سے ہو بہتر ہوا \nشُکر ہے، عزم میرا سلامت رہا \nیوں تو آئی ڈرانے کو اکثر ہوا \nماں کی محبت کا ذکر اس طرح کرتے ہیں: \nماں کی جب دعا لے کر گھر سے میں نکلتا ہوں \nراستے میں پھر کوئی حادثہ نہیں ہوتا \n\nزندگی تھی مری بس وہی زندگی \nماں کے سائے تلے جو کٹی زندگی \nاربابِ اقتدار سے شکوہ اور قناعت کا سبق دیکھئے: \nہم کریں فریاد کیوں؟ جب ہونے والا کچھ نہیں! \nجو ہمارا حکمراں ہے، گونگا ہے، بہرا بھی ہے \nہمارے واسطے جگنو بہت ہیں \nتم اپنے پاس رکھو چاندی کو \n\nہماری شان وشوکت کا سبب یہ ہے زمانے میں \nسوا اللہ کے، اوروں سے ہم مانگا نہیں کرتے \nہمارے گھر میں فاقہ ہو یا کتنی تنگ دستی ہو \nخدا کا شکر ہے، ایمان ہم بیچا نہیں کرتے \nمجھے امید ہے کہ وقت گزرنے کے ساتھ ساتھ ثانیؔ صاحب کی شاعری ارتقا کی منازل طے کرتی رہے گی اور ہم ان کی خوبصورت کلام سے لطف اندوز ہوتے رہیں گے۔ \nاللہ کرے، زورِ قلم اور زیادہ! \n]",
"en": "[Among the emerging poets of the present era, the name of Nooruddin Sani stands out prominently. He is a talented poet who, with his God-given abilities, is adding vibrant flowers to the garden of hamd, naat, and ghazal. He faced significant hardships early in his life, which he has expressed in his preface. He is extremely courteous, pious, and steadfast in observing prayers and fasting, a reflection of which is evident in his poetry. The collection of Nooruddin Sani’s poetry is titled “Aks-e-Sani,” which begins with a hamd in praise of Allah Almighty. He starts his hamd as follows: \nWoh yakta hai, yagana hai, woh har alam ka bani hai \nNa koi us ka hamsar hai, na koi us ka sani hai \nBina us ki ijazat ke, koi patta nahin hilta \nWoh tanha hai magar har shay pe us ki hukmrani hai \nAfter the hamd, behold the offering of a naat in the court of the Prophet Muhammad (PBUH): \nUngli ke ek ishare pe tukre hua qamar \nMunkir! Yeh dekh, kitni hai azmat Rasool ki \nSani ke paas kuchh nahin neki ke naam par \nKuchh hai agar to woh hai mohabbat Rasool ki \nYet, he is not merely a rigid ascetic; alongside moral and spiritual values, he presents the themes of beauty and love within the framework of human dignity and respect. His poetry never deviates from the serious values of culture and tradition. It is necessary to clarify that some rigid ascetics consider ghazal poetry and the mention of a beloved from a religious perspective as objectionable, but they forget that Hazrat Ka’b bin Zuhair presented his famous “Banat Su’ad” in the service of the Prophet (PBUH). In the first fifteen verses of this sixty-verse qasida, the poet describes the beauty of his beloved Su’ad and her separation in a romantic style. The next twenty-five verses describe the she-camel taking the poet to Su’ad but reaching the Prophet (PBUH). The final twenty verses contain naat themes. The Prophet (PBUH) did not object to the initial verses or ask for their removal; instead, he gifted the poet his blessed cloak as a reward. This blessed precedent and the mention of Qasida Banat Su’ad (also known as Qasida Burda Sharif Awwal or Qasida Lamiyya) are found in hadith and history books. Now, enjoy some captivating samples of Nooruddin Sani’s poetry: \n\n**Expression of Resolve and Courage:** \nReza reza us ko mere hauslon ne kar diya \nAa gaya patthar koi agar raston ke darmiyan \n\nTamanna ab ujale ki, kahin se aur kya karna \nChalo roshan chiragh dil jalake khud jahan kar len \n\n**Expression of Truth:** \nEent patthar se faqat ghar nahin banta Sani \nMil ke rehte hain jahan sab wahi ghar hota hai \n\n**The Hue of Ghazal:** \nGanwa ke umr kisi be wafa ke khatir aaj \nNa jane kyun kaf-e-afsos mil raha hoon main \nQafas mein jaise parinda tarapta rehta hai \nKisi ki yaad mein aise machal raha hoon main \n\n**The Chaos of the City and Reflection of Current Affairs:** \nDarindon ki himayat ho rahi hai \nYeh kaisi ab siyasat ho rahi hai \nBhala insaaf ab kaise milega \nBikao jab adalat ho rahi hai \n\n**Verses Adorned with Allusion, Mentioning the Sacred Head of Imam Hussain (RA) on the Spear’s Tip:** \nWahi haq hai, jo haq par bolta hai \nMujahid ka kata sar bolta hai \nWoh jab Allah Akbar bolta hai \nAdu ke chehre par darr bolta hai \n\n**The Tragedy of the Present Era:** \nSila tujh ko mila hai parwarish ka \nYeh beta jo palat kar bolta hai \n\n**Verses Full of Romanticism:** \nUs ke siwa kisi se mohabbat nahin hui \nLekin yeh baat kehne ki himmat nahin hui \n\nWasta hai ulfat ka, aap muskura den to \nIs udaas chehre par tazgi bikhar jaye \n\nUn ka hi aitbar karte rahe \nJo hamein be qarar karte rahe \nEk muddat se woh nahin aaye \nHum magar intezar karte rahe \nUs ki aankhon ne yeh kaha mujh se \nHai ijazat tujhe, mukarrar dekh! \n\nMujh ko woh kya mile, zindagi mil gayi \nMere honton ko yaro! Hansi mil gayi \n\nIshq mein kya bura hai, kya acha? \nIshq mein kab yeh sochta hai dil! \n\n**Satire on Selfish and Flattering People:** \nAqal hairan hai meri, aaj ho kya kehte hain! \nAankh walon bhi andhere ko ziya kehte hain \n\n**Facing Many Hardships in Life, He Says:** \nRanj o gham aur musibat ke siwa \nZindagi kya hai? Aziyat ke siwa \nTum na chhedo kabhi ghairat ko meri \nPaas kuchh bhi nahin ghairat ke siwa \n\n**Mention of Love and Divine Inspiration in Poetry:** \nMujh ko bakhshi hai mohabbat ne karamat aisi \nKoi dekhe na jahan tak, main wahan tak dekhun \n\n**Sadness on Daughter’s Departure and His Truthfulness:** \nChhai rehti hai udasi ghar mere \nJab se beti ghar se rukhsat ho gayi \nSani sooli par chadhega ek din \nHaq bayani ki jo aadat ho gayi \n\n**A Style of Warning:** \nMain kehta tha, kabutar mat udana \nBechara zakhm kha kar aa gaya na! \nHamare qatl par kal tum hi chup the \nTumhara bhi to number aa gaya na! \n\n**Touching Society’s Painful Nerve:** \nBhok bachchon ki, maa se na dekhi gayi \nAabru bech di muflisi ke sabab \n\n**A Style of Advice:** \nMutabar hone ki chahat hai agar \nFikr tum auron se behtar rakhna \nEk din mehnga padega tujh ko \nHaq ghareebon ka daba kar rakhna \nTera kirdaar hai teri pehchan \nYaad yeh baat barabar rakhna \nMehnati log ban gaye sooraj \nHum sitare shumaar karte rahe \n\n**The Color of Romanticism in Poetry:** \nMuddaton baad hosh aaya tha \nUs ne jalwa dikha diya phir se \n\nPagal, koi majnoon, koi deewana kahe hai \nEk tere siwa koi bhi acha na kahe hai \n\n**Expression of Resolve and Courage:** \nGham liye kis tarah se zinda hoon! \nEk din mere saath ji kar dekh \nChhod kar chal diye dost, Sani! Sabhi \nSaath mere, mera hausla reh gaya \n\n**More Captivating Verses:** \nAkele roz sunta hoon \nDar o deewar ki baaten \nPurani ho gayi hain ab \nLab o rukhsar ki baaten \n\nJane kaisi apni qismat ho gayi \nBe wafa se kyun mohabbat ho gayi \nIs liye aankhen barasti hain meri \nUs ko dekhe ek muddat ho gayi \n\nSukhe pedon se keh kar parinde udey \nAb hamara kahan hai thikana yahan \nKhauf hai, log tum par na hansne lagen \nDastan-e-wafa mat sunana yahan \n\nBahut aasan hai ghar ko jalana \nBahut mushkil hai lekin ghar banana \nBahut mehnga padega tum ko ek din \nKisi majboor ke dil ko dukhana \n\nRaah par dushmanon ki, woh chalne lage \nDost mere sabhi ab badalne lage \nAb muhafiz chaman ka miyan! Kon hai? \nKhud hi mali gulon ko masalne lage \n\nKoi shikwa nahin zamane se \nDil to toota hai dil lagane se \nDaur kaisa yeh aa gaya Sani \nLog darte hain muskurane se \n\nWaqt ne aaj kahan laake use chhoda hai \nNaaz jis ko tha kabhi dosto! Fankari par \n\n**On Environmental Pollution and Resolve:** \nJab fizaon mein faili ho aloodgi \nPhir mayassar kahan se ho behtar hawa \nShukr hai, uzm mera salamat raha \nYun to aayi darane ko aksar hawa \n\n**On a Mother’s Love:** \nMaa ki jab dua le kar ghar se main nikalta hoon \nRaste mein phir koi hadsa nahin hota \n\nZindagi thi meri bas wahi zindagi \nMaa ke saye tale jo kati zindagi \n\n**Complaint Against Rulers and Lesson of Contentment:** \nHum karen fariyad kyun? Jab hone wala kuchh nahin! \nJo hamara hakimran hai, goonga hai, behra bhi hai \nHamare waste jugnu bohat hain \nTum apne paas rakho chandi ko \n\nHamari shaan o shokat ka sabab yeh hai zamane mein \nSiwa Allah ke, auron se hum manga nahin karte \nHamare ghar mein faqa ho ya kitni tang dasti ho \nKhuda ka shukr hai, imaan hum becha nahin karte \n\nI hope that with time, Sani Sahib’s poetry will continue to evolve, and we will keep enjoying his beautiful verses. \nMay Allah grant his pen even more strength!]",
"hi": "[वर्तमान युग के उभरते शायरों में नूरुद्दीन सानी का नाम प्रमुख है। वे एक प्रतिभाशाली शायर हैं और अपनी ईश्वर-प्रदत्त प्रतिभा का उपयोग करके हम्द, नात और ग़ज़ल के बगीचे में रंग-बिरंगे फूल जोड़ रहे हैं। उन्हें अपने जीवन के प्रारंभ में ही कई कठिनाइयों का सामना करना पड़ा, जिसका ज़िक्र उन्होंने अपनी प्रस्तावना में किया है। वे अत्यंत विनम्र, धार्मिक और नमाज़ व रोज़े के पाबंद हैं, जिसका प्रतिबिंब उनकी शायरी में भी स्पष्ट है। नूरुद्दीन सानी के काव्य संग्रह का नाम “अक्स-ए-सानी” है, जो अल्लाह की हम्द से शुरू होता है। वे अपनी हम्द की शुरुआत इस तरह करते हैं: \nवह यकता है, यगाना है, वह हर आलम का बानी है \nन कोई उस का हम्सर है, न कोई उस का सानी है \nबिना उस की इजाज़त के, कोई पता नहीं हिलता \nवह तन्हा है मगर हर शे पे उस की हुकमरानी है \nहम्द के बाद, पैगंबर मुहम्मद (स.अ.व.) की बारगाह में नात का नज़राना पेश है: \nउंगली के एक इशारे पे टुकड़े हुआ कमर \nमुनकिर! यह देख, कितनी है अज़मत रसूल की \nसानी के पास कुछ नहीं नेकी के नाम पर \nकुछ है अगर तो वह है मोहब्बत रसूल की \nलेकिन वे केवल सख्त ज़ाहिद नहीं हैं; नैतिक और आध्यात्मिक मूल्यों के साथ-साथ, वे सुंदरता और प्रेम के विषयों को भी मानव गरिमा और सम्मान के दायरे में प्रस्तुत करते हैं। उनकी शायरी में कहीं भी संस्कृति और परंपरा के गंभीर मूल्यों से विचलन नहीं मिलता। यहाँ एक स्पष्टीकरण ज़रूरी है कि कुछ सख्त ज़ाहिद लोग ग़ज़ल शायरी और उसमें प्रियतम के ज़िक्र को धार्मिक दृष्टिकोण से आपत्तिजनक मानते हैं, लेकिन वे इस सच्चाई को भूल जाते हैं कि हज़रत काब बिन ज़ुहैर ने अपनी प्रसिद्ध “बनात सुआद” को पैगंबर (स.अ.व.) की सेवा में पेश किया था। इस साठ छंदों के कसीदे के पहले पंद्रह छंदों में शायर ने अपनी प्रियतमा सुआद की सुंदरता और उससे जुदाई को रोमांटिक अंदाज़ में बयान किया है। अगले पच्चीस छंदों में उस ऊँटनी का ज़िक्र है जो शायर को सुआद तक ले जा रही थी, लेकिन वह पैगंबर (स.अ.व.) तक पहुँच गई। अंतिम बीस छंदों में नात के विषय हैं। पैगंबर (स.अ.व.) ने शुरुआती छंदों पर कोई आपत्ति नहीं की और उन्हें हटाने के लिए नहीं कहा, बल्कि शायर को अपनी मुबारक चादर इनाम के रूप में दी। इस मुबारक सुधार और कसीदा बनात सुआद (जिसे कसीदा बुरदा शरीफ अव्वल और कसीदा लामिया भी कहा जाता है) का ज़िक्र हदीस और इतिहास की किताबों में मौजूद है। अब नूरुद्दीन सानी की शायरी के कुछ मनमोहक नमूने देखिए: \n\n**उज़्म ओ हौसला का इज़हार:**     \nरेज़ा रेज़ा उस को मेरे हौसलों ने कर दिया \nआ गया पत्थर कोई अगर रास्तों के दरमियाँ \n\nतमन्ना अब उजाले की, कहीं से और क्या करना \nचलो रोशन चिराग़ दिल जलाके ख़ुद जहाँ कर लें \n\n**इज़हार-ए-हक़ीक़त:** \nईंट पत्थर से फ़क़त घर नहीं बनता सानी \nमिल के रहते हैं जहाँ सब वही घर होता है \n\n**ग़ज़ल का रंग देखिए:** \nगँवा के उम्र किसी बे वफ़ा के ख़ातिर आज \nन जाने क्यों कफ़-ए-अफ़सोस मिल रहा हूँ मैं \nक़फ़स में जैसे परिंदा तड़पता रहता है \nकिसी की याद में ऐसे मचल रहा हूँ मैं \n\n**शहर आशोब का रंग और मौजूदा हालात की अक्कासी देखिए:** \nदरिंदों की हिमायत हो रही है \nयह कैसी अब सियासत हो रही है \nभला इंसाफ़ अब कैसे मिलेगा \nबिकाऊ जब अदालत हो रही है \n\n**सनअत तल्मीह से आरास्ता अशआर देखिए जिन में नोक-ए-नेज़ा पर हज़रत इमाम हुसैन के सर-ए-मुबारक का ज़िक्र है:** \nवही हक़ है, जो हक़ पर बोलता है \nमुजाहिद का कटा सर बोलता है \nवह जब अल्लाह अकबर बोलता है \nअदू के चेहरे पर डर बोलता है \n\n**मौजूदा ज़माने का अलमिया:** \nसिला तुझ को मिला है परवरिश का \nयह बेटा जो पलट कर बोलता है \n\n**तग़ज़्ज़ुल से भरपूर यह अशआर मुलाहज़ा कीजिए:** \nउस के सिवा किसी से मोहब्बत नहीं हुई \nलेकिन यह बात कहने की हिम्मत नहीं हुई \n\nवास्ता है उल्फ़त का, आप मुस्कुरा दें तो \nइस उदास चेहरे पर ताज़गी बिखर जाए \n\nउन का ही इआतबार करते रहे \nजो हमें बे क़रार करते रहे \nएक मुद्दत से वह नहीं आए \nहम मगर इंतिज़ार करते रहे \nउस की आँखों ने यह कहा मुझ से \nहै इजाज़त तुझे, मुकर्रर देख! \n\nमुझ को वह क्या मिले, ज़िंदगी मिल गई \nमेरे होंटों को यारो! हंसी मिल गई \n\nइश्क़ में क्या बुरा है, क्या अच्छा? \nइश्क़ में कब यह सोचता है दिल! \n\n**मतलब परस्त और ख़ुशामदी लोगों पर तंज़ करते हुए कहते हैं:** \nअक़ल हैरान है मरी, आज हो क्या कहते हैं! \nआँख वालों भी अंधेरे को ज़िया कहते हैं \n\n**उन्होंने राह-ए-ज़िंदगी में बहुत परेशानियों का सामना किया है इसलिए कहते हैं:** \nरंज ओ ग़म और मुसीबत के सिवा \nज़िंदगी क्या है? अज़ीयत के सिवा \nतुम न छेड़ो कभी ग़ैरत को मरी \nपास कुछ भी नहीं ग़ैरत के सिवा \n\n**शायरी में जज़्बा-ए-मोहब्बत और इल्हामी क़ियाफ़त का ज़िक्र देखिए:** \nमुझ को बख़्शी है मोहब्बत ने करामत ऐसी \nकोई देखे न जहाँ तक, मैं वहाँ तक देखूँ \n\n**बेटी की रुख़्सती पर उदासी और अपनी हक़ गोई का ज़िक्र करते हुए कहते हैं:** \nछाई रहती है उदासी घर मेरे \nजब से बेटी घर से रुख़्सत हो गई \nसानी सूल पर चढ़ेगा एक दिन \nहक़ बयानी की जो आदत हो गई \n\n**इंतिबाह का यह अंदाज़ देखिए:** \nमैं कहता था, कबूतर मत उड़ाना \nबेचारा ज़ख़्म खा कर आ गया ना! \nहमारे क़त्ल पर कल तुम ही चुप थे \nतुम्हारा भी तो नंबर आ गया ना! \n\n**मुआशरे की दुखती रग पर हाथ रखते हुए कहते हैं:** \nभूक बच्चों की, माँ से न देखी गई \nआबरू बेच दी मुफ़्लिसी के सबब \n\n**नसीहत का अंदाज़ देखिए:** \nमुस्तनाद होने की चाहत है अगर \nफ़िक्र तुम औरों से बेहतर रखना \nएक दिन महंगा पड़ेगा तुझ को \nहक़ ग़रीबों का दबा कर रखना \nतेरा किरदार है तेरी पहचान \nयाद यह बात बराबर रखना \nमहनती लोग बन गए सूरज \nहम सितारे शुमार करते रहे \n\n**कलाम में तग़ज़्ज़ुल का रंग:** \nमुद्दतों बाद होश आया था \nउस ने जलवा दिखा दिया फिर से \n\nपागल, कोई मजनूं, कोई दीवाना कहे है \nएक तेरे सिवा कोई भी अच्छा न कहे है \n\n**इन अशआर में उज़्म ओ हिम्मत का इज़हार देखिए:** \nग़म लिए किस तरह से ज़िंदा हूँ! \nएक दिन मेरे साथ जी कर देख \nछोड़ कर चल दिए दोस्त, सानी! सभी \nसाथ मेरे, मेरा हौसला रह गया \n\n**यह दिलकश अशआर भी देखिए:** \nअकेले रोज़ सुनता हूँ \nदर ओ दीवार की बातें \nपुरानी हो गई हैं अब \nलब ओ रुख़्सार की बातें \n\nजाने कैसी अपनी क़िस्मत हो गई \nबे वफ़ा से क्यों मोहब्बत हो गई \nइस लिए आँखें बरसती हैं मरी \nउस को देखे एक मुद्दत हो गई \n\nसूखे पेड़ों से कह कर परिंदे उड़े \nअब हमारा कहाँ है ठिकाना यहाँ \nख़ौफ़ है, लोग तुम पर न हँसने लगें \nदास्तान-ए-वफ़ा मत सुनाना यहाँ \n\nबहुत आसान है घर को जलाना \nबहुत मुश्किल है लेकिन घर बनाना \nबहुत महंगा पड़ेगा तुम को एक दिन \nकिसी मजबूर के दिल को दुखाना \n\nराह पर दुश्मनों की, वह चलने लगे \nदोस्त मेरे सभी अब बदलने लगे \nअब मोहाफ़िज़ चमन का मियाँ! कौन है? \nख़ुद ही माली गुलों को मसलने लगे \n\nकोई शिकवा नहीं ज़माने से \nदिल तो टूटा है दिल लगाने से \nदौर कैसा यह आ गया सानी \nलोग डरते हैं मुस्कुराने से \n\nवक़्त ने आज कहाँ लाके उसे छोड़ा है \nनाज़ जिस को था कभी दोस्तो! फनकारी पर \n\n**माहौल में आलूदगी और अपने उज़्म का इज़हार देखिए:** \nजब फ़िज़ाओं में फैली हो आलूदगी \nफिर मयस्सर कहाँ से हो बेहतर हवा \nशुक्र है, उज़्म मेरा सलामत रहा \nयूँ तो आई डराने को अक्सर हवा \n\n**माँ की मोहब्बत का ज़िक्र इस तरह करते हैं:** \nमाँ की जब दुआ ले कर घर से मैं निकलता हूँ \nरास्ते में फिर कोई हादिसा नहीं होता \n\nज़िंदगी थी मरी बस वही ज़िंदगी \nमाँ के साए तले जो कटी ज़िंदगी \n\n**अरबाब-ए-इक़्तिदार से शिकवा और क़नाअत का सबक़ देखिए:** \nहम करें फ़रियाद क्यों? जब होने वाला कुछ नहीं! \nजो हमारा हाकिमराँ है, गूंगा है, बहरा भी है \nहमारे वास्ते जुगनू बहुत हैं \nतुम अपने पास रखो चाँदी को \n\nहमारी शान ओ शौकत का सबब यह है ज़माने में \nसिवा अल्लाह के, औरों से हम माँगा नहीं करते \nहमारे घर में फ़ाक़ा हो या कितनी तंग दस्ती हो \nख़ुदा का शुक्र है, ईमान हम बेचा नहीं करते \n\nमुझे उम्मीद है कि वक़्त गुज़रने के साथ-साथ सानी साहब की शायरी तरक़्क़ी की मंज़िलें तय करती रहेगी, और हम उनकी ख़ूबसूरत शायरी से आनंद लेते रहेंगे। \nअल्लाह करे, ज़ोर-ए-क़लम और ज़्यादा!]"
}
},
{
"id": 2,
"title": {
"ur": "کہاں میں اور کہاں یہ نکہت گل",
"en": "Where Am I and Where Is This Fragrance of Flowers",
"hi": "कहाँ मैं और कहाँ यह फूलों की सुगंध"
},
"author": {
"ur": "بندہ بے نوا نور الدین ثانیؔ",
"en": "Banda Be-Nawa Nooruddin Sani",
"hi": "बंदा बे-नवा नूरुद्दीन सानी"
},
"content": {
  "ur": "[ضلع کٹیہار کے مشرقی چھوڑ پر تقریباً ڈیڑھ صدی سے ایک بستی آباد ہے، کہتے ہیں ۷۵۸۱ء کے ہنگامے میں جب بہادر شاہ ظفر کی فوج ناکام و نامراد ہوکر تتر بتر ہوگئی تبھی انہیں میں کا ایک فوجی جرنیل برخاں جو الٰہ آباد کے رہنے والے تھے، جنگلوں، وادیوں اور اونچی نیچی پہاڑیوں کو عبور کرتا بہار کے دور دراز کے اس علاقے کے جنگلوں میں پناہ گزیں ہوا، پھر دیکھتے ہی دیکھتے یہ چھوٹی سی آبادی ایک بڑی بستی میں تبدیل ہوتا چلا گیا اور اسی بستی کا نام صالحپور مہیش پور ہوگیا۔ \nمیں انے اسی بستی کے ایک زمیندار گھرانے میں آنکھیں کھولیں۔ میرے دادا، پردادا پچاسوں بیگھے زمین کے مالک تھے۔ لیکن میرے والد صاحب تک آتے آتے ساری زمینیں غصب و غبن ہو کر، بک بکا کر چند کٹھے تک سمٹ کر رہ گئی۔ جب میں نے دنیا میں آنکھ کھولی مفلسی دروازے پر دستک دے رہی تھی۔ میرے ہوش سنبھالتے ہی والد صاحب بستر مرگ پر چلے گئے، ایک عرصے تک موت و حیات کی کشمکش میں مبتلا رہ کر ایک دن آنکھیں موند لیں اور دوسری دنیا میں جابسے۔ ابھی میری کم عمری کا زمانہ تھا۔ مجھ سے بڑے تین بھائی تھے، میں سب سے چھوٹا تھا۔ گھر کی ذمہ داریاں ماں اور بڑے بھائی کے کاندھوں پر تھی، میرے کھیلنے کودنے کا زمانہ تھا۔ سوئے اتفاق کہ ایک دن اچانک بڑے بھائی بیمار ہوگئے، پھر کبھی صحت یاب نہ ہوسکے، ماں بیچاری کھیتوں میں کام کرکے ہم بھائیوں اور بہن کا پیٹ پال رہی تھی۔ لیکن بڑے بھائی کی بیماری نے ان کی کمر توڑ کر رکھ دی۔ ایک طرف گھر کا خرچ، دوسری طرف بھائی کا علاج و معالجہ زندگی بڑی دشواریوں میں پڑگئی تھی۔ فاقہ کی نوبت آگئی، چارو ناچار مجھے بھی کم عمری ہی میں کام پر لگ جانا پڑا۔ گاؤں ہی کی ایک کوٹھی میں گھریلو کام کاج پر مامور ہو گیا۔ مگر امتحان کے دن اب بھی ختم نہیں ہوئے تھے۔ بڑے بھائی تقریباً ساڑھے تین برس تک بستر مرگ پر رہ کر دنیا سے چل بسے، ایک بار پھر پورا گھرانہ سوگوار ہوگیا۔ \nبچپن انہیں حالات کی ستم ظریفیوں سے نبرد آزما ٹھوکریں کھاتے، اٹھتے بیٹھتے، گرتے پڑتے اور الجھتے سلجھتے گزر گئی۔ اب میں سولہ برس کا ہو گیا تھا، جوانی کی دہلیز پر قدم رکھ چکا تھا، زندگی کی اونچ نیچ اور اتار چڑھاؤ کو سمجھنے لگا تھا۔ گاؤں کے کچھ اہل علم حضرات سے رسم و راہ تھی۔ انکی دیکھا دیکھی پڑھنے لکھنے کا شوق ہوا اور امنگیں دل میں انگڑائیاں لینے لگیں۔ شوق کو پر لگے تو قریب کے ایک گاؤں راجدھانی کے مدرسہ میں اپنے بل بوتے پر داخلہ لے لیا۔ \nمدرسہ کی زندگی سال بھر سے آگے نہ بڑھ سکی۔ اس دوران میں نے مذہب کی بنیادی تعلیم کے ساتھ۔قاعدہ بغدادی اور اردو، ہندی کی چند ابتدائی کتابیں پڑھی۔ تین چار چار پارے ناظرہ قرآن کی تعلیم حاصؒ کی، پھر گاؤں آکر سرکاری اسکول میں داخلہ لے لیا۔ تعلیم کے ساتھ گھریلو کام کاج بھی سنبھالتا تھا، مگر دل تعلیم سے اچاٹ ہو چکا تھا۔ ذہن طرح طرھ کے وسوسوں کی آماجگاہ بنا ہوا تھا۔ ماں کی لاچاری دیکھی نہیں جاتی تھی، نوجوان بیٹوں کے ہوتے ہوئے ان کو محنت مشقت کرنی پڑتی تھی۔ دوسری طرف کچھ منچلے دوستوں نے پٹی پڑھائی، پڑھ لکھ کر کیا ہوگا، نوکری ووکری ملنے والی تو ہے نہیں۔ الغرض دل میں ٹھان لیااب پڑھائی نہیں کرنی ہے۔ دلی جاکر پیسے کمانا ہے۔ لہذا مزدوروں کے ایک قافلے کے ساتھ ہو لیا اور دلّی کی جانب روانہ ہوا۔ اس طرح زندگی حالات کے بحر بیکراں میں بن پتوار ہچکولے کھاتی نامعلوم منزل کی طرف رواں دواں ہوگئی۔ \nدلّی پہنچ کر خوب محنت کی، حالات سے لڑتا بھڑتا رہا۔ زندگی کی گاڑی کو پٹری پر لانے کے لئے تن من کی بازی لگادی۔ وقت کا پہیا گھومتا رہا، دھیرے دھیرے زندگی معمول پر آنے لگی۔ لوگوں سے ملنا جلنا، عالم فاضل، انپڑھ جاہل ہر طرح کے لوگوں سے رسم و راہ ہوئی، ان ہی دنوں محمد افتخار صاحب جو میرے ہی گاؤں کے تھے ان کے گھر جانا ہوا، ان کی ٹیبل پر ”روپ کی شوبھا“ ایک ہندی میگزین پڑا تھا۔ چوتھی پانچویں کلاس تک ہندی پڑھی تھی، اس لئے ہندی روانی کے ساتھ پڑھ سکتا تھا۔ ان صاحب سے میں نے وہ میگزین مانگ لی اور گھر لے آیا۔ رات میں جب مطالعہ کے لئے بیٹھا تو میگزین بڑی دلچسپ لگی۔ میگزین قرآن کی چند آیات کا ترجمہ، کچھ اسلامی موضوعات پر مضامین، قصے کہانیاں، افسانے اور غزلوں پر مشتمل تھا۔ فکری موضوعات تو میری سمجھ سے باہر تھیں البتہ کہانیاں، افسانے اور غزلیں میرے کام کی چیزیں تھیں کہانیوں کو پڑھ کر مزید مطالعہ کا شوق پیدا ہوا اور باضابطہ ہر ماہ ”روپ کی شوبھا“ کا میں خریدار بن گیا۔ اس کے علاوہ جب کبھی بازار جانا ہوتا واپسی پر کوئی نہ کوئی کتاب، میگزین یا رسالہ میرے ہاتھ میں ہوتا۔ دن بھر مزدوری میں لگا رہتا اور رات بھیگتے ہی کتاب لے کر بیٹھ جاتا، پڑھتے پڑھتے کب آنکھ لگ جاتی پتا بھی نہ چلتا۔ \nزندگی یوں ہی بسر ہونے لگی رات مطالعہ میں گزرتی اور صبح ہوتے ہی زندگی کے کاروبار میں مگن ہوجاتا۔ مسلسل کہانیوں کے مطالعہ سے خود کی زندگی بھی ایک کہانی لگنے لگی اور خود سے لکھنے کا جذبہ پنپنے لگا۔ دل میں خیال آتا جب اتنے لوگ لکھ رہے ہیں، ان کی کہانیاں رسالوں میں چھپتی ہیں تو میں کیوں نہیں؟ مجھے بھی لکھنا چاہئے تاکہ میرابھی نام روشن ہو، میں قلمکاروں میں گنا جاؤں۔ آخر کار ایک دن لکھ ہی ڈالی ایک کہانی، جہاں تک مجھے یاد آتا ہے اس کا عنوان”خواہش تری دیدار کی“ تھا، اس کے بعد چند اور کہانیاں لکھیں ”وہ مجھے کیا سمجھتی ہے“،”نظراور نظریہ“ وغیرہ۔ مگر میں کیا مری بساط کیا؟ یہ کہانیاں میرے ذہن کے دریچوں سے نکل کر چند صفحات سے آگے نہ بڑھ سکیں۔ لیکن میں لکھتا رہا، آخر کار وہ دن بھی آیا جب میری پہلی کہانی”حوصلوں پر“ کے عنوان سے ”روپ کی شوبھا“ کے دسمبر ۷۰۰۲ء کے شمارہ میں شائع ہوئی۔ مجھ جیسے ان پڑھ کی کہانی کسی رسالہ میں شائع ہوجانا میرے لئے کسی ایوارڈ سے کم نہیں تھا۔ حوصلہ بڑھا، مزید لکھنے کا شوق ہوا، شوق کو پر لگ گئے، اس کے بعد وقفے وقفے سے میری کہانیاں ”روپ کی شوبھا“، ”سرمایہ ہند“ اور دیگر رسالوں میں شائع ہوئیں۔ \nکہانیوں کے ساتھ ساتھ شاعری پڑھنے کا بھی شوق ہوا، دوسروں کی غزلیں، نظمیں اور گیتوں کو پڑھ کر خود شعرو شاعری کرنے کا جذبہ پیدا ہوا اور شروع کردی تک بندی، عروض، بحر و اوزان اور ردیف و قافیہ کا تو کچھ اتا پتا تھا نہیں، عرصہئ دراز تک تک بندی ہی کو شاعری سمجھ کر صفحات در صفحات سیاہ کر ڈالے اور خود کو بہت بڑا شاعر تصور کرنے لگا۔ ایک دن ایک شعری نشست میں شرکت کا اتفاق ہوا، پھر کیا تھا بھرم کھل ہی گیا اپنی تک بندی کا جب میں کلام سنا کر اپنی نشست پر آیا تو نشست کی صدارت فرمارہے طنزومزاح کے معروف شاعر جناب نشتر امروہی نے اشارے سے اپنے پاس بلایا اور بڑے پیار سے گویو ہوئے ”عزیزم آپ کا خیال بہت اچھا ہے لیکن آپ جو کچھ کہہ رہے ہیں وہ شاعری نہیں ہے۔“ دل پر چوٹ پڑی مگر خاموش رہا۔ نشست کے بعد ایک اور صاحب ملاقات ہوئی، علیک سلیک کے بعد تعارف ہوا۔ انہوں نے پہلے تو میری حوصلہ افزائی فرمائی پھر وہی فرمایا جو نشتر امروہی صاحب فر ما چکے تھے۔کسی استاد شاعر کا دامن تھامنے کا مشورہ دیا۔ دل چھناکے کے ساتھ ٹوٹا مگر ہمت کرکے میں نے بھی عرض کر ہی دیا۔ ”جناب اگر آپ مجھے اپنا شاگر د بنا لیں تو بڑی مہربانی ہوگی۔“ پہلے تو وہ ٹالتے رہے لیکن میرے مسلسل اصرار اور اداسی بھرا چہرہ دیکھ کر وہ مان گئے اور اپنے گھر کا پتہ بتا کر حاضر ہونے کے لئے کہہ کر رخصت ہوگئے۔ اگلے دن جب میں جناب نوشاد ثمر بگراسوی صاحب کے دولت کدہ پر حاضر ہوا، ثمر صاحب بڑی خندہ پیشانی اور خوش مزاجی کے ساتھ ملے۔ چائے ناشتے کے بعد گفتگو کا سلسلہ شروع ہوا، علم عروض اور اصول شاعری پر کافی دیر تک باتیں ہوتی رہیں اور میرے سر کے اوپر سے گزرتی رہیں۔تھوڑی دیر کے بعد میں واپس آگیا۔ آنے جانے کا سلسلہ یونہی چلتا رہا مگر کافی دنوں تک میرے پلے کچھ بھی نہ پڑ سکا۔ ثمر صاحب ایک دن فرمانے لگے، موزوں کلام کہنے کا سب سے آسان طریقہ یہ ہے کہ آپ جو کچھ پڑھیں یا سنیں اس کو گنگنائیں اور اسی طرز پر کہنے کی کوشش کریں، انشاء اللہ تھوڑی محنت کے بعد موزوں کلام کہنا سیکھ جائیں گے، بات دل کو لگی اور شکریہ ادا کرکے گھر آگیا۔ ایک دن ایک فلمی گیت \nدوستو اس زمانے کو کیا ہوگیا \nجس کو چاہا وہی بے وفا ہو گیا \nسن رہا تھا کہ ذہن میں یکایک ایک خیال نمودا ر ہو ا اور غزل کا مطلع بن گیا، دیکھتے ہی دیکھتے پوری غزل مکمل ہوگئی۔ \nراہ پر دشمنوں کے وہ چلنے لگے \nدوست میرے سبھی اب بدلنے لگے \n\nرہنماؤں نے مجھ کو ہے گمراہ کیا \nپاؤں منزل کی جانب جو چلنے لگے \n\nاب محافظ چمن کا میاں کون ہے \nخود ہی مالی گلوں کو مسلنے لگے \n\nعمر بھر میں جنہیں دوست کہتا رہا \nمیری شہرت سے ثانی وہ چلنے لگے\nغزل مکمل ہوئی اور میں بھاگا بھاگا استاد کے پاس پہنچا۔ استاد صاحب غزل پڑھ کر پہلے تو متعجب ہوئے، پھر کہنے لگے ”یہ غزل تمہاری تو نہیں لگ رہی ہے، کہاں سے چوری کر لایا ہے؟“ جب میں نے ان کو یقین دلایا تو بڑئے خوش ہوئے، دعائیں دیں اور حوصلہ افزا کلمات سے نوازا۔ یہاں سے میری شعری سفر کا باضابطہ آغاز ہوا۔ گاڑی دھیرے دھیرے پٹری پر آنے لگی، آخر کار میں کلام کو موزوں کرنا سیکھ گیا۔ \nمیری شاعری میری زندگی کا عکس ہے۔ میری علمی لیاقت اور ادبی سوجھ بوجھ مڈل اسکول کی چوتھی پانچویں کلاس سے کبھی آگے نہیں بڑھی اور نہ ہی مجھے اہل زبان ہونے کا دعویٰ ہے۔ میں نے اپنی آنکھوں سے جو کچھ دیکھا، کانوں سے جو سنا اور زندگی کے تلخ تجربات سے جو کچھ سیکھا اسی کو اپنا موضوع سخن بنایا، نامساعد حالات نے جو کچھ دیا اسی کو لوٹا دیا۔ \nخوش رہ کرے اپنی زندگی غربت میں کاٹ لی \nطابع کسی کے میری ضرورت نہیں ہوئی \n\nاے اندھیرے مجھے تو ڈرائے گا کیا \nحادثوں میں مری تو پلی زندگی \n\nزندگی بھر انا بیچ سکتا نہیں \nمفلسی چھین چاہئے مری زندگی \nجب کبھی غم دوراں سے گھبرایا تو غم جاناں کے دامن میں پناہ لیا۔ \nاس کے سوا کسی سے محبت نہیں ہوئی \nلیکن یہ بات کہنے کی ہمت نہیں ہوئی \n\nاس کی نظریں تو نئے روز نظارے بدلیں \nمیں فقط ایک ہی تصویر کہاں تک دیکھوں \n\nمجھ کو بخشی ہے محبت نے کرامت ایسی \nکوئی دیکھے نہ جہاں تک میں وہاں تک دیکھوں \nگرد چھنٹتے ہی دوبارہ غم دوراں کی طرف لوٹ آتا ہوں ………… ہر سوا ہوا دھواں دھواں لاشوں کا ڈھیر ہے \nایسی کبھی تو شہر کی حالت نہیں ہوئی \n\nتیرے بچے نہ دیں گے سہارا تجھے \nتو بھی ماں باپ کا گر سہارا نہیں \n\nکتنا بھوکا ہے یہ زمانہ بھی \nکھائے چڑیوں کا آب و دانہ بھی \n\nدور حاضر میں آپ کیا جانیں \nکتنا مشکل ہے مسکرانا بھی\nمجھے اپنی خامیوں، کمیوں اور کوتاہیوں کا اعتراف کرنے میں جھجک نہیں، یہی وجہ ہے کہ ہمیشہ یہ کھٹکا لگا رہتا ہے۔ \nکوئی نقاد اگر ناپے گا پیمانے پر \nجتنا شیرازہ ہے لفظوں کا بکھر جائے گا \nاور \nابھی کچھ اور اگاؤ گھاس تم پتھر پہ اے ثانی ؔ\nابھی کچھ لوگ باقی ہیں جو تم کو آزمائیں گے \nمیں شکر گزار ہو ں ان تمام بزرگوں، دوستوں اور خیر خواہوں کا جن کی دعائیں اور نیک خواہشات ہمیشہ شامل حال رہیں اور جو دامے درمے قدمے سخنے اپنے قیمتی مشوروں سے مجھے نوازتے رہے اور ہمیشہ میری رہنمائی فرماتے رہے۔ خاص طور سے میں شکر گزار ہوں اپنے اساتذہ نوشاد ثمر صاحب بگراسوی، مولانا عظیم الدین صاحب قاسمی، حافظ عبد القیوم صاحب، حافظ عبد الحکیم صاحب مرحوم، مولانا اکرام صاحب قاسمی، مولوی شہباز صاحب، ماسٹر کوثر صاحب، ماسٹر ایجول حق صاحب،مولانا حیدر صاحب قاسمی، مولوی منّا صاحب \nسرپرست حضرات جمیل مظہرصاحب سیانوی، مولانا جمیل احمد صاحب رحمانی، ندیم احمدصاحب مورسنڈوی،مفتی عمران صاحب قاسمی، پروفیسر احمد حسن دانش صاحب، احسان صاحب قاسمی، مولانا مکرم صاحب قاسمی، چشمہ فاروقی صاحبہ، مجاز صاحب امروہی، گلفام صاحب شاہجہاں پوری، پروفیسر انور ایرج صاحب، محمد عباس ذوق صاحب مرحوم، ماسٹر علی مرتضیٰ صاحب مرحوم اورخصوصاً محمد عارف، محمد ابوالحسن،محمد شہباز، باجی سیق النساء، شریک ِحیات ثمینہ خاتون ان جانثاروں کا جن کی دعاؤں سے مجھے روشنی ملی۔ \nمیں سپاس گزار ہوں عمران صاحب دھام پوری، صاحب خان ساگر صاحب، عمران کاظمی صاحب،ڈاکٹر معین الدین صاحب،محمد شاہنواز صاحب،مولانا محمد مجتہد اعظم صاحب ندوی، صبیح احمد صاحب،  طالب صاحب سکندر آبادی، امت احد صاحب، شاداب وفاصاحب پورنوی، عذیق الرحمان صارم صاحب، سبطین پروانہ صاحب، مفتی جاویدصاحب قاسمی، مرشد عالم آزاد صاحب،  ڈاکٹر طیش صاحب، مفتی سلیم شوق صاحب پورنوی، قیصر جمیل صاحب ندوی، مولانا ممتاز صاحب اشاعتی، نجیب الدین صاحب، صباح الدین صاحب، اصیل الدین صاحب، شمشاد ضیاء صاحب، قاری شبیر صاحب، حافظ نوشاد صاحب، ضمیر الدین صاحب، عبد الماجد صاحب عرف شاکر، مفتی مہتاب صاحب مرحوم، ماسٹر تنویز صاحب، انیس الرحمان صاحب، حافظ نظام الدین صاحب، ماسٹر عبد المنان صاحب، مرسل احمد شاہ صاحب مرحوم اور دیگر احباب کا جنہوں نے ہمیشہ میری خیر خواہی چاہی اور حوصلہ افزائی فرماتے رہے۔ \nاخیر میں اہل علم حضرات سے دست بستہ عرض ہے کہ جس کسی کو میرے کلام میں کوئی کمی، خامی یا غلطی نظر آئے توفوراً مطلع فرمائیں۔ آپ کی قیمتی مشوروں کی قدر کی جائے گی اور اپنی اصلاح کی بھر پور کوشش کی جائے گی۔ \nکہاں میں اور کہاں یہ نکت گل \nنسیم صبح تیری مہربانی \n]",
  "en": "[For about one and a half centuries, a settlement has thrived on the eastern edge of Katihar district. It is said that during the upheaval of 1857, when Bahadur Shah Zafar’s army was defeated and scattered, a military general named Barkhan from Allahabad sought refuge in the forests of this remote area of Bihar, crossing jungles, valleys, and rugged hills. In no time, this small settlement grew into a large village named Salehpur Maheshpur.\n\nI opened my eyes in a zamindar family of this very village. My grandfather and great-grandfather owned dozens of bighas of land. However, by the time my father inherited it, the land was either usurped or sold off, shrinking to just a few kathas. When I came into this world, poverty was knocking at our door. As I began to understand life, my father fell ill and, after a long struggle between life and death, passed away to the next world. I was still young then, the youngest of four brothers. The responsibilities of the household fell on my mother and elder brother, while I was still in the age of play and mischief. By a twist of fate, my elder brother fell ill and never recovered. My poor mother toiled in the fields to feed us siblings, but my brother’s illness broke her spirit. With household expenses on one side and his treatment on the other, life became extremely challenging. Starvation loomed, and I was forced to work at a young age. I took up domestic work at a local mansion. Yet, the trials were far from over. After three and a half years on his deathbed, my elder brother passed away, plunging the entire household into grief once again.\n\nMy childhood passed grappling with these harsh circumstances, stumbling and rising, falling and untangling. By the time I turned sixteen, I had stepped into the threshold of youth and began to understand life’s ups and downs. I grew close to some learned people in the village, and their influence sparked a passion for reading and writing. Ambitions stirred in my heart. With this zeal, I enrolled myself in a madrasa in a nearby village called Rajdhani. \n\nMy madrasa life lasted barely a year. During this time, I studied the basics of religion, the Qaida Baghdadi, and a few introductory Urdu and Hindi books. I also memorized three to four parts of the Quran by sight. Later, I returned to the village and joined a government school. While continuing my education, I also managed household chores, but my heart grew weary of studies. My mind became a battleground of doubts. Seeing my mother’s helplessness was unbearable—she had to toil despite having young sons. Meanwhile, some wayward friends convinced me that studying was futile since jobs were scarce. I resolved not to study anymore and decided to go to Delhi to earn money. Thus, I joined a group of laborers and set off for Delhi. My life, like a boat without an oar, drifted aimlessly in the vast ocean of circumstances.\n\nIn Delhi, I worked hard, battling life’s challenges. I poured my heart and soul into getting life back on track. Time turned, and gradually, life normalized. I met all sorts of people—scholars, illiterates, and everyone in between. During those days, I visited Mohammad Iftikhar, a man from my village. On his table, I found a Hindi magazine called “Roop Ki Shobha.” Having studied Hindi up to the fourth or fifth grade, I could read it fluently. I borrowed the magazine and brought it home. That night, as I sat to read, I found it fascinating. The magazine contained translations of Quranic verses, articles on Islamic topics, stories, short stories, and ghazals. While intellectual topics were beyond my grasp, the stories, short stories, and ghazals captivated me. Reading them ignited a deeper passion for literature, and I became a regular buyer of “Roop Ki Shobha.” Whenever I visited the market, I returned with a book, magazine, or journal. I labored all day and sat with a book at night, often falling asleep while reading without even realizing it.\n\nLife went on like this—nights spent reading, mornings immersed in the grind of daily work. Continuous reading of stories made my own life feel like one, and a desire to write began to grow. I thought, if so many people write and their stories get published, why can’t I? I should write to make a name for myself among writers. One day, I finally wrote a story titled “Khawahish Tere Deedar Ki.” I followed it with a few more, like “Woh Mujhe Kya Samajhti Hai” and “Nazar Aur Nazariya.” But what was my stature? These stories, born from my imagination, couldn’t go beyond a few pages. Yet, I kept writing. Finally, the day came when my first story, “Hauslon Par,” was published in the December 2007 issue of “Roop Ki Shobha.” For an uneducated person like me, having a story published in a magazine was no less than winning an award. My confidence grew, and my passion for writing soared. Thereafter, my stories were published intermittently in “Roop Ki Shobha,” “Sarmaya Hind,” and other magazines.\n\nAlongside stories, I developed a love for reading poetry. Reading others’ ghazals, poems, and songs inspired me to try poetry myself. I began with takbandi (free verse), unaware of prosody, meters, or rhyme schemes. For a long time, I considered my free verse as poetry, filling pages upon pages and fancying myself a great poet. One day, I attended a poetry gathering, and my illusion shattered. After reciting my work and returning to my seat, the presiding poet, the renowned satirist Nashtar Amrohvi, called me over and kindly said, “Dear, your thoughts are good, but what you’re saying isn’t poetry.” It stung, but I stayed silent. After the event, another gentleman echoed Nashtar Sahib’s words, encouraging me but advising me to learn from a mentor. Though heartbroken, I mustered the courage to say, “Sir, if you take me as your student, it would be a great favor.” He hesitated but, seeing my persistence and sad face, agreed, gave me his address, and asked me to visit.\n\nThe next day, I visited Naushad Samar Bagravi Sahib. He welcomed me warmly, and after tea, we discussed prosody and poetic principles for hours—most of which went over my head. I kept visiting, but for days, I grasped little. One day, Samar Sahib said, “The easiest way to write metrical poetry is to hum what you read or hear and try to compose in that style. With a little effort, you’ll learn to write metrical poetry.” His advice struck a chord, and I thanked him and left. One day, while listening to a film song:\nDosto is zamane ko kya ho gaya\nJis ko chaha wahi be wafa ho gaya\nAn idea sparked, and I composed the opening couplet of a ghazal. Before I knew it, the entire ghazal was complete:\nRaah par dushmanon ke woh chalne lage\nDost mere sabhi ab badalne lage\nRehnumaon ne mujh ko hai gumrah kiya\nPaon manzil ki janib jo chalne lage\nAb muhafiz chaman ka miyan kon hai\nKhud hi mali gulon ko masalne lage\nUmr bhar mein jinhen dost kehta raha\nMeri shohrat se Sani woh jalne lage\nI rushed to my mentor. He read the ghazal, surprised, and teased, “This doesn’t seem like your work. Where did you steal it from?” After I convinced him, he was delighted, blessed me, and encouraged me. This marked the formal beginning of my poetic journey. Slowly, I learned to write metrical poetry.\n\nMy poetry reflects my life. My academic and literary knowledge never advanced beyond the fourth or fifth grade, nor do I claim to be a master of language. What I saw with my eyes, heard with my ears, and learned from life’s bitter experiences became the themes of my poetry. Whatever unfavorable circumstances gave me, I returned in my verses:\nKhush rah kar apni zindagi ghurbat mein kaat li\nTaba kisi ke meri zarurat nahin hui\nAye andhere mujhe to daraega kya\nHadison mein meri to pali zindagi\nZindagi bhar ana bech sakta nahin\nMuflisi chheen chahe meri zindagi\nWhenever overwhelmed by worldly sorrows, I sought refuge in the embrace of love:\nUs ke siwa kisi se mohabbat nahin hui\nLekin yeh baat kehne ki himmat nahin hui\nUs ki nazrein to naye roz nazare badlein\nMain faqat ek hi tasveer kahan tak dekhun\nMujh ko bakhshi hai mohabbat ne karamat aisi\nKoi dekhe na jahan tak main wahan tak dekhun\nWhen the dust settles, I return to the sorrows of the world:\nHar so hawa dhuan dhuan lashon ka dher hai\nAisi kabhi to shehr ki halat nahin hui\nTere bache na denge sahara tujhe\nTu bhi maa baap ka gar sahara nahin\nKitna bhoka hai yeh zamana bhi\nKhaye chiriyon ka aab o dana bhi\nDaur hazir mein aap kya janein\nKitna mushkil hai muskurana bhi\nI have no hesitation in admitting my flaws and shortcomings, which is why I always fear:\nKoi naqqad agar nape ga paimane par\nJitna sherazah hai lafzon ka bikhar jayega\nAnd:\nAbhi kuch aur ugao ghaas tum patthar pe aye Sani\nAbhi kuch log baqi hain jo tum ko aazmayenge\nI am grateful to all the elders, friends, and well-wishers whose prayers and support have always been with me, guiding me with their valuable advice. I am especially thankful to my teachers: Naushad Samar Bagravi Sahib, Maulana Azeemuddin Sahib Qasmi, Hafiz Abdul Qayoom Sahib, Hafiz Abdul Hakeem Sahib (late), Maulana Ikram Sahib Qasmi, Maulvi Shahbaz Sahib, Master Kausar Sahib, Master Ejazul Haq Sahib, Maulana Haider Sahib Qasmi, Maulvi Munna Sahib; and patrons: Jameel Mazhar Sahib Sayanvi, Maulana Jameel Ahmad Sahib Rahmani, Nadeem Ahmad Sahib Morasandvi, Mufti Imran Sahib Qasmi, Professor Ahmad Hasan Danish Sahib, Ehsan Sahib Qasmi, Maulana Makram Sahib Qasmi, Cheshma Farooqui Sahiba, Mufazzar Sahib Amrohvi, Gulfam Sahib Shahjahanpuri, Professor Anwar Iraj Sahib, Mohammad Abbas Zauq Sahib (late), Master Ali Murtaza Sahib (late), and especially Mohammad Arif, Mohammad Abul Hasan, Mohammad Shahbaz, Baji Saiqa-un-Nisa, and my life partner Sameena Khatoon, whose prayers illuminated my path.\n\nI am also grateful to Imran Sahib Dhampuri, Saheb Khan Sagar Sahib, Imran Kazmi Sahib, Dr. Moinuddin Sahib, Mohammad Shahnawaz Sahib, Maulana Mohammad Mujtahid Azam Sahib Nadvi, Sabih Ahmad Sahib, Talib Sahib Sikandrabadvi, Amat Ahad Sahib, Shadab Wafa Sahib Purnvi, Aziqur Rahman Sarim Sahib, Subtain Parwana Sahib, Mufti Javed Sahib Qasmi, Murshid Alam Azad Sahib, Dr. Taish Sahib, Mufti Saleem Shauq Sahib Purnvi, Qaiser Jameel Sahib Nadvi, Maulana Mumtaz Sahib Ashaati, Najeebuddin Sahib, Sabahuddin Sahib, Asiluddin Sahib, Shamshad Zia Sahib, Qari Shabbir Sahib, Hafiz Naushad Sahib, Zameeruddin Sahib, Abdul Majid Sahib alias Shaker, Mufti Mehtab Sahib (late), Master Tanweez Sahib, Aneesur Rahman Sahib, Hafiz Nizamuddin Sahib, Master Abdul Mannan Sahib, Marsal Ahmad Shah Sahib (late), and other friends who always wished me well and encouraged me.\n\nLastly, I humbly request scholars and learned individuals to point out any flaws, errors, or shortcomings in my work. Your valuable suggestions will be appreciated, and I will strive to improve.\nKahan main aur kahan yeh nukta gul\nNaseem subah teri meherbani]",
  "hi": "[कटिहार जिले के पूर्वी छोर पर लगभग डेढ़ सदी से एक बस्ती बसी हुई है। कहा जाता है कि 1857 के विद्रोह के दौरान, जब बादशाह जफर की सेना असफल होकर तितर-बितर हो गई, तब इलाहाबाद के रहने वाले एक सैन्य जनरल बरखान ने जंगलों, घाटियों और ऊँची-नीची पहाड़ियों को पार करते हुए बिहार के इस दूर-दराज इलाके के जंगलों में शरण ली। देखते ही देखते यह छोटी-सी बस्ती एक बड़ी बस्ती में बदल गई, और इसी बस्ती का नाम सालेहपुर महेशपुर हो गया।\n\nमैंने इसी बस्ती के एक जमींदार परिवार में आँखें खोलीं। मेरे दादा और परदादा पचासों बीघा जमीन के मालिक थे। लेकिन मेरे पिता के समय तक सारी जमीनें या तो हड़प ली गईं या बिक गईं, और कुछ कट्ठों तक सिमट कर रह गईं। जब मैंने इस दुनिया में आँखें खोलीं, तो गरीबी दरवाजे पर दस्तक दे रही थी। जब मैं समझने लायक हुआ, मेरे पिता बीमार पड़ गए और लंबे समय तक जिंदगी और मौत की कशमकश में रहने के बाद एक दिन आँखें मूंद लीं और दूसरी दुनिया में चले गए। तब मैं अभी छोटा था, चार भाइयों में सबसे छोटा। घर की जिम्मेदारियाँ माँ और बड़े भाई के कंधों पर थीं, और मैं खेलने-कूदने की उम्र में था। संयोगवश, एक दिन अचानक मेरा बड़ा भाई बीमार पड़ गया और कभी ठीक नहीं हो सका। मेरी बेचारी माँ खेतों में काम करके हम भाई-बहनों का पेट पाल रही थी। लेकिन बड़े भाई की बीमारी ने उनकी कमर तोड़ दी। एक तरफ घर का खर्च, दूसरी तरफ भाई का इलाज—जिंदगी बहुत मुश्किलों में पड़ गई थी। भुखमरी की नौबत आ गई, और मजबूरन मुझे भी कम उम्र में काम शुरू करना पड़ा। मैं गाँव की एक कोठी में घरेलू कामकाज के लिए नियुक्त हो गया। फिर भी, इम्तिहान के दिन खत्म नहीं हुए थे। साढ़े तीन साल तक बिस्तर पर रहने के बाद मेरे बड़े भाई का देहांत हो गया, और पूरा परिवार एक बार फिर गम में डूब गया।\n\nमेरा बचपन इन हालात की सितमजरीफियों से जूझते, ठोकरें खाते, उठते-बैठते, गिरते-पड़ते और उलझते-सुलझते बीत गया। अब मैं सोलह साल का हो गया था, जवानी की दहलीज पर कदम रख चुका था, और जिंदगी के उतार-चढ़ाव को समझने लगा था। गाँव के कुछ विद्वान लोगों से मेरा परिचय था। उनकी देखादेखी पढ़ने-लिखने का शौक जागा, और दिल में महत्वाकांक्षाएँ अंगड़ाइयाँ लेने लगीं। इस शौक को पंख लगे, और मैंने अपने बूते पर पास के एक गाँव राजधानी के मदरसे में दाखिला ले लिया।\n\nमदरसे की जिंदगी एक साल से ज्यादा नहीं चल सकी। इस दौरान मैंने धर्म की बुनियादी तालीम के साथ-साथ कायदा बगदादी और कुछ शुरुआती उर्दू व हिंदी की किताबें पढ़ीं। मैंने नाज़िरा कुरान के तीन-चार परे पढ़े। फिर गाँव लौटकर सरकारी स्कूल में दाखिला ले लिया। पढ़ाई के साथ-साथ घर के काम भी संभालता था, लेकिन मेरा मन पढ़ाई से ऊब चुका था। दिमाग तरह-तरह की शंकाओं का अड्डा बन गया था। माँ की लाचारी देखी नहीं जाती थी—जवान बेटों के होते हुए भी उन्हें मेहनत-मशक्कत करनी पड़ रही थी। दूसरी तरफ कुछ आवारा दोस्तों ने समझाया कि पढ़-लिखकर क्या होगा, नौकरी तो मिलने से रही। आखिरकार, मैंने मन बना लिया कि अब पढ़ाई नहीं करनी। दिल्ली जाकर पैसे कमाने हैं। सो, मैं मजदूरों के एक काफिले के साथ दिल्ली की ओर रवाना हो गया। इस तरह मेरी जिंदगी हालात के बेकराँ समंदर में बिना पतवार के डगमगाती, अनजान मंजिल की ओर बढ़ चली।\n\nदिल्ली पहुँचकर मैंने खूब मेहनत की, हालात से लड़ता-भिड़ता रहा। जिंदगी की गाड़ी को पटरी पर लाने के लिए तन-मन की बाजी लगा दी। समय का पहिया घूमता रहा, और धीरे-धीरे जिंदगी सामान्य होने लगी। लोगों से मिलना-जुलना शुरू हुआ—विद्वान, अनपढ़, हर तरह के लोगों से परिचय हुआ। उन दिनों मेरे गाँव के ही मोहम्मद इफ्तिखार साहब के घर जाना हुआ। उनकी मेज पर “रूप की शोभा” नामक एक हिंदी पत्रिका पड़ी थी। मैंने चौथी-पाँचवीं कक्षा तक हिंदी पढ़ी थी, इसलिए उसे धाराप्रवाह पढ़ सकता था। मैंने उनसे वह पत्रिका माँग ली और घर ले आया। रात में जब पढ़ने बैठा, तो पत्रिका बहुत दिलचस्प लगी। इसमें कुरान की कुछ आयतों का अनुवाद, इस्लामी विषयों पर लेख, कहानियाँ, अफसाने और ग़ज़लें थीं। बौद्धिक विषय मेरी समझ से बाहर थे, लेकिन कहानियाँ, अफसाने और ग़ज़लें मेरे काम की थीं। उन्हें पढ़कर और पढ़ने का शौक जागा, और मैं नियमित रूप से “रूप की शोभा” खरीदने लगा। इसके अलावा, जब भी बाजार जाता, कोई न कोई किताब, पत्रिका या रिसाला मेरे हाथ में होता। दिनभर मजदूरी करता और रात होते ही किताब लेकर बैठ जाता। पढ़ते-पढ़ते कब आँख लग जाती, पता ही नहीं चलता।\n\nजिंदगी यों ही बीतने लगी—रातें पढ़ने में गुजरतीं और सुबह होते ही जिंदगी के कारोबार में मग्न हो जाता। लगातार कहानियों के अध्ययन से मेरी अपनी जिंदगी भी एक कहानी-सी लगने लगी, और अपने आप लिखने का जज़्बा पनपने लगा। मैं सोचता, जब इतने लोग लिख रहे हैं, उनकी कहानियाँ पत्रिकाओं में छप रही हैं, तो मैं क्यों नहीं? मुझे भी लिखना चाहिए ताकि मेरा नाम भी लेखकों में शुमार हो। आखिरकार, एक दिन मैंने एक कहानी लिख डाली। जहाँ तक मुझे याद है, उसका शीर्षक था “ख्वाहिश तेरे दीदार की”। इसके बाद मैंने कुछ और कहानियाँ लिखीं—“वह मुझे क्या समझती है”, “नज़र और नज़रिया” वगैरह। लेकिन मेरी औकात क्या थी? ये कहानियाँ मेरे दिमाग के झरोखों से निकलकर कुछ पन्नों से आगे नहीं बढ़ सकीं। फिर भी, मैं लिखता रहा। आखिरकार वह दिन आया जब मेरी पहली कहानी “हौसलों पर” “रूप की शोभा” के दिसंबर 2007 के अंक में छपी। मेरे जैसे अनपढ़ की कहानी किसी पत्रिका में छप जाना मेरे लिए किसी पुरस्कार से कम नहीं था। हौसला बढ़ा, और लिखने का शौक और बढ़ गया। इसके बाद समय-समय पर मेरी कहानियाँ “रूप की शोभा”, “सरमाया हिंद” और अन्य पत्रिकाओं में छपने लगीं।\n\nकहानियों के साथ-साथ शायरी पढ़ने का भी शौक जागा। दूसरों की ग़ज़लें, नज़्में और गीत पढ़कर खुद शायरी करने का जज़्बा पैदा हुआ। मैंने तकबंदी शुरू की। उरूज़, बहर, वज़न और रदीफ-काफिया का तो कुछ पता ही नहीं था। लंबे समय तक मैं तकबंदी को ही शायरी समझकर पन्ने दर पन्ने काले करता रहा और खुद को बहुत बड़ा शायर समझने लगा। एक दिन एक काव्य गोष्ठी में शामिल होने का मौका मिला। वहाँ मेरा भ्रम टूट गया। अपना काव्य सुनाकर जब मैं अपनी सीट पर लौटा, तो गोष्ठी की अध्यक्षता कर रहे विख्यात व्यंग्यकार नश्तर अमरोहवी ने मुझे पास बुलाया और बड़े प्यार से कहा, “प्रिय, तुम्हारे विचार बहुत अच्छे हैं, लेकिन जो तुम कह रहे हो, वह शायरी नहीं है।” दिल पर चोट लगी, लेकिन मैं चुप रहा। गोष्ठी के बाद एक और सज्जन से मुलाकात हुई। नमस्ते-सलाम के बाद परिचय हुआ। उन्होंने पहले तो मेरी हौसला-अफजाई की, फिर वही कहा जो नश्तर साहब कह चुके थे। उन्होंने किसी गुरु शायर का दामन थामने की सलाह दी। दिल टूट गया, लेकिन हिम्मत करके मैंने कह डाला, “जनाब, अगर आप मुझे अपना शिष्य बना लें, तो बड़ी मेहरबानी होगी।” पहले तो वे टालते रहे, लेकिन मेरे बार-बार आग्रह और उदास चेहरा देखकर वे मान गए और अपना पता देकर आने को कहकर चले गए। अगले दिन मैं नौशाद समर बगरासवी साहब के घर पहुँचा। उन्होंने बड़े गर्मजोशी और खुशमिजाजी से मुलाकात की। चाय-नाश्ते के बाद बातचीत शुरू हुई। उरूज़ और शायरी के सिद्धांतों पर देर तक चर्चा हुई, जो मेरे सिर के ऊपर से गुजर गई। कुछ देर बाद मैं लौट आया। आने-जाने का सिलसिला चलता रहा, लेकिन कई दिनों तक मुझे कुछ समझ नहीं आया। एक दिन समर साहब ने कहा, “मोज़ूं काव्य कहने का सबसे आसान तरीका यह है कि तुम जो पढ़ो या सुनो, उसे गुनगुनाओ और उसी अंदाज में कहने की कोशिश करो। इंशा अल्लाह, थोड़ी मेहनत के बाद तुम मोज़ूं काव्य कहना सीख जाओगे।” उनकी बात दिल को लगी, और मैं शुक्रिया अदा करके घर आ गया। एक दिन एक फिल्मी गीत सुन रहा था:\n\n\nदोस्तों इस ज़माने को क्या हो गया\nजिस को चाहा वही बेवफा हो गया\n\nअचानक एक खयाल आया और ग़ज़ल का मतला बन गया। देखते ही देखते पूरी ग़ज़ल पूरी हो गई:\n\nराह पर दुश्मनों के वो चलने लगे\nदोस्त मेरे सभी अब बदलने लगे\n\nरहनुमाओं ने मुझ को है गुमराह किया\nपाँव मंजिल की जानिब जो चलने लगे\n\nअब मुहाफिज़ चमन का मियाँ कौन है\nखुद ही माली गुलों को मसलने लगे\n\nउम्र भर में जिन्हें दोस्त कहता रहा\nमेरी शोहरत से सानी वो जलने लगे\n\nग़ज़ल पूरी हुई, और मैं दौड़ता हुआ अपने गुरु के पास पहुँचा। उन्होंने ग़ज़ल पढ़ी, पहले तो हैरान हुए, फिर मजाक में बोले, “यह ग़ज़ल तुम्हारी नहीं लग रही। कहाँ से चुराई है?” जब मैंने उन्हें यकीन दिलाया, तो वे बहुत खुश हुए, दुआएँ दीं और हौसला-अफजाई की। यहीं से मेरे काव्य सफर की औपचारिक शुरुआत हुई। धीरे-धीरे मैंने मोज़ूं काव्य कहना सीख लिया।\n\nमेरी शायरी मेरी जिंदगी का प्रतिबिंब है। मेरी शैक्षिक और साहित्यिक योग्यता मिडिल स्कूल की चौथी-पाँचवीं कक्षा से आगे नहीं बढ़ी, और न ही मैं दावा करता हूँ कि मैं भाषा का विशेषज्ञ हूँ। मैंने अपनी आँखों से जो देखा, कानों से जो सुना, और जिंदगी के कड़वे अनुभवों से जो सीखा, उसी को अपनी शायरी का विषय बनाया। नामुनासिब हालात ने जो कुछ दिया, मैंने उसे ही लौटा दिया:\n\nखुश रह कर अपनी ज़िंदगी ग़ुरबत में काट ली\nताबा किसी के मेरी ज़रूरत नहीं हुई\n\nअए अंधेरे मुझे तो डराएगा क्या\nहादिसों में मेरी तो पली ज़िंदगी\n\nज़िंदगी भर अना बेच सकता नहीं\nमुफलिसी छीन चाहे मेरी ज़िंदगी\n\nजब भी जमाने के गमों से घबरा गया,\n\n मैंने प्रेम के आलिंगन में पनाह माँगी:\n\nउस के सिवा किसी से मोहब्बत नहीं हुई\nलेकिन यह बात कहने की हिम्मत नहीं हुई\n\nउस की नज़रें तो नए रोज़ नज़ारे बदलें\nमैं फ़क़त एक ही तस्वीर कहाँ तक देखूँ\n\nमुझ को बख्शी है मोहब्बत ने करामत ऐसी\nकोई देखे न जहाँ तक मैं वहाँ तक देखूँ\n\nजब धूल छँटती है, तो मैं जमाने के गमों की ओर लौट आता हूँ:\n\nहर सो हवा धुआँ धुआँ लाशों का ढेर है\nऐसी कभी तो शहर की हालत नहीं हुई\n\nतेरे बच्चे न देंगे सहारा तुझे\nतू भी माँ बाप का गर सहारा नहीं\n\nकितना भूखा है यह ज़माना भी\nखाए चिड़ियों का आब ओ दाना भी\n\nदौर हाज़िर में आप क्या जानें\nकितना मुश्किल है मुस्कुराना भी\n\nमुझे अपनी खामियों, कमियों और गलतियों को स्वीकार करने में कोई हिचक नहीं है, यही वजह है कि हमेशा यह डर बना रहता है:\n\nकोई नक्काद अगर नापेगा पैमाने पर\nजितना शेराज़ा है लफ्ज़ों का बिखर जाएगा\n\nऔर:\nअभी कुछ और उगाओ घास तुम पत्थर पे अए सानी\nअभी कुछ लोग बाकी हैं जो तुम को आजमाएंगे\n\nमैं उन सभी बुजुर्गों, दोस्तों और शुभचिंतकों का आभारी हूँ, जिनकी दुआएँ और शुभकामनाएँ हमेशा मेरे साथ रही हैं और जिन्होंने अपने कीमती सुझावों से मेरा मार्गदर्शन किया। मैं विशेष रूप से अपने गुरुओं का आभारी हूँ: नौशाद समर बगरासवी साहब, मौलाना अज़ीमुद्दीन साहब कासमी, हाफिज़ अब्दुल कय्यूम साहब, हाफिज़ अब्दुल हकीम साहब (स्वर्गीय), मौलाना इकराम साहब कासमी, मौलवी शहबाज़ साहब, मास्टर कौसर साहब, मास्टर एजाज़ुल हक साहब, मौलाना हैदर साहब कासमी, मौलवी मुन्ना साहब; और संरक्षकों का: जमीला मज़हर साहब सायनवी, मौलाना जमीला अहमद साहब रहमानी, नदीम अहमद साहब मौरसंडवी, मुफ्ती इमरान साहब कासमी, प्रोफेसर अहमद हसन दानिश साहब, एहसान साहब कासमी, मौलाना मकरम साहब कासमी, चश्मा फारूकी साहिबा, मुफज़्ज़र साहब अमरोहवी, गुलफाम साहब शाहजहाँपुरी, प्रोफेसर अनवर इरज साहब, मोहम्मद अब्बास ज़ौक साहब (स्वर्गीय), मास्टर अली मुर्तजा साहब (स्वर्गीय), और विशेष रूप से मोहम्मद आरिफ, मोहम्मद अबुल हसन, मोहम्मद शहबाज़, बाजी सायका-उन-निसा, और मेरी जीवनसाथी समीना खातून, जिनकी दुआओं ने मेरा मार्ग रोशन किया।\n\nमैं इमरान साहब धामपुरी, साहब खान सागर साहब, इमरान काज़मी साहब, डॉ. मुईनुद्दीन साहब, मोहम्मद शाहनवाज़ साहब, मौलाना मोहम्मद मुज्तहिद आज़म साहब नदवी, सबीह अहमद साहब, तालिब साहब सिकंदरबादी, अमत अहद साहब, शादाब वफा साहब पूर्णवी, अज़ीकुर रहमान सारीम साहब, सिब्तैन परवाना साहब, मुफ्ती जावेद साहब कासमी, मुर्शिद आलम आज़ाद साहब, डॉ. तैश साहब, मुफ्ती सलीम शौक साहब पूर्णवी, कैसर जमीला साहब नदवी, मौलाना मम्ताज़ साहब अशायती, नजीबुद्दीन साहब, सबाहुद्दीन साहब, आसिलुद्दीन साहब, शमशाद ज़िया साहब, कारी शब्बीर साहब, हाफिज़ नौशाद साहब, ज़मीरुद्दीन साहब, अब्दुल माजिद साहब उर्फ शाकिर, मुफ्ती मेहताब साहब (स्वर्गीय), मास्टर तनवीज़ साहब, अनीसुर रहमान साहब, हाफिज़ निज़ामुद्दीन साहब, मास्टर अब्दुल मन्नान साहब, मरसाल अहमद शाह साहब (स्वर्गीय), और अन्य मित्रों का आभारी हूँ, जिन्होंने हमेशा मेरा भला चाहा और मेरा हौसला बढ़ाया।\n\nअंत में, विद्वानों से हाथ जोड़कर निवेदन है कि मेरे काव्य में कोई कमी, खामी या गलती दिखे, तो कृपया तुरंत बताएँ। आपके कीमती सुझावों की कद्र की जाएगी, और मैं अपनी सुधार की पूरी कोशिश करूँगा।\nकहाँ मैं और कहाँ यह नुक्ता गुल\nनसीम सुबह तेरी मेहरबानी]"
}
},
{
"id": 3,
"title": {
"ur": "عکسِ ثانی- شعرِ لافانی",
"en": "Aks-e-Sani: Immortal Poetry",
"hi": "अक्स-ए-सानी: अमर शायरी"
},
"author": {
"ur": "ڈاکٹر مقصود جعفری (نیو یارک)\ndrmaqsoodjafri@gmail.com\nWhatsApp 0092-3349556670",
"en": "Dr. Maqsood Jafri (New York)\ndrmaqsoodjafri@gmail.com\nWhatsApp 0092-3349556670",
"hi": "डॉ. मकसूद जाफरी (न्यू यॉर्क)\ndrmaqsoodjafri@gmail.com\nव्हाट्सएप 0092-3349556670"
},
"content": {
"ur": "[نور الدین ثانی بندۂ عرفانی اور شاعرِ وجدانی ہیں۔ آپ کا تعلق صالح پور، پھلکا، کٹہیار، بہار بھارت سے ہے۔“ عکسِ ثانی”اُن کا مجموعہ کلام ہے۔ کتاب پر میری رائے کے خواستگار ہیں۔ بنیادی طور پر غزل کے شاعر ہیں۔ غزل تشبیہات و استعارات اور تلمیحات و اشاریت کی علم بردار ہے۔ غنائیت غزل کی خصوصیّت ہے۔ غزل ہماری تہذیب و تمدّن کی نمایندہ ہے۔ غزل روحِ شاعری اور آئینہ زندگی ہے۔ غزل ذاتی، آفاقی، سماجی، سیاسی اور انقلابی افکار کا اظہار یہ ہے۔ اردو ادب کے ممتاز نقاد نظیر صدیقی رقم طراز ہیں -“ غزل میں مشرق و مغرب کے مزاج اور انسانی فطرت کے اسرار و رموز کے اظہار کی جس قدر گنجائش ہے وہ شاید کسی اور صنف میں ممکن نہیں“- ایک زمانہ تھا جب اردو شاعری کا ابتدائی دور تھا۔ ولی دکنی سے لے کر مرزا غالب تک جب اردو شاعری پہنچی تو غالب کو کہنا پڑا:\nفارسی بین تا ببینی نقش ہائے رنگ رنگ \nبُگذر از مجموعہ اردو کہ بی رنگِ من است \nلیکن آج جب ہم دور جدید کے اردو شعراء کا مطالعہ کرتے ہیں تو ہم ببانگِ دہل یہ اعلان کرنے میں حق بجانب ہیں کہ اب اردو شاعری کا دامن بہت وسیع ہے۔ مجھے نور الدین ثانی کی غزلیات نے مسحور و مخمور کر دیا۔ اخلاص شاعری کی بنیاد ہے۔ میں نے اِن کی غزلیات میں بوئے خلوص پائی جس سے اِن کی شاعری سوز و ساز سے معمور ہے۔ اِن کی غزلوں میں نغماتی آہنگ اور طلسماتی رنگ ہے۔ جیسے اِن کی طبعِ حسّاس سادہ ہے ویسے ہی اِن کی شاعری کی زبان سادہ ہے۔ اسلوب میں روانی اور فکر میں تابانی ہے۔ آپ مذہبی اور اخلاقی روایات سے وابستہ ہیں گویا اِن کی شاعری بقولِ علامہ اقبال“ جزویست از پیمبری”والا معاملہ ہے۔ داستانِ ہجر و وصال اور ذکرِ حسن و عشق شاعری کا جزوی لا ینفک ہے جو کہ وارداتِ قلبی ہے اور اہلِ دل کا سرمایہ جاں ہے۔ اِن کے کئی اشعار پڑھ کر بے ساختہ کہنا پڑتا ہے کہ”کرشمہ دامنِ دل میکشد کہ جا اینجاست“۔\n     آپ کا بچپن نہایت غربت و عُسرت میں گذرا۔ فاقہ کشی، کسمپرسی،اور افسردگی زندگی کا اثاثہ رہا- مزدوری کرتے رہے۔ حادثاتِ زمانہ اور حوادثِ زندگی نے حسّاس بنا دیا اور یہ ذہنی اور قلبی کیفیّت اِن کے اشعار میں نمایاں ہے۔ احسان دانش مزدوری کرتے رہے۔ اُن کے کلام میں مزدوروں، مجبوروں اور مقہوروں پر اشعار کی فراوانی ہے۔ اُنہیں“ شاعرِ مزدور”کہا جاتا ہے۔ میری نظر میں نور الدین ثانی آج کے عہد کے“ شاعرِ مزدورِ ثانی“ ہیں۔ اِن کا تخلص بھی ثانی ہے۔ اِن کے کلام کے مطالعہ کے بعد تین موضوعات اِن کے کلام کے محور ہیں۔ رومانوی، انقلابی اور سیاسی۔ \nچند رومانوی اشعار سنیے اور سر دْھنیے:\nکوئی شکوہ نہیں زمانے سے\nدل تو ٹوٹا ہے دل لگانے سے\nقفس میں جب پرندہ تڑپتا رہتا ہے \nکسی کی یاد میں ایسے مچل رہا ہوں میں \nغربت و جہالت تیسری دنیا کا مقّدر بن چُکی ہیں۔ مغربی استعمار و استبداد نے ہمیں ذلّت و ضلالت اور نفرت و نکبت کے دامِ ہمرنگِ زمیں میں مقّید کر دیا۔ اِن کے بعض اشعار انسانی ضمیر کو یکسر جھنجھوڑ دیتے ہیں۔\nچند انقلابی اشعار ملاحظہ کیجئے:\nبھوک بچّوں کی ماں سے نہ دیکھی گئی \nآبرو بیچ دی مْفلسی کے سبب \n ایک دن مہنگا پڑے گا تْجھ کو \nحق غریبوں کا دبا کر رکھنا\nآپ نے مروّجہ جاگیردارانہ، مکاّرانہ، ظالمانہ اور سرمایہ دارانہ سیاست پر یُوں ضربِ کاری لگائی ہے۔ کہتے ہیں:\nدرندوں کی حمایت ہو رہی ہے \nیہ کیسی اب سیاست ہو رہی ہے\nبھلا انصاف اب کیسے ملے گا\nبکاؤ جب عدالت ہو رہی ہے\nاپنی حالاتِ زندگی کا ذکر کرتے ہوئے لکھتے ہیں۔\n”میں نے اپنی آنکھوں سے جو دیکھا، کانوں سے جو سْنا اور زندگی کے تلخ تجربات سے جو کچھ سیکھا اُسی کو اپنا موضوعِ سخن بنایا۔ نامساعد حالات نے جو کچھ دیا اُسی کو لوٹا  دیا“۔\nگویا یہ کہنا بے جا نہ ہو گا کہ نور الدین ثانی کی شاعری ساحر لدھیانوی کے اِس مشہورِ زمانہ شعر کی عکّاس ہے۔\nدنیا نے تجربات و حوادث کی شکل میں \nجو کْچھ دیا ہے مجھ کو وہ لْوٹا رہا ہوں میں \n]",
"en": "[Nooruddin Sani is a mystic soul and an intuitive poet. He hails from Salehpur, falka, Katihar, Bihar, India. Aks-e-Sani is his collection of poetry. He has sought my opinion on his book. He is primarily a poet of the ghazal. Ghazal thrives on metaphors, symbols, and subtle allusions. Its lyrical quality is its hallmark. Ghazal is a representative of our culture and civilization. It is the soul of poetry and a mirror of life. It expresses personal, universal, social, political, and revolutionary thoughts. Renowned Urdu critic Nazeer Siddiqui has noted:\n\n\"Ghazal allows for the expression of the temperaments of East and West and the mysteries of human nature to an extent unmatched by any other genre.\"\n\nThere was a time when Urdu poetry was in its early stages. From Wali Dakhni to Mirza Ghalib, by the time it reached Ghalib, he had to say:\n\nFarsi been taa bubini naqsh-haaye rang rang \n Bugzar az majmua-e Urdu ke be-rang-e man ast\n\nBut today, when we study the modern Urdu poets, we can rightfully proclaim that the scope of Urdu poetry has significantly widened. I found Nooruddin Sani’s ghazals deeply enchanting. Sincerity is the foundation of poetry. In his verses, I found the fragrance of honesty that infuses his poetry with soul and feeling. His ghazals carry melodic rhythm and a magical touch. His sensitive nature reflects in his plain and simple poetic language. His style flows smoothly, and his thoughts shine brightly. He is connected to religious and moral traditions. His poetry, in Iqbal’s words, is:\n\n\"Juzweest az paighambari\"\n\nThe story of separation and union, the description of beauty and love—these are inseparable elements of poetry. They stem from the depths of the heart and are the spiritual wealth of the soulful. Reading many of his couplets, one can’t help but say:\n\nKarishma daaman-e-dil meekashad ke jaa eenjaast\n\nHis childhood passed through immense poverty and hardship. Hunger, deprivation, and sadness were constant companions. He worked as a laborer. The trials of time and the hardships of life made him deeply sensitive—and this mental and emotional state is evident in his poetry. Like Ehsaan Danish, who also worked as a laborer and is known as the “poet of the working class,” Sani too deserves to be called the Shaair-e-Mazdoor-e-Sani. His pen name is also “Sani.” Upon studying his work, three central themes emerge: romantic, revolutionary, and political.\n\nHere are a few romantic couplets:\n\nKoi shikwa nahi zamaane se \nDil to toota hai dil lagaane se \n\n Qafas mein jab parinda tarapta rehta hai \nKisi ki yaad mein aise machal raha hoon main\n\nPoverty and ignorance have become the fate of the third world. Western imperialism and tyranny have entrapped us in a net of disgrace and oppression. Some of his verses powerfully shake the human conscience.\n\nSome revolutionary couplets:\n\nBhook bachon ki maa se na dekhi gayi \nAabroo bech di muflasi ke sabab \n\nEk din mehnga padega tujh ko \nHaq ghareebon ka daba kar rakhna\n\nHe delivers sharp blows to feudal, deceitful, tyrannical, and capitalist politics, saying:\n\nDarindon ki himayat ho rahi hai \nYeh kaisi ab siyasat ho rahi hai \n\nBhala insaaf ab kaise milegan \nBikau jab adaalat ho rahi hai\n\nDiscussing his life’s condition, he writes:\n\n\"Whatever I saw with my own eyes, heard with my ears, and learned through bitter experiences of life—I made that the subject of my poetry. Whatever adversity gave me, I gave it back.\"\n\nSo, it wouldn’t be wrong to say that Nooruddin Sani’s poetry reflects Sahir Ludhianvi’s famous lines:\n\nDuniya ne tajurbaat o haadasaat ki shakal mein \nJo kuch diya hai mujh ko, woh loota raha hoon main]",
"hi": "[नूरुद्दीन सानी एक रुहानी इंसान और भावनात्मक शायर हैं। इनका ताल्लुक भारत के बिहार राज्य के कटिहार ज़िले के फुलका गाँव, सालेहपुर से है। \"अक्स-ए-सानी\" इनका काव्य संग्रह है। वे मेरी इस किताब पर राय के इच्छुक हैं। मूल रूप से वे ग़ज़ल के शायर हैं। ग़ज़ल उपमाओं, रूपकों, संकेतों और प्रतीकों की वाहक होती है। इसकी लयात्मकता इसकी विशेषता है। ग़ज़ल हमारी तहज़ीब और संस्कृति की प्रतिनिधि होती है। यह शायरी की आत्मा और ज़िंदगी का आईना है। ग़ज़ल में व्यक्तिगत, वैश्विक, सामाजिक, राजनैतिक और क्रांतिकारी विचारों का सुंदर समावेश होता है। उर्दू साहित्य के प्रतिष्ठित आलोचक नज़ीर सिद्दीकी लिखते हैं:\n\n\"ग़ज़ल में पूर्व और पश्चिम के स्वभाव और मानव प्रकृति के रहस्यों को जिस सीमा तक व्यक्त किया जा सकता है, वह शायद किसी और विधा में संभव नहीं।\"\n\nजब उर्दू शायरी अपने प्रारंभिक दौर में थी, वली दकनी से लेकर मिर्ज़ा ग़ालिब तक पहुँची, तो ग़ालिब को कहना पड़ा:\n\nफ़ारसी बीन ता बुबीनी नक़्श-हा-ए रंग रंग \nबुगुज़र अज़ मज़मूआ-ए उर्दू कि बी-रंग-ए मन अस्त\n\nलेकिन आज जब हम आधुनिक उर्दू शायरों का अध्ययन करते हैं, तो हम पूरे आत्मविश्वास से कह सकते हैं कि अब उर्दू शायरी का दायरा बहुत विस्तृत हो चुका है। नूरुद्दीन सानी की ग़ज़लों ने मुझे मंत्रमुग्ध कर दिया। निष्कलंक भावनाएँ ही सच्ची शायरी की नींव होती हैं। मैंने उनकी ग़ज़लों में उसी सच्चाई की सुगंध पाई जिससे उनकी शायरी दर्द और रूहानियत से भरपूर है। उनकी ग़ज़लों में सुर और जादुई रंग हैं। उनकी भावनाएँ जैसे सरल हैं, उनकी भाषा भी वैसी ही सहज और सरस है। उनकी शैली में प्रवाह है और सोच में चमक है। वे धार्मिक और नैतिक परंपराओं से जुड़े हुए हैं, जैसे उनकी शायरी अल्लामा इक़बाल के इस कथन को साकार करती है:\n\n\"जुज़वीस्त अज़ पैम्बरी\"\n\nवियोग और मिलन की कथा, सौंदर्य और प्रेम का वर्णन शायरी का अविभाज्य हिस्सा है जो दिल की गहराइयों से निकलता है और भावुक दिल वालों का अमूल्य खज़ाना है। उनके कई शेर पढ़कर सहज ही मन कह उठता है:\n\nकरिश्मा दामन-ए-दिल मीकशद के जा ईंजास्त\n\nउनका बचपन बेहद ग़रीबी और कठिनाइयों में बीता। भूख, तंगहाली और उदासी उनकी ज़िंदगी की पूंजी रही। वे मज़दूरी करते रहे। ज़माने के हादसों और जीवन की कठिनाइयों ने उन्हें संवेदनशील बना दिया, और यह मानसिक और भावनात्मक स्थिति उनके अशआर में स्पष्ट रूप से झलकती है। जैसे एहसान दानिश भी मज़दूरी करते थे, और उनकी शायरी में मज़दूरों, मजबूरों और सताए गए लोगों का ज़िक्र प्रचुर मात्रा में मिलता है। उन्हें \"शायर-ए-मज़दूर\" कहा जाता है। मेरी नज़र में नूरुद्दीन सानी आज के दौर के \"शायर-ए-मज़दूर-ए-सानी\" हैं। उनका तख़ल्लुस भी \"सानी\" है। उनके काव्य के अध्ययन से यह स्पष्ट होता है कि उनके शेर तीन मुख्य विषयों के इर्द-गिर्द घूमते हैं — रोमांटिक, क्रांतिकारी और राजनीतिक।\n\nकुछ रोमांटिक शेर सुनिए और सर हिलाइए:\n\nकोई शिकवा नहीं ज़माने से \nदिल तो टूटा है दिल लगाने से \n\nक़फ़स में जब परिंदा तड़पता रहता है \nकिसी की याद में ऐसे मचल रहा हूँ मैं\n\nग़रीबी और अशिक्षा तीसरी दुनिया का मुक़द्दर बन चुकी हैं। पश्चिमी साम्राज्यवाद और अत्याचार ने हमें ज़िल्लत और नफ़रत के रंगहीन जाल में क़ैद कर दिया है। उनके कुछ शेर मानवीय अंतरात्मा को झकझोर कर रख देते हैं।\n\nकुछ क्रांतिकारी शेर देखें:\n\nभूख बच्चों की माँ से न देखी गई \nआबरू बेच दी मुफ़्लिसी के सबब \n\nएक दिन महँगा पड़ेगा तुझ को \nहक़ ग़रीबों का दबा कर रखना\n\nउन्होंने वर्तमान की सामंती, धूर्त, ज़ालिम और पूँजीवादी राजनीति पर तीखा प्रहार किया है। वे कहते हैं:\n\nदरिंदों की हिमायत हो रही है \nये कैसी अब सियासत हो रही हैभला इंसाफ़ अब कैसे मिलेगाबिकाऊ जब अदालत हो रही है\n\nअपनी ज़िंदगी के हालात का ज़िक्र करते हुए वे लिखते हैं:\n\n\"मैंने अपनी आँखों से जो देखा, कानों से जो सुना और ज़िंदगी के कड़वे अनुभवों से जो कुछ सीखा, वही अपना विषय बनाया। विपरीत परिस्थितियों ने जो कुछ दिया, उसे ही वापस कर दिया।\"\n\nइसलिए यह कहना अनुचित नहीं होगा कि नूरुद्दीन सानी की शायरी साहिर लुधियानवी के इस प्रसिद्ध शेर की प्रतिबिंब है:\n\nदुनिया ने तजुर्बात ओ हादसात की शक्ल में\n जो कुछ दिया है मुझ को, वो लूटा रहा हूँ मैं]"
}
},
{
"id": 4,
"title": {
"ur": "عکسِ ثانی: نورالدین ثانی کا نقش اوّل",
"en": "Aks-e-Sani: Nooruddin Sani’s First Impression",
"hi": "अक्स-ए-सानी: नूरुद्दीन सानी की पहली छाप"
},
"author": {
"ur": "احسان قاسمی (نوری نگر، پورنیہ)\nمورخہ۔ ۷۲ فروری۲۲۰۲ ء\n9304397482",
"en": "Ehsan Qasmi (Noori Nagar, Purnea)\nDate: 27 February 2022\n9304397482",
"hi": "एहसान कासमी (नूरी नगर, पूर्णिया)\nदिनांक: 27 फरवरी 2022\n9304397482"
},
"content": {
"ur": "زبان اردو کا کوئی ثانی نہیں۔ یہ ایک زندہ جاوید اور متحرک زبان ہے جو عام لوگوں کے درمیان پیدا ہوئی، کھیتوں، کھلیانوں، مرغ زاروں، گلیوں، سڑکوں، محلّوں سے ہوتی محلوں میں پروان چڑھی۔ صوفی سنتوں کی محفلوں میں رقص کرتی میر و غالب کے جام و مینا تک پہنچی اور وادء حسن و عشق کی حسین وادیوں سے گزرتی ترقی پسندی اور تجرید کی کانٹوں بھری رہگزر سے نبردآزما ہوتی اپنے دامن میں کچھ گل بوٹے کچھ خار لئے نورالدین ثانی تک پہنچی۔\nنور الدین ثانی کا بھی کوئی جواب نہیں۔\nجی کیا فرمایا؟۔۔۔۔۔۔۔ نورالدین ثانی کون ہیں؟ ارے جناب! وہی نورالدین جو کٹیہار ضلع کے پھلکا تھانے کے حدود اربعہ میں آباد ایک غیر معروف گاؤں صالح پور مہیش پور میں ایک بڑے کاشتکار خاندان میں بااعتبار اسکولی سرٹیفکیٹ یکم جنوری 1979 ء کو محمد یوسف عرف بہادر کے گھر پیدا ہوا، لیکن زمانے کی ٹیڑھ چال سے تب تک یوسف کے ہاتھ سے خزانے کی چابی گم ہو چکی تھی اور وہ معاشی تنگ حالی کا شکار ہو کر محض نام کے بہادر رہ گئے تھے۔ اللہ رب العزت کو ابھی اس گھرانے کا مزید امتحان مطلوب تھا، لہذا نورالدین کی نہایت کم عمری میں ہی بہادر صاحب نے داعئے اجل کو لبیک کہا۔ کچھ عرصہ بعد سب سے بڑے بھائی جن کی محنت و مشقت کے باعث گھر میں رونق اور چہل پہل تھی بستر علالت پر دراز ہوئے اور یہ سلسلہ رفتہ رفتہ طویل تر ہوتا گیا جس کے باعث رہی صحیح جمع پونچی پر بھی آفت آ گئی اور دو وقت کی نوالوں کا سلسلہ جاری رکھنے کے لئے نورالدین کو محض سات آٹھ سال کی عمر میں ہی گاؤں کے باحیثیت افراد کے یہاں بصورت گھریلو ملازم اپنے بچپن کی بھینٹ چڑھانی پڑی۔ تقریباً ساڑھے تین برس بسترِ علالت پر گزار کر بڑے بھائی نے بھی وہی راہ اختیار کی جو والد بزرگوار اس سے قبل کر چکے تھے۔\nنور الدین کے دل میں ایک شمع روشن تھی۔۔۔۔۔۔۔ حصول تعلیم کی۔ زمانے کے سرد و گرم نے اس کے اندر ایک چنگاری پیدا کر دی تھی اور یہ احساس روز بروز فزوں تر ہوتا جا رہا تھا کہ بغیر تعلیم کے معاشرے میں اس کی کوئی حیثیت نہیں ہے۔ اسے تا عمر یونہی دوسروں کی بھینس چراتے، کھیت مزدور کی حیثیت سے کام کرتے رہنا پڑا، لیکن یہ اسے قطعی منظور نہ تھا۔ لہذا پندرہ سولہ سال کی عمر میں اس نے قریبی گاؤں کے مدرسے میں داخلہ لے لیا حالانکہ یہ سلسلہ ایک سال سے زائد عرصہ تک قائم نہ رہ سکا۔ بعد ازاں گاؤں کے اسکول میں داخلہ لیا۔ پڑھائی اور مزدوری کا سلسلہ بیک وقت جاری رہا۔ یہ سلسلہ بھی جلد ہی منقطع ہو گیا اور نورالدین چند دیگر مزدوروں کے ساتھ دلّی کمانے چل پڑے۔ وہاں رہ کر راج مستری کا کام سیکھا۔ ان سے بڑے دو بھائی بھی دلّی میں ہی رہتے ہیں اور تمام بھائی مل کر مکان وغیرہ کے تعمیراتی کاموں کا ٹھیکہ لیا کرتے ہیں۔ ماشاء اللہ اپنی لگن، محنت اور ہنر سے انھوں نے مالی بحران پر قابو پا لیا ہے۔\nنورالدین نے ابتدائی دور میں ہندی زبان میں چند افسانے لکھے جو ' روپ کی شوبھا ' نامی رسالے میں شائع بھی ہوئے لیکن رفتہ رفتہ شاعری کی جانب طبیعت مائل ہوتی گئی اور بحور و اوزان سے واقفیت ہونے کے بعد باقاعدہ شاعری کا آغاز ہوا۔ نوشاد ثمر بگراسوی کے سامنے زانوئے تلمذ تہہ کیا اور اس طرح عہدِ طفلی سے ہی شب و روز زندگی کے محاذ پر ڈٹا رہنے والا نورالدین آج ایک حساس شاعر کی صورت میں ہمارے درمیان (نورالدین ثانی کے نام) سے موجود ہے۔ ثانی کے ہاتھ میں راج مستری والی کرنی اور شاعر کا قلم دونوں موجود ہیں۔ اس کی شاعری کم پڑھے لکھے ایک مزدور کی شاعری ہے جس کے پاس بڑے بڑے بھاری بھرکم الفاظ نہیں، لفظوں کی بازیگری بھی نہیں، کوئی پیچیدہ فلسفہ، نیا رجحان، نئی اڑان نہیں، کسی ستائش اور انعام و اکرام پر اس کی نظر نہیں، کسی ناقد کی آنکھ کا وہ تارا نہیں اور کسی مبصر کی ناک کا بال بھی نہیں۔ اس کی شاعری گدے دار صوفوں اور اے سی کی مصنوعی ٹھنڈک سے بھرے سجے سجائے کسی ڈرائنگ روم کی پیداوار نہیں …… اُس کی شاعری تودھوپ میں تپتے، زندگی کی سنگلاخ دھرتی پر گل بوٹے اگانے کی سعی میں مصروف ایک عام انسان کی شاعری ہے۔ اس نے اپنی شخصیت کو چمکدار بناکر پیش کرنے کی غرض سے شانوں پر شعر و ادب کا قیمتی پشمینہ نہیں ڈال رکھا ہے بلکہ وہ بھینس کی پیٹھ پر سوار ایک خستہ حال چرواہا ہے جو قدرت کے ساتھ اور قدرت میں جیتا ہے اور جب ذرا ترنگ میں آ جائے تو گدڑی سے بانسری نکال کر طرح طرح کے سر چھیڑنے لگتا ہے۔ زندگی کے انگنت رنگ ہیں۔ مختلف اوقات و حالات میں انسان کے جذبات بھی تغیر کا شکار ہوتے ہیں۔ اس نفسیاتی عمل سے گزرتے ہوئے ثانی کی بانسری سے بھی مختلف لے اور راگ برآمد ہوتے ہیں۔\nاللہ تعالیٰ کی وحدت:\nتو ہے تنہا، یکتا، یگانہ\nتیرے کن سے سارا زمانہ\n\nسو بات کی اک بات ہے ثانی\nاللہ باقی سب ہے فانی\nعشقِ نبی ؐ:\nثانی کے پاس کچھ نہیں نیکی کے نام پر\nکچھ ہے اگر تو وہ ہے محبت رسول ؐ کی\n\nنعتِ پاک پڑھتے تم ہر گھڑی رہو ثانی\nدیکھنا تمہارے ساتھ کچھ برا نہیں ہوگا\nبندگی اور عبادت:\nجن کا پرنور عبادت سے جگر ہوتا ہے\nایسے لوگوں کی دعاؤں میں اثر ہوتا ہے\n\nشیطان کیوں نہ ایسے گھروں میں کریں گے راج\nمدت سے جن گھروں میں تلاوت نہیں ہوئی\nاخلاقیات:\nجس کا اخلاق ہی نہ بہتر ہو\nوہ بشر ہے بھلا اماں چھوڑو\nمعتبر وہ تو کبھی ہو نہیں سکتے ثانی\nاپنے ہونٹوں سے کسی کو جو برا کہتے ہیں \nاردو زبان سے محبت:\nترنم سے شہد ٹپکے تحت سے یہ فضا مہکے\nسمجھ میں سب کو آجائے گی گر اردو زباں کر لیں \nماں کی دعا:\nبلندی جو میں چھو رہا ہوں اے لوگو\nمجھے میری ماں کی دعا لگ رہی ہے\n\nماں کی جب دعا لیکر گھر سے میں نکلتا ہوں \nراستے میں پھر کوئی حادثہ نہیں ہوتا\n\nجب تڑپ کر دعا ایک ماں نے ہے کی\nپھر تو صحرا بھی پانی ابلنے لگا \nمفلسی و لاچاری:\nبھوک بچوں کی ماں سے نہ دیکھی گئی\nآبرو بیچ دی مفلسی کے سبب\n\nمفلسی ملک سے جائے بھی تو جائے کیسے\nحق غریبوں کا یہ نیتا ہی سٹک لیتا ہے\nمنافقت:\nہے یہ مرے پڑوسی کا محبوب مشغلہ\nدیکھے کہیں شرارہ تو اُس پر ہوا کرے\n\nاس سے بڑھ کر کے غلط حالِ چمن کیا ہوگا\nآبرو پھول کی مالی ہی اچک لیتا ہے\nتنبیہ:\nاپنے آنگن کا شجر کاٹنے والو سوچو\nشام کو لوٹا پرندہ تو کدھر جائے گا\n\nامیرِ شہر لرز جائے گا فلک اس دن\nاگر یتیم کی آنکھوں سے قطرہ نکلے گا\n\nکروگے ابھی سے جو ضد اس کی پوری\nبگڑ جائے گا لاڈلا دیکھ لینا\nقوم کی ناعاقبت اندیشی:\nہم اگر سمجھ جاتے وقت کی نزاکت کو\nرہزنوں کے ہاتھوں میں قافلہ نہیں ہوتا\nزندگی کی بیثباتی:\nیہ جہان سارا تماشہ گھر یہ تماشہ دیکھنا ہے مگر\nتجھے جانا ہے اے بشر کہاں تجھے یاد یہ بھی سدا رہے\nگھر / آشیانہ:\nگھر سنورتا نہیں سجانے سے\nنیک دل گر مکیں نہیں ہوتا\nاینٹ پتھر سے فقط گھر نہیں بنتا ثانی\nمل کے رہتے ہیں جہاں سب وہی گھر ہوتا ہے\nعسرت:\nہم غریبوں کے گھروں میں صاحب\nاور کیا رکھا ہے برکت کے سوا قناعت:\nتجھے اگر ہے ضرورت تو لے کے جا سورج\nمجھے توکافی ہے جگنو مرے مکاں کے لئے\n\nمری غربت ہے عنایت تیری\nتو اگر خوش ہے تو غربت ہی سہی\nعشق / محبت:\nمیں دیوانہ عشق کا ہوں میاں مجھے ڈر نہیں کسی روگ کا\nہے یہ عشق گر کوئی روگ تو مجھے روگ پھر یہ لگا رہے\n\nیارو مجھ کو اکثر ایسا کیوں لگتا ہے سوچ رہا ہوں \nآخر وہ ہی دل کو پیارا کیوں لگتا ہے سوچ رہا ہوں \n\nدل کو لگایا میں نے تو اس میں عجب ہے کیا\nہر ایک کو کسی نہ کسی سے ہے پیار دیکھ\nحسن:\nان کے جمالِ حسن کو سوچو تو غور سے\nالفت نہ ہوگء تو غلامی قبول ہے\nہجر:\nمیرے شانے پہ اس کا سر گھنٹوں گھنٹوں رہتا تھا\nان آنکھوں نے ایسا منظر بھی قسمت سے دیکھا ہے\n\nہے تقاضا یہی جدائی کا\nاپنی یادوں میں اس کو زندہ رکھ\nوصال:\nعید کا چاند تیرا بہت شکریہ\nاس کی دیدار کا اک بہانہ ہوا\nبے وفائی:\nڈھونڈتے ہو وفا یہاں ثانی\nدوسرے کیا جہاں سے آئے ہو\n\nدیکھا کیا رقیب کی بانہوں میں جب اسے\nنامِ وفا کو دل سے مٹانا پڑا مجھے\nرنج و الم:\nرفاقت ہو گء جب تیرگی سے\nدیا ٹھکرا رہا ہے روشنی کو\nنفرت:\nکل تلک بچھڑنے کا ڈر جسے ستاتا تھا\nوصل آج کل اس کو ناگوار لگتا ہے\n\nاب پلٹ کر بھی وہ دیکھتا تک نہیں \nمیرا شانہ تھا جس کا ٹھکانہ کبھی\nامید:\nذرا تو صبر سے ہمت سے کام لے اے دوست\nیہیں سے دیکھنا منزل کا رستہ نکلے گا\nہمت / حوصلہ:\nخلوص و وفا اور چاہت اگر ہو\nبدل جائیں حالات ہمت اگر ہو \nتمنا اب اجالے کی کہیں سے اور کیا کرنا\nچلو روشن چراغِ دل جلا کے خود یہاں کر لیں \n\nگلے لگاتی ہیں ان کو ہی منزلیں ثانی\nجو لوگ حوصلہ اپنا بنا کے رکھتے ہیں \nیقین:\nخود اپنے آپ پہ ثانی یقین ہے مجھ کو\nمری ہتھیلی سے اک دن اجالا نکلے گا\n\nجب مخالف ہوا ہو اے ثانی\nہے کرامت دیا جلانا بھی\n\nحادثو! وہ بھی تم مرا رستہ\nروک پاؤگے کیا اماں چھوڑو\nزندگی کے مسائل:\nکس کو فرصت ہے یہاں اب کون حالِ دل سنے\nہر کوئی الجھا ہوا ہے مسئلوں کے درمیاں \nخود داری:\nمیری حالت پہ ذرا سوچ سمجھ کے ہنسنا\nرشک کرتی ہے یہ غربت میری خود داری پر\nحالاتِ حاضرہ:\nامیرِ شہر ایک جاہل بنا ہے\nہنر ثانی سنبھل کر تم دکھانا\n\nمیں کہتا تھا کبوتر مت اڑاؤ\nبچارا زخم کھا کر آ گیا نا\n\nہمارے قتل پہ کل تم ہی چپ تھے\nتمہارا بھی تو نمبر آ گیا نا\n\nبھلا انصاف اب کیسے ملے گا\nبکاؤ جب عدالت ہو رہی ہے\nبر محل اشعار:\nمحنتی لوگ بن گئے سورج\nہم ستارے شمار کرتے رہے\n\nمانا کہ دوست دوست ہوتا ہے\nزخم لیکن نہیں دکھانے کا\nنورالدین ثانی کی شاعری سے ایسی بہت ساری مثالیں پیش کی جا سکتی ہیں۔ یہاں چند اشعار بطور خاص اس لئے پیش کئے گئے کہ قارئین کرام کو ثانی کی شاعری کی رنگارنگ خصوصیات سے واقفیت حاصل ہو سکے۔\nالقصہ مختصر نورالدین ثانی کی شاعری گھنے جنگلات کے درمیان رواں ایک صاف و شفاف چشمے کی مانند ہے جس تک رسائی کم کم لوگوں کو حاصل رہی ہے۔ \nامید قوی ہے کہ مزید مشق سے ثانی کی شاعری میں دن بدن اور بھی نکھار آتا جائے گا۔ زبان کی فصاحت، بیان کی ملاحت اور موضوعات کی ندرت نئے نئے رنگ بکھیرے گی۔ ہمیں ان کے آئندہ شعری مجموعے کا انتظار رہے گا۔\n",
"en": "There is no match for the Urdu language. It is a vibrant and dynamic language, born among common people, nurtured in fields, barns, gardens, alleys, streets, and neighborhoods, and blossomed in palaces. Dancing in the gatherings of Sufi saints, it reached the wine and goblets of Mir and Ghalib, passing through the beautiful valleys of love and beauty, grappling with the thorny paths of progressivism and abstraction, carrying some flowers and some thorns in its embrace, until it reached Nooruddin Sani.\nNooruddin Sani is unmatched as well.What did you say? Who is Nooruddin Sani? Oh, dear sir! He is the same Nooruddin, born in a prominent farmer’s family in the obscure village of Salehpur Maheshpur, within the jurisdiction of Phulka police station in Katihar district, Bihar, India, on January 1, 1979, according to his official school certificate, in the house of Mohammad Yusuf, alias Bahadur. But due to the cruel twists of fate, by then, the key to the family’s wealth had slipped from Yusuf’s hands, and he had become a victim of financial hardship, left as Bahadur only in name. It was the will of Almighty Allah to test this family further, so in Nooruddin’s early childhood, Bahadur Sahib answered the call of death. Some time later, the eldest brother, whose hard work and efforts kept the household lively, fell ill and took to his bed. This ordeal gradually prolonged, bringing calamity upon the family’s remaining savings. To keep the cycle of two meals a day going, Nooruddin, at the tender age of seven or eight, had to sacrifice his childhood, working as a domestic helper in the homes of the village’s influential people. After spending nearly three and a half years bedridden, the eldest brother followed the same path as their father had taken before him.\nA lamp burned in Nooruddin’s heart—the desire for education. The harsh blows of time had sparked a flame within him, and the realization grew stronger each day that without education, he would have no standing in society. He would have to spend his life herding others’ buffaloes or laboring in the fields, but this was utterly unacceptable to him. So, at the age of fifteen or sixteen, he enrolled in a nearby village’s madrasa, though this pursuit lasted barely a year. Later, he joined the village school. The cycle of studying and laboring continued simultaneously, but it soon broke off, and Nooruddin set off for Delhi with a group of laborers to earn a living. There, he learned the craft of masonry. His two elder brothers also live in Delhi, and together, they take contracts for construction work on houses and the like. By the grace of God, through their dedication, hard work, and skill, they have overcome their financial crisis.\nIn his early days, Nooruddin wrote a few short stories in Hindi, which were published in a magazine called Roop Ki Shobha. Gradually, however, his inclination turned toward poetry, and after gaining familiarity with meters and rhythms, he formally began his poetic journey. He sat at the feet of Naushad Samar Bagravi as a disciple, and thus, Nooruddin, who had been steadfastly facing life’s challenges since childhood, stands among us today as a sensitive poet under the name Nooruddin Sani. In Sani’s hands are both the mason’s trowel and the poet’s pen. His poetry is that of a minimally educated laborer, devoid of grandiose words, linguistic jugglery, complex philosophies, new trends, or lofty flights. His gaze is not fixed on praise, rewards, or accolades; he is neither the apple of a critic’s eye nor the bane of a reviewer’s existence. His poetry is not the product of cushioned sofas or the artificial coolness of air-conditioned drawing rooms. It is the poetry of an ordinary man, toiling under the scorching sun, striving to grow flowers on the rocky terrain of life. He has not draped himself in the precious shawl of poetry and literature to polish his persona. Instead, he is a tattered shepherd riding a buffalo’s back, living with and within nature. When he feels a surge of inspiration, he pulls a flute from his rags and plays various melodies. Life has countless colors. Human emotions shift with different times and circumstances. Passing through this psychological process, various tunes and rhythms emanate from Sani’s flute.\nThe Oneness of Allah:\n Tu hai tanha, yakta, yagana \n Tere kun se sara zamana  \n\nSau baat ki ek baat hai Sani\nAllah baqi sab hai faani  \nLove for the Prophet (PBUH):\n Sani ke paas kuch nahin neki ke naam par\nKuch hai agar to woh hai mohabbat Rasool ki  \n\nNa’at-e-pak padhte tum har ghadi raho Sani\n Dekhna tumhare saath kuch bura nahin hoga  \nDevotion and Worship:\n Jin ka parnoor ibaadat se jigar hota hai\n Aise logon ki duaon mein asar hota hai  \n\nShaitaan kyun na aise gharon mein karenge raaj \n Muddat se jin gharon mein tilawat nahin hui  \nMorality:\n Jis ka akhlaq hi na behtar ho\n Woh bashar hai bhala amaan chhodo  \n\nMutabar woh to kabhi ho nahin sakte Sani\n Apne honthon se kisi ko jo bura kehte hain  \nLove for the Urdu Language:\n Taranum se shahad tapke tahat se yeh faza mahke\n Samajh mein sab ko aayegi gar Urdu zabaan kar lein  \nMother’s Prayer:\n Bulandi jo main chhoo raha hoon aye logo\n Mujhe meri maa ki dua lag rahi hai  \n\nMaa ki jab dua lekar ghar se main nikalta hoon\n Raaste mein phir koi haadsa nahin hota  \n\nJab tadap kar dua ek maa ne hai ki\n Phir to sahra bhi paani ubalne laga  \nPoverty and Helplessness:\n Bhook bachchon ki maa se na dekhi gayi\n Aabroo bech di muflisi ke sabab  \n\nMuflisi mulk se jaye bhi to jaye kaise \n Haq gareebon ka yeh neta hi satak leta hai  \nHypocrisy:\n Hai yeh mere padosi ka makbool mashgala \n Dekhe kahin sharaara to us par hawa kare  \n\nIs se badhkar ke ghalat haal-e-chaman kya hoga\n Aabroo phool ki maali hi uchak leta hai  \nAdmonition:\n Apne aangan ka shajar kaatne walo socho\n Shaam ko lauta parinda to kidhar jayega  \n\nAmeer-e-shahr laraz jayega falak us din\n Agar yateem ki aankhon se qatra niklega  \n\nKaroge abhi se jo zid us ki poori\n Bigad jayega laadla dekh lena  \nThe Nation’s Shortsightedness:\n Hum agar samajh jaate waqt ki nazakat ko\n Rahzanon ke haathon mein qafila nahin hota  \nThe Instability of Life:\n Yeh jahaan sara tamasha ghar yeh tamasha dekhna hai magar\n Tujhe jaana hai aye bashar kahaan tujhe yaad yeh bhi sada rahe  \nHome / Shelter:\n Ghar sanwarta nahin sajane se\n Neek dil gar makeen nahin hota  \n\nEent patthar se faqat ghar nahin banta Sani\n Mil ke rahte hain jahan sab wahi ghar hota hai  \nAdversity:\n Hum gareebon ke gharon mein sahib \n Aur kya rakha hai barkat ke siwa  \nContentment:\n Tujhe agar hai zaroorat to le ke ja sooraj\n Mujhe to kaafi hai jugnu mere makaan ke liye  \n\nMeri ghurabt hai inayat teri\n Tu agar khush hai to ghurabt hi sahi  \nLove / Affection:\n Main deewana ishq ka hoon miyaan mujhe dar nahin kisi rog ka\n Hai yeh ishq gar koi rog to mujhe rog phir yeh laga rahe  \n\nYaaro mujhe aksar aisa kyun lagta hai soch raha hoon\n Aakhir woh hi dil ko pyara kyun lagta hai soch raha hoon  \n\nDil ko lagaya maine to us mein ajab hai kya\n Har ek ko kisi na kisi se hai pyar dekh  \nBeauty:\n Un ke jamaal-e-husn ko socho to gaur se\n Ulfat na ho to gulaami qabool hai  \nSeparation:\n Mere shane pe us ka sar ghanton ghanton rahta tha \n In aankhon ne aisa manzar bhi qismat se dekha hai  \n\nHai taqaza yahi judai ka\n Apni yaadon mein us ko zinda rakh  \nUnion:\n Eid ka chaand tera bahut shukriya \n Us ki deedaar ka ek bahana hua  \nBetrayal:\n Dhoondte ho wafa yahan Sani \n Doosre kya jahaan se aaye ho  \n\nDekha kya raqeeb ki baahon mein jab use\n Naam-e-wafa ko dil se mitaana pada mujhe  \nGrief and Pain:\n Rafaqat ho gayi jab tirgi se\n Diya thukra raha hai roshni ko  \nHatred:\n Kal talak bichhadne ka dar jise sataata tha \n Wasl aaj kal us ko na-gawaar lagta hai  \n\nAb palat kar bhi woh dekhta tak nahin\n Mera shana tha jis ka thikaana kabhi  \nHope:\n Zara to sabr se himmat se kaam le aye dost\n Yahin se dekhna manzil ka rasta niklega  \nCourage / Determination:\n Khuloos wa wafa aur chahat agar ho \n Badal jaayein halaat himmat agar ho  \n\nTamanna ab ujale ki kahin se aur kya karna\n Chalo roshan charaag-e-dil jala ke khud yahan kar lein  \n\nGale lagati hain un ko hi manzilein Sani\n Jo log hausla apna bana ke rakhte hain  \nFaith:\n Khud apne aap pe Sani yaqeen hai mujhe\n Meri hatheli se ek din ujala niklega  \n\nJab mukhalif hawa ho aye Sani\n Hai karamat diya jalaana bhi  \n\nHaadiso! Woh bhi tum mera rasta \n Rok paoge kya amaan chhodo  \nLife’s Problems:\n Kis ko fursat hai yahan ab kaun haal-e-dil sune \n Har koi uljha hua hai masa’ilon ke darmiyaan  \nSelf-Respect:\n Meri haalat pe zara soch samajh ke hansna \n Rashk karti hai yeh ghurabt meri khud-daari par  \nCurrent Affairs:\n Ameer-e-shahr ek jaahil bana hai\n Hunar Sani sambhal kar tum dikhaana  \n\nMain kehta tha kabootar mat udaao \n Bechara zakhm kha kar aa gaya na  \n\nHumare qatl pe kal tum hi chup the \n Tumhara bhi to number aa gaya na  \n\nBhala insaaf ab kaise milega\n Bikau jab adalat ho rahi hai  \nTimely Verses:\n Mehnati log ban gaye sooraj \n Hum sitare shumaar karte rahe  \n\nMaana ke dost dost hota hai \n Zakhm lekin nahin dikhane ka  \nMany such examples can be drawn from Nooruddin Sani’s poetry. These verses have been presented here specifically to familiarize readers with the vibrant qualities of Sani’s poetry.\nIn short, Nooruddin Sani’s poetry is like a clear and transparent spring flowing through dense forests, accessible to only a few.There is strong hope that with further practice, Sani’s poetry will gain even more refinement. The purity of language, the sweetness of expression, and the novelty of themes will scatter new colors. We eagerly await his next poetic collection.",
"hi": "उर्दू भाषा का कोई सानी नहीं। यह एक जीवंत और गतिशील भाषा है, जो आम लोगों के बीच जन्मी, खेतों, खलिहानों, बागों, गलियों, सड़कों, मोहल्लों से होकर महलों में पनपी। सूफी संतों की महफिलों में नाचती हुई मीर और ग़ालिब के जाम और मीना तक पहुँची, और हुस्न व इश्क की खूबसूरत वादियों से गुजरती हुई, प्रगतिशीलता और अमूर्तता की काँटों भरी राहों से जूझती हुई, अपने दामन में कुछ फूल-पत्तियाँ और कुछ काँटे लिए नूरुद्दीन सानी तक पहुँची।\nनूरुद्दीन सानी का भी कोई जवाब नहीं।जी, आपने क्या कहा? नूरुद्दीन सानी कौन हैं? अरे जनाब! वही नूरुद्दीन, जो कटिहार जिले के फुलका थाना क्षेत्र में बसे एक गुमनाम गाँव सालेहपुर महेशपुर में एक बड़े किसान परिवार में, आधिकारिक स्कूल प्रमाणपत्र के अनुसार 1 जनवरी 1979 को मोहम्मद यूसुफ उर्फ बहादुर के घर पैदा हुए। लेकिन समय की टेढ़ी चाल के कारण, तब तक यूसुफ के हाथ से खजाने की चाबी गुम हो चुकी थी, और वे आर्थिक तंगी का शिकार होकर सिर्फ नाम के बहादुर रह गए थे। अल्लाह रब्बुल इज्जत को इस परिवार का और इम्तिहान लेना मंजूर था, इसलिए नूरुद्दीन के बचपन में ही बहादुर साहब ने मौत के बुलावे को लब्बैक कहा। कुछ समय बाद, सबसे बड़े भाई, जिनकी मेहनत-मशक्कत से घर में रौनक और चहल-पहल थी, बीमार होकर बिस्तर पर पड़ गए। यह सिलसिला धीरे-धीरे लंबा होता गया, जिसके कारण बची-खुची पूँजी पर भी आफत आ गई। दो वक्त की रोटी का सिलसिला चलाए रखने के लिए नूरुद्दीन को महज सात-आठ साल की उम्र में गाँव के रसूखदार लोगों के यहाँ घरेलू नौकर के रूप में अपने बचपन की बलि चढ़ानी पड़ी। लगभग साढ़े तीन साल बिस्तर पर बीमारी में बिताने के बाद बड़े भाई ने भी वही रास्ता अपनाया, जो उनके पिता पहले ही चुन चुके थे।\nनूरुद्दीन के दिल में एक दीया जल रहा था—शिक्षा प्राप्त करने का। समय की ठोकरों ने उनके अंदर एक चिंगारी पैदा कर दी थी, और यह अहसास दिन-ब-दिन बढ़ता जा रहा था कि बिना शिक्षा के समाज में उनकी कोई हैसियत नहीं। उन्हें उम्रभर दूसरों की भैंस चरानी पड़ेगी या खेतों में मजदूर की तरह काम करना पड़ेगा, लेकिन यह उन्हें बिल्कुल मंजूर नहीं था। इसलिए, पंद्रह-सोलह साल की उम्र में उन्होंने नजदीकी गाँव के मदरसे में दाखिला लिया, हालाँकि यह सिलसिला एक साल से ज्यादा नहीं चल सका। बाद में, उन्होंने गाँव के स्कूल में दाखिला लिया। पढ़ाई और मजदूरी का सिलसिला एक साथ चलता रहा। लेकिन यह सिलसिला भी जल्दी ही टूट गया, और नूरुद्दीन कुछ अन्य मजदूरों के साथ दिल्ली कमाने चल पड़े। वहाँ उन्होंने राजमिस्त्री का काम सीखा। उनके दो बड़े भाई भी दिल्ली में ही रहते हैं, और सभी भाई मिलकर मकान वगैरह के निर्माण कार्यों का ठेका लेते हैं। माशा अल्लाह, अपनी लगन, मेहनत और हुनर से उन्होंने आर्थिक संकट पर काबू पा लिया।\nनूरुद्दीन ने शुरुआती दौर में हिंदी में कुछ अफसाने लिखे, जो ‘रूप की शोभा’ नामक पत्रिका में प्रकाशित भी हुए। लेकिन धीरे-धीरे उनकी रुचि शायरी की ओर बढ़ी, और बह्र व वज़न से वाकिफियत होने के बाद उन्होंने औपचारिक रूप से शायरी शुरू की। उन्होंने नौशाद समर बगरासवी के सामने शिष्य के रूप में घुटने टेके, और इस तरह, बचपन से ही जीवन के मोर्चों पर डटे रहने वाले नूरुद्दीन आज एक संवेदनशील शायर के रूप में (नूरुद्दीन सानी के नाम से) हमारे बीच मौजूद हैं। सानी के हाथ में राजमिस्त्री की करनी और शायर का कलम दोनों हैं। उनकी शायरी कम पढ़े-लिखे एक मजदूर की शायरी है, जिसमें बड़े-बड़े भारी-भरकम शब्द नहीं, शब्दों की जादूगरी नहीं, कोई जटिल दर्शन, नया रुझान, या नई उड़ान नहीं। उनकी नजर किसी तारीफ या इनाम पर नहीं, वे किसी आलोचक की आँखों का तारा नहीं, और न ही किसी समीक्षक की नाक का बाल हैं। उनकी शायरी गद्देदार सोफों और एसी की कृत्रिम ठंडक से भरे सजे-सजाए ड्राइंग रूम की उपज नहीं। उनकी शायरी धूप में तपते, जीवन की पथरीली धरती पर फूल-पत्तियाँ उगाने की कोशिश में लगे एक आम इंसान की शायरी है। उन्होंने अपनी शख्सियत को चमकाने के लिए शायरी और साहित्य का कीमती पश्मीना शाल नहीं ओढ़ा, बल्कि वे भैंस की पीठ पर सवार एक फटेहाल चरवाहा हैं, जो प्रकृति के साथ और प्रकृति में जीता है। जब वे थोड़ा उत्साह में आते हैं, तो अपनी गुदड़ी से बाँसुरी निकालकर तरह-तरह के सुर छेड़ने लगते हैं। जीवन के अनगिनत रंग हैं। अलग-अलग समय और हालात में इंसान के जज्बात भी बदलते हैं। इस मानसिक प्रक्रिया से गुजरते हुए सानी की बाँसुरी से भी अलग-अलग लय और राग निकलते हैं।\nअल्लाह ताला की एकता:\n तू है तन्हा, यकता, यगाना \nतेरे कुन से सारा ज़माना  \n\nसौ बात की एक बात है सानी\n अल्लाह बाकी सब है फानी  \nप्रेम-ए-नबी (सल्ल.):\n सानी के पास कुछ नहीं नेकी के नाम पर \nकुछ है अगर तो वह है मोहब्बत रसूल (सल्ल.) की  \n\nनعت-ए-पाक पढ़ते तुम हर घड़ी रहो सानी \n देखना तुम्हारे साथ कुछ बुरा नहीं होगा  \nबंदगी और इबादत:\n जिन का परनूर इबादत से जिगर होता है \n ऐसे लोगों की दुआओं में असर होता है  \n\nशैतान क्यों न ऐसे घरों में करेंगे राज \nमुद्दत से जिन घरों में तिलावत नहीं हुई  \nनैतिकता:\n जिस का अखलाक ही न बेहतर हो \n वह बशर है भला अमाँ छोड़ो  \n\nमुतबर वह तो कभी हो नहीं सकते सानी \n अपने होंठों से किसी को जो बुरा कहते हैं  \nउर्दू भाषा से मोहब्बत: \n तरनम से शहद टपके तहत से यह फ़ज़ा महके \n समझ में सब को आजाएगी गर उर्दू ज़बाँ कर लें  \nमाँ की दुआ:\n बुलंदी जो मैं छू रहा हूँ अए लोगो \nमुझे मेरी माँ की दुआ लग रही है  \n\nमाँ की जब दुआ लेकर घर से मैं निकलता हूँ \n रास्ते में फिर कोई हादसा नहीं होता  \n\nजब तड़प कर दुआ एक माँ ने है की \nफिर तो सहरा भी पानी उबलने लगा  \nमुफलिसी और लाचारी: \n भूख बच्चों की माँ से न देखी गई \n आबरू बेच दी मुफलिसी के सबब  \n\nमुफलिसी मुल्क से जाए भी तो जाए कैसे \n हक़ ग़रीबों का यह नेता ही सटक लेता है  \nमुनाफ़िक़त: \n है यह मेरे पड़ोसी का मकबूल मशगला \n देखे कहीं शरारा तो उस पर हवा करे  \n\nइस से बढ़कर के गलत हाल-ए-चमन क्या होगा \n आबरू फूल की माली ही उचक लेता है  \nतंबीह:\nअपने आँगन का शजर काटने वालो सोचो \n शाम को लौटा परिंदा तो किधर जाएगा  \n\nअमीर-ए-शहर लरज़ जाएगा फलक उस दिन \n अगर यतीम की आँखों से कतरा निकलेगा  \nकरोगे अभी से जो ज़िद उस की पूरी \nबिगड़ जाएगा लाडला देख लेना  \nकौम की ना-उकबत अंदेशी: \n हम अगर समझ जाते वक़्त की नजाकत को \n रहज़नों के हाथों में काफिला नहीं होता \n ज़िंदगी की बे-स्थिरता:\n यह जहान सारा तमाशा घर यह तमाशा देखना है मगर \n तुझे जाना है अए बशर कहाँ तुझे याद यह भी सदा रहे  \nघर / आशियाना: \n घर सँवरता नहीं सजाने से\n नेक दिल गर मकीं नहीं होता  \n\nईंट पत्थर से फ़क़त घर नहीं बनता सानी \n मिल के रहते हैं जहाँ सब वही घर होता है  \nइशरत:\n हम ग़रीबों के घरों में साहब \n और क्या रखा है बरकत के सिवा  \nकनाअत: \n तुझे अगर है ज़रूरत तो ले के जा सूरज \n मुझे तो काफी है जुगनू मेरे मकान के लिए  \n\nमेरी ग़ुरबत है इनायत तेरी \n तू अगर खुश है तो ग़ुरबत ही सही  \nइश्क / मोहब्बत:\n मैं दीवाना इश्क का हूँ मियाँ मुझे डर नहीं किसी रोग का \n है यह इश्क गर कोई रोग तो मुझे रोग फिर यह लगा रहे  \n\n यारो मुझे अक्सर ऐसा क्यों लगता है सोच रहा हूँ \n आखिर वह ही दिल को प्यारा क्यों लगता है सोच रहा हूँ  \n\nदिल को लगाया मैंने तो उस में अजब है क्या \n हर एक को किसी न किसी से है प्यार देख  \nहुस्न: \n उन के जमाल-ए-हुस्न को सोचो तो गौर से \n उलफत न हो तो गुलामी कबूल है  \nहिज्र: \n मेरे शाने पे उस का सर घंटों घंटों रहता था \n इन आँखों ने ऐसा मंज़र भी क़िस्मत से देखा है  \n\nहै तक़ाज़ा यही जुदाई का \n अपनी यादों में उस को ज़िंदा रख  \nविसाल:\n ईद का चाँद तेरा बहुत शुक्रिया \n उस की दीदार का एक बहाना हुआ  \nबे-वफाई:\n ढूँढते हो वफ़ा यहाँ सानी \n दूसरे क्या जहान से आए हो  \n\nदेखा क्या रकीब की बाहों में जब उसे \n नाम-ए-वफ़ा को दिल से मिटाना पड़ा मुझे  \nरंज व अलम:\n रफ़ाक़त हो गई जब तिरगी से \n दिया ठुकरा रहा है रौशनी को  \nनफरत:\n कल तलक बिछड़ने का डर जिसे सताता था \n वस्ल आजकल उस को ना-गवार लगता है  \n\nअब पलट कर भी वह देखता तक नहीं \n मेरा शाना था जिस का ठिकाना कभी  \nउम्मीद:\n ज़रा तो सब्र से हिम्मत से काम ले अए दोस्त\n यहीं से देखना मंज़िल का रास्ता निकलेगा  \nहिम्मत / हौसला: \n खुलूस व वफ़ा और चाहत अगर हो \n बदल जाएँ हालात हिम्मत अगर हो  \n\nतमन्ना अब उजाले की कहीं से और क्या करना \n चलो रौशन चराग-ए-दिल जला के खुद यहाँ कर लें  \n\nगले लगाती हैं उन को ही मंज़िलें सानी \n जो लोग हौसला अपना बना के रखते हैं  \nयक़ीन:\n खुद अपने आप पे सानी यक़ीन है मुझे \n मेरी हथेली से एक दिन उजाला निकलेगा  \n\nजब मुखालिफ हवा हो अए सानी \n है करामत दिया जलाना भी  \n\nहादिसो! वह भी तुम मेरा रास्ता \nरोक पाओगे क्या अमाँ छोड़ो  \nज़िंदगी के मसाइल: \n किस को फुर्सत है यहाँ अब कौन हाल-ए-दिल सुने \n हर कोई उलझा हुआ है मसाइलों के दरमियाँ  \nखुद-दारी:\n मेरी हालत पे ज़रा सोच समझ के हँसना \n रश्क करती है यह ग़ुरबत मेरी खुद-दारी पर  \nहालात-ए-हाज़िरा:\n अमीर-ए-शहर एक जाहिल बना है \n हुनर सानी संभल कर तुम दिखाना  \n\nमैं कहता था कबूतर मत उड़ाओ \n बेचारा ज़ख्म खा कर आ गया ना  \n\n हमारे कत्ल पे कल तुम ही चुप थे \n तुम्हारा भी तो नंबर आ गया ना  \n\nभला इंसाफ अब कैसे मिलेगा \n बिकाऊ जब अदालत हो रही है  \nबर-महल अशआर:\n महनती लोग बन गए सूरज \n हम सितारे शुमार करते रहे  \n\nमाना कि दोस्त दोस्त होता है \n ज़ख्म लेकिन नहीं दिखाने का  \nनूरुद्दीन सानी की शायरी से ऐसी बहुत सारी मिसालें पेश की जा सकती हैं। यहाँ कुछ शेर खास तौर पर इसलिए पेश किए गए हैं ताकि पाठकों को सानी की शायरी की रंग-बिरंगी खूबियों से वाकफियत हो सके।\nकुल मिलाकर, नूरुद्दीन सानी की शायरी घने जंगलों के बीच बहने वाले एक साफ और पारदर्शी झरने की तरह है, जिस तक बहुत कम लोगों की पहुँच रही है।पक्की उम्मीद है कि और अभ्यास के साथ सानी की शायरी में दिन-ब-दिन और निखार आएगा। भाषा की शुद्धता, बयान की मिठास और विषयों की नवीनता नए-नए रंग बिखेरेगी। हमें उनके अगले काव्य संग्रह का इंतज़ार रहेगा।"
}
},
{
"id": 5,
"title": {
"ur": "اپنی لگن کا سچا شاعر: نورالدین ثانی",
"en": "A True Poet of Dedication: Nooruddin Sani",
"hi": "अपनी लगन का सच्चा शायर: नूरुद्दीन सानी"
},
"author": {
"ur": "(خیر اندیش) جمیل مظہر سیانوی",
"en": "(Khair Andesh) Jameel Mazhar Siyanvi",
"hi": "(खैर अंदेश) जमी ल मज़हर सियानवी"
},
"content": {
"ur": "حدیث پاک میں ہے کہ ”الشعراء تلامیذ الرحمٰن“ شعراء اللہ کے شاگرد ہوتے ہیں، ایک فارسی مقولہ ہے ”شاعری جزو یست پیغمبری“ شاعری پیغمبری کا ایک جزو ہے، مولانا روم فرماتے ہیں وحی، القاء اور الہام وہ علم ہیں، جسکو سیکھا نہیں جا سکتا بلکہ یہ علوم اللہ تعالیٰ کی جانب سے براہ راست عطا کئے جاتے ہیں، وحی انبیاء پر نازل کی جاتی ہے، القاء صوفیوں پر اور الہام کا نزول شعراء پر ہوتاہے۔\nآتے ہیں غیب سے یہ مضامیں خیال میں \nغالب صریر خامہ نوائے سروش ہے\nغالب\nاسی کے فیض سے میری نگاہ ہے روشن \nاسی کے فیض سے میرے سبو میں ہے جیحوں \nاقبال\nان اشعار سے اندازہ ہوتا ہے کہ شاعری عطائے خداوندی اور فضل ربانی ہے، جسکا دل حساس ہو، طبیعت موزوں ہو  قوت متخیلہ اور قوت متمیزہ سے اللہ نے جسکو نوازا ہو، وہی شاعر کامیاب ہوتاہے، اردو شاعری کا آغاز امیر خسرو کے ہندوی کلام سے ہوتاہے، اردو غزل کو نئی اڑان ولی دکنی نے عطا کی، میر، غالب مومن،  داغ وغیرہ نے اردو غزل کو فروغ دینے میں اہم کردار ادا کیا، اور آج تک صنف غزل محو پرواز ہے، غزل کے معنی محبوب سے باتیں کرنے کے ہوتے ہیں، اسی لئے ایک عرصہ تک غزل حسن و عشق گیسو و رخسار کا رہین رہی، لیکن دھیرے دھیرے اس نے اپنے پنکھ پسارے اور آج دنیا بھر کے موضوعات غزل کا حصہ ہیں،یہ ساری تمہید میں نے اسلئے باندھی کہ اس وقت میرے سامنے نورالدین ثانی صاحب کا کچھ کلام موجود ہے ثانی صاحب سے میری ملاقات نئی دہلی سیماپوری میں صوفی گلفام شاہجہاں پوری کے دولت خانہ پر ایک شعری نشست میں ہوئی، معلوم ہوا کہ ثانی صاحب میرے شاگرد نوشاد ثمر بگراسوی کو استاد تسلیم کر کے ان سے اصلاح لیتے ہیں، ثانی صاحب کے غزلیات کو پڑھنے سے اندازہ ہوتا ہے کہ ان کے کلام میں فکر کا عنصر غالب ہے البتہ وہ جو کچھ کہتے ہیں اپنی ذات کے حوالے سے کہتے ہیں، انکے کلام میں برجستگی، ہم آہنگی اور روانی ہے، تہذیب کی شکست، معاشرہ کی مردہ ضمیری، ملک و ملت کی زبوں حالی، خود غرضی اور خود پرستی کے مضامین بھی انکے کلام میں خوب خوب نظر آتے ہیں۔ ملاحظہ کیجئے چند اشعار\nرہزنی آنے لگی جب رہبروں کے درمیاں \nایک وحشت سی ہے طاری قافلوں کے درمیاں \nکس کو فرصت ہے یہاں اور کون حال دل سنے\nہر کوئی الجھا ہوا ہے مسئلوں کے درمیاں \nداستان غم دل کس کو سناؤں ثانی\nجو بھی سنتا ہے کھسک جاتا ہے\nنورالدین ثانی صاحب نے شاعری کو ایک نئی جہت دینے کی بھرپور کوشش کی ہے، کہتے ہیں:\nجو ہوا سو ہوا اماں چھوڑو\nظلم کا تذکرہ اماں چھوڑو\nتیرا کردار ہے تیری پہچان\nیاد یہ بات برابر رکھنا\nثانی منزل ملے گی بھلا کس طرح\nجو ہیں بھٹکے ہوئے رہبری کے سبب\nثانی صاحب کا مجموعہ کلام عکس ثانی بہت جلد منظر عام پر آنے والا ہے، میری دعا ہے اور امید ہے کہ مقبول خاص و عام ہوگا۔",
"en": "A Hadith states, “Al-shu’ara talaamidh al-Rahman,” meaning poets are the disciples of the Most Merciful. A Persian saying goes, “Sha’iri juzw-e-ist paighambari,” meaning poetry is a part of prophethood. Maulana Rumi says that revelation, inspiration, and intuition are forms of knowledge that cannot be taught but are directly bestowed by Allah Almighty. Revelation descends upon prophets, inspiration upon Sufis, and intuition upon poets.\nGhalib says:\n\nAate hain ghaib se yeh mazameen khayal mein\nGhalib sareer-e-khaama nawa-e-suroosh hai\n\nIqbal says:\n\nIsi ke faiz se meri nigah hai roshan\nIsi ke faiz se mere saboo mein hai jehoon\n\nThese verses suggest that poetry is a divine gift and a blessing from the Almighty. A poet with a sensitive heart, a refined disposition, and endowed with imagination and discernment by Allah is the one who succeeds. Urdu poetry began with Amir Khusrau’s Hindavi verses. Wali Deccani gave Urdu ghazal a new flight, and poets like Mir, Ghalib, Momin, and Daagh played a significant role in its development. The ghazal continues to soar even today. The word “ghazal” means conversing with the beloved, which is why, for a long time, ghazals were devoted to themes of love, beauty, tresses, and faces. But gradually, it spread its wings, and today, topics from across the world are part of the ghazal.\n\nI have provided this preface because I currently have some of Nooruddin Sani Sahib’s poetry before me. I met Sani Sahib at a poetic gathering at the residence of Sufi Gulfam Shahjahanpuri in Seemapuri, New Delhi. I learned that Sani Sahib considers my student, Naushad Samar Bagravi, his mentor and seeks his guidance for refinement. Reading Sani Sahib’s ghazals reveals that his poetry is dominated by intellectual depth, yet whatever he expresses is rooted in his personal experiences. His verses possess spontaneity, harmony, and fluency. Themes of cultural decline, society’s apathy, the nation’s degradation, selfishness, and self-obsession are vividly present in his work. Consider these verses:\n\n\nRahzani aane lagi jab rahbaron ke darmiyaan\nEk wahshat si hai taari qaflon ke darmiyaan\n\n\nKis ko fursat hai yahan aur kaun haal-e-dil sune\nHar koi uljha hua hai masa’ilon ke darmiyaan\n\n\nDastaan-e-gham-e-dil kis ko sunaun Sani\nJo bhi sunta hai khisak jata hai\n\nNooruddin Sani Sahib has made a sincere effort to give poetry a new dimension. He says:\n\n\nJo hua so hua amaan chhodo\nZulm ka tazkira amaan chhodo\n\n\nTera kirdaar hai teri pehchaan\nYaad yeh baat barabar rakhna\n\n\nSani manzil milegi bhala kis tarah\nJo hain bhatke hue rahbari ke sabab\n\nSani Sahib’s poetry collection, Aks-e-Sani, is soon to be published. I pray and hope that it will be widely appreciated by both the masses and the elite.",
"hi": "हदीस में है कि “अल-शु’आरा तलामीज़ अल-रहमान” यानी शायर रहमान के शिष्य होते हैं। एक फारसी कहावत है, “शायरी जुज़्व-ए-यस्त पैगंबरी” यानी शायरी पैगंबरी का एक हिस्सा है। मौलाना रूमी कहते हैं कि वह्य (प्रकाशन), इल्का (प्रेरणा), और इल्हाम (अंतर्जनन) ऐसे ज्ञान हैं जिन्हें सिखाया नहीं जा सकता, बल्कि ये ज्ञान अल्लाह ताला की ओर से सीधे प्रदान किए जाते हैं। वह्य नबियों पर उतरती है, इल्का सूफियों पर, और इल्हाम शायरों पर।\nग़ालिब कहते हैं:\n\nआते हैं ग़ैब से ये मज़ामीं खयाल में\nग़ालिब सरीरे ख़ामा नवा-ए-सुरूश है\n\nइकबाल कहते हैं:\n\nइसी के फ़ैज़ से मेरी निगाह है रोशन\nइसी के फ़ैज़ से मेरे सबू में है जिहूं\n\nइन शेरों से अंदाज़ा होता है कि शायरी एक ईश्वरीय उपहार और रब्बानी इनायत है। जिसका दिल संवेदनशील हो, स्वभाव मोज़ूं हो, और जिसे अल्लाह ने कल्पनाशक्ति और विवेकशक्ति से नवाज़ा हो, वही शायर कामयाब होता है। उर्दू शायरी की शुरुआत अमीर खुसरो के हिंदवी काव्य से हुई। वाली दकनी ने उर्दू ग़ज़ल को नई उड़ान दी, और मीर, ग़ालिब, मोमिन, दाग़ वगैरह ने उर्दू ग़ज़ल को बढ़ावा देने में अहम भूमिका निभाई। आज तक ग़ज़ल की विधा उड़ान भर रही है। ग़ज़ल का मतलब है प्रियतम से बातें करना, इसीलिए लंबे समय तक ग़ज़ल हुस्न, इश्क, ज़ुल्फ और रुखसार की मोहताज रही। लेकिन धीरे-धीरे इसने अपने पंख फैलाए, और आज दुनिया भर के विषय ग़ज़ल का हिस्सा हैं।\n\nयह सारी प्रस्तावना मैंने इसलिए दी, क्योंकि इस वक्त मेरे सामने नूरुद्दीन सानी साहब का कुछ काव्य मौजूद है। सानी साहब से मेरी मुलाकात नई दिल्ली के सीमापुरी में सूफी गुलफाम शाहजहाँपुरी के घर पर एक काव्य गोष्ठी में हुई। पता चला कि सानी साहब मेरे शिष्य नौशाद समर बगरासवी को अपना गुरु मानते हैं और उनसे अपनी रचनाओं की संशोधन करवाते हैं। सानी साहब की ग़ज़लों को पढ़ने से पता चलता है कि उनके काव्य में विचारों का तत्व प्रमुख है, लेकिन जो कुछ वे कहते हैं, वह अपनी ज़ात के हवाले से कहते हैं। उनके काव्य में सहजता, समन्वय और प्रवाह है। सभ्यता की टूटन, समाज की मरी हुई ज़मीर, देश और कौम की बदहाली, स्वार्थ और आत्ममोह के विषय भी उनके काव्य में खूब नज़र आते हैं। कुछ शेर देखिए:\n\n\nरहज़नी आने लगी जब रहबरों के दरमियाँ\nएक वहशत सी है तारी क़ाफिलों के दरमियाँ\n\n\nकिस को फुरसत है यहाँ और कौन हाल-ए-दिल सुने\nहर कोई उलझा हुआ है मसाइलों के दरमियाँ\n\n\nदास्तान-ए-ग़म-ए-दिल किस को सुनाऊँ सानी\nजो भी सुनता है खिसक जाता है\n\nनूरुद्दीन सानी साहब ने शायरी को एक नई दिशा देने की पूरी कोशिश की है। वे कहते हैं:\n\n\nजो हुआ सो हुआ अमाँ छोड़ो\nज़ुल्म का तज़किरा अमाँ छोड़ो\n\n\nतेरा किरदार है तेरी पहचान\nयाद ये बात बराबर रखना\n\n\nसानी मंज़िल मिलेगी भला किस तरह\nजो हैं भटके हुए रहबरी के सबब\n\nसानी साहब का काव्य संग्रह अक्स-ए-सानी जल्द ही आम लोगों के सामने आएगा। मेरी दुआ और उम्मीद है कि यह खास और आम दोनों में मकबूल होगा।"
}
},
{
"id": 6,
"title": {
"ur": "جدو جہد کا شاعر",
"en": "The Poet of Struggle",
"hi": "संघर्ष का शायर"
},
"author": {
"ur": "ڈاکٹر انور ایرج، صدر شعبہئ اردو\nڈی، ایس کالج، کٹیہار،8210645681",
"en": "Dr. Anwar Iraj, Head of Urdu Department\nD.S. College, Katihar, 8210645681",
"hi": "डॉ. अनवर इरज, उर्दू विभागाध्यक्ष\nडी.एस. कॉलेज, कटिहार, 8210645681"
},
"content": {
"ur": "نور الدین ثانیؔ ایک ایسا شاعر ہے، جو پیٹ کی بھوک اور ضروریاتِ زندگی کے لئے دن میں مزدوری کرتا ہے اور تھکے ماندے جسم وجاں کے ساتھ، قلب وذہن کی آسودگی اور روح کی تسکین کے لئے رات کا ایک بڑا حصہ ”عکس ثانی“ کی تلاش وجستجو میں گزار دیتا ہے۔ روح وتن کے اس مزدور کش شاعر کے لئے میں سفارش کرتا ہوں کہ احوال وکوائف کے حوالے سے مجموعہ میں شامل ان کی تحریر ”کہاں میں او رکہاں یہ نکہت گل“ ضرور پڑھیں تاکہ آپ بھی اس احساس سے دوچار ہوسکیں کہ کس خونِ جگر سے ”عکس ثانی“ کی کشید ہوئی ہے اور تخلیق کی رگوں میں کس درجہ حرارت باقی ہے۔\nنورا لدین ثانیؔ افق شاعری پر نمودار ہونے والا بھلے ہی کوئی روشن ستارہ نہ ہو، جگنو بھراُ جالا ہی سہی، جس نے نامساعد حالات وظلمات کا سینہ چیر کر اپنی موجودگی کا احساس پیدا کرانے میں کامیاب تو ہوگیا، یہ تخلیقی عزائم اور حوصلہ مندی احتراماً آپ کے دل میں گھر کرلے گی۔\nثانیؔ کی تخلیقی عمر کم سنی کے دور میں ہے، بمشکل ایک دہائی کی شاعری میں فنّی کمالات اور تخلیقی جواہر تلاش کرنا، یا کسی سن رسیدہ اور مشّاق شاعر کی کسوٹی پر شعر کو پرکھنا کوئی منصفانہ عمل نہیں ہوگا، ہاں ثانیؔ کو انکے ہم عصر اور تازہ کارشاعروں کی صف میں دیکھیں تو ممکن ہے ان کی حیثیت پہلی صف کے مقتدی یا پھر امام کی بھی ہوسکتی ہے۔ کم سنی میں نئے نئے حادثات وواقعات سے گزرنا، زمانے کی سفّاکیوں او ربے اعتنائیوں کو جھیلنا، جبرواستحصال کے کرب کو محسوس کرنا او راس طرح دنیا کو ہزار رنگ جلوہ سامانیوں میں دیکھنا، یہ سب کچھ انہیں ایک تجربہ کار اور حساس شاعر کے طور پہ سامنے لاتا ہے، اور شاید یہی وجہ ہے کہ فہم وادراک کا ایک رچا ہوا شعور بھی وقت سے پہلے انہیں میسر ہوا۔ اس رچے ہوئے شعور کو بروئے کار لاتے ہوئے اپنی شاعری کا دامن وسیع کرنے کی سعی کی، جس میں وہ حددرجہ کامیاب نظر آتے ہیں امید ہے ”عکس ثانیؔ“ کا نقش اوّل آپ کو ضرور متاثر کرے گا۔ بس تین شعر کے ساتھ نور الدین ثانیؔ اور ”عکس ثانی“ آپ کے حوالے، جو مزاج یار میں آئے۔\nامیر شہر ایک جاہل بنا ہے\n\nہنر ثانی سنبھل کر دکھانا\nرفاقت ہوگئی جب تیرگی سے\n\nدِیا ٹھکرا رہا ہے روشنی کو\nخود اپنے آپ پہ ثانی یقین ہے مجھ کو\n\nمری ہتھیلی سے اک دن اجالا نکلے گا\n",
"en": "Nooruddin Sani is a poet who labors during the day to satisfy the hunger of his stomach and the necessities of life, and with a weary body and soul, spends a large part of the night in search of Aks-e-Sani to find solace for his heart and mind and peace for his soul. For this laborer-poet of body and spirit, I recommend reading his essay “Kahan Main Aur Kahan Yeh Nukhat-e-Gul” included in his collection, so you too can experience the feeling of the heartfelt effort with which Aks-e-Sani was crafted and the warmth that still flows through the veins of his creations.\n\nNooruddin Sani may not be a shining star on the horizon of poetry, but even as a net full of fireflies, he has succeeded in making his presence felt by piercing through adverse circumstances and darkness. This creative resolve and courage will find a place of respect in your heart.\n\nSani’s creative age is still in its infancy. To search for technical mastery or creative gems in barely a decade of poetry, or to judge his verses by the standards of a seasoned and skilled poet, would not be a just act. However, if you view Sani among his contemporary and emerging poets, his stature could be that of a follower in the first row or even an imam. Experiencing new events and incidents at a young age, enduring the indifference and neglect of the world, feeling the pain of oppression and exploitation, and seeing the world in a thousand vibrant hues—all of this brings him forth as an experienced and sensitive poet. Perhaps this is why a deep, cultivated consciousness was granted to him ahead of time. By employing this profound consciousness, he has strived to expand the scope of his poetry, and he appears largely successful in this endeavor. I hope the first imprint of Aks-e-Sani will surely impress you. With just three verses, I present Nooruddin Sani and Aks-e-Sani to you, to resonate with your friend’s temperament.\n\n\nAmeer-e-shahr ek jaahil bana hai\nHunar Sani sambhal kar tum dikhaana\n\n\nRafaqat ho gayi jab tirgi se\nDiya thukra raha hai roshni ko\n\n\nKhud apne aap pe Sani yaqeen hai mujhe\nMeri hatheli se ek din ujala niklega",
"hi": "नूरुद्दीन सानी एक ऐसा शायर है, जो दिन में पेट की भूख और जीवन की जरूरतों को पूरा करने के लिए मजदूरी करता है, और थके-मांदे शरीर व आत्मा के साथ, दिल और दिमाग की शांति तथा आत्मा की तृप्ति के लिए रात का बड़ा हिस्सा अक्स-ए-सानी की तलाश और खोज में बिताता है। इस आत्मा और शरीर के मजदूर-शायर के लिए मैं सिफारिश करता हूँ कि उनकी किताब में शामिल उनकी तहरीर “कहाँ मैं और कहाँ यह नुक्खत-ए-गुल” जरूर पढ़ें, ताकि आप भी उस अहसास से रूबरू हो सकें कि किस खून-ए-जिगर से अक्स-ए-सानी की कशीदाकारी हुई है और रचना की नसों में कितनी गर्मजोशी बाकी है।\n\nनूरुद्दीन सानी शायरी के आकाश पर भले ही कोई चमकता सितारा न हो, एक जुगनू-भरा जाला ही सही, जिसने नामुनासिब हालात और अंधेरों का सीना चीरकर अपनी मौजूदगी का अहसास कराने में कामयाबी तो हासिल कर ली। यह रचनात्मक हौसला और जज्बा आपके दिल में आदर के साथ जगह बनाएगा।\n\nसानी की रचनात्मक उम्र अभी बचपन के दौर में है। मुश्किल से एक दशक की शायरी में तकनीकी कमाल या रचनात्मक जवाहरात तलाश करना, या किसी बुजुर्ग और माहिर शायर के पैमाने पर उनके शेरों को परखना, कोई इंसाफपूर्ण कार्य नहीं होगा। हाँ, सानी को उनके समकालीन और नए शायरों की कतार में देखें, तो शायद उनकी हैसियत पहली पंक्ति के मुक्तदी या फिर इमाम की भी हो सकती है। कम उम्र में नए-नए हादसों और वाकयों से गुजरना, जमाने की बेरुखी और बेपरवाही को झेलना, जुल्म और शोषण के दर्द को महसूस करना, और इस तरह दुनिया को हजारों रंगों और रूपों में देखना—यह सब उन्हें एक अनुभवी और संवेदनशील शायर के रूप में सामने लाता है। शायद यही वजह है कि समझ और बोध का एक गहरा चेतन उन्हें वक्त से पहले हासिल हुआ। इस गहरे चेतन को काम में लाते हुए उन्होंने अपनी शायरी का दायरा विस्तृत करने की कोशिश की, जिसमें वे काफी हद तक कामयाब नजर आते हैं। उम्मीद है कि अक्स-ए-सानी का पहला नक्श आपको जरूर प्रभावित करेगा। बस तीन शेरों के साथ नूरुद्दीन सानी और अक्स-ए-सानी आपके हवाले, जो आपके यार के मिजाज में आए।\n\n\nअमीर-ए-शहर एक जाहिल बना है\nहुनर सानी संभल कर तुम दिखाना\n\n\nरफाकत हो गई जब तिरगी से\nदिया ठुकरा रहा है रौशनी को\n\n\nखुद अपने आप पे सानी यकीन है मुझे\nमेरी हथेली से एक दिन उजाला निकलेगा"
}
}
]